http://www.brandonfa.lk/win8/index.html
http://www.brandonfa.lk/win8/win8_devrel_head_x64/
http://www.brandonfa.lk/win8/win8_devrel_head_x86/usbhub3.h

/* Header autogenerated by Brandon Falk's PDB Dumper
 *
 * Invocation: C:\projects\pdbdump_2\pdbdump.exe L:\symbolarchive\win8_spB_x86\usbhub3.pdb\57481AAE05524EA6B516C421B9C8948E2\usbhub3.pdb
 */

struct LIST_ENTRY64 {
    unsigned long long  Flink; /*  +0x0000  */
    unsigned long long  Blink; /*  +0x0008  */
};

struct LIST_ENTRY32 {
    unsigned long  Flink; /*  +0x0000  */
    unsigned long  Blink; /*  +0x0004  */
};

struct _LIST_ENTRY {
    unsigned char Flink[4]; /*  +0x0000 18 10 00 00  */
    unsigned char Blink[4]; /*  +0x0004 18 10 00 00  */
};

struct _SINGLE_LIST_ENTRY {
    unsigned char Next[4]; /*  +0x0000 2a 10 00 00  */
};

struct _UNICODE_STRING {
    unsigned short  Length; /*  +0x0000  */
    unsigned short  MaximumLength; /*  +0x0002  */
    unsigned short *Buffer; /*  +0x0004  */
};

struct _STRING {
    unsigned short  Length; /*  +0x0000  */
    unsigned short  MaximumLength; /*  +0x0002  */
    char *Buffer; /*  +0x0004  */
};

/* struct <unnamed-tag> {
    unsigned long  LowPart;  +0x0000 
    long  HighPart;  +0x0004 
}; */

struct _LARGE_INTEGER {
    unsigned long  LowPart; /*  +0x0000  */
    long  HighPart; /*  +0x0004  */
    /* unsigned char u[0];  +0x0000 3c 10 00 00  */
    long long  QuadPart; /*  +0x0000  */
};

/* struct <unnamed-tag> {
    unsigned long  LowPart;  +0x0000 
    unsigned long  HighPart;  +0x0004 
}; */

struct _ULARGE_INTEGER {
    unsigned long  LowPart; /*  +0x0000  */
    unsigned long  HighPart; /*  +0x0004  */
    /* unsigned char u[0];  +0x0000 41 10 00 00  */
    unsigned long long  QuadPart; /*  +0x0000  */
};

struct _FAST_MUTEX {
    unsigned char Count[4]; /*  +0x0000 15 10 00 00  */
    void *Owner; /*  +0x0004  */
    unsigned long  Contention; /*  +0x0008  */
    unsigned char Event[16]; /*  +0x000c 4b 10 00 00  */
    unsigned long  OldIrql; /*  +0x001c  */
};

enum _EVENT_TYPE {
    NotificationEvent = 0,
    SynchronizationEvent = 1
};

struct _KEVENT {
    unsigned char Header[16]; /*  +0x0000 56 10 00 00  */
};

struct _SLIST_HEADER {
    unsigned long long  Alignment; /*  +0x0000  */
    unsigned char Next[4]; /*  +0x0000 29 10 00 00  */
    unsigned short  Depth; /*  +0x0004  */
    unsigned short  Sequence; /*  +0x0006  */
};

struct _LOOKASIDE_LIST_EX {
    unsigned char L[72]; /*  +0x0000 62 10 00 00  */
};

enum _POOL_TYPE {
    NonPagedPool = 0,
    NonPagedPoolExecute = 0,
    PagedPool = 1,
    NonPagedPoolMustSucceed = 2,
    DontUseThisType = 3,
    NonPagedPoolCacheAligned = 4,
    PagedPoolCacheAligned = 5,
    NonPagedPoolCacheAlignedMustS = 6,
    MaxPoolType = 7,
    NonPagedPoolBase = 0,
    NonPagedPoolBaseMustSucceed = 2,
    NonPagedPoolBaseCacheAligned = 4,
    NonPagedPoolBaseCacheAlignedMustS = 6,
    NonPagedPoolSession = 32,
    PagedPoolSession = 33,
    NonPagedPoolMustSucceedSession = 34,
    DontUseThisTypeSession = 35,
    NonPagedPoolCacheAlignedSession = 36,
    PagedPoolCacheAlignedSession = 37,
    NonPagedPoolCacheAlignedMustSSession = 38,
    NonPagedPoolNx = 512,
    NonPagedPoolNxCacheAligned = 516,
    NonPagedPoolSessionNx = 544
};

struct _NPAGED_LOOKASIDE_LIST {
    unsigned char L[72]; /*  +0x0000 82 10 00 00  */
    unsigned long  Lock__ObsoleteButDoNotDelete; /*  +0x0048  */
};

struct _PAGED_LOOKASIDE_LIST {
    unsigned char L[72]; /*  +0x0000 82 10 00 00  */
    unsigned char Lock__ObsoleteButDoNotDelete[32]; /*  +0x0048 49 10 00 00  */
};

struct _WORK_QUEUE_ITEM {
    unsigned char List[8]; /*  +0x0000 17 10 00 00  */
    unsigned char WorkerRoutine[4]; /*  +0x0008 7e 10 00 00  */
    void *Parameter; /*  +0x000c  */
};

struct _MDL {
    unsigned char Next[4]; /*  +0x0000 90 10 00 00  */
    short  Size; /*  +0x0004  */
    short  MdlFlags; /*  +0x0006  */
    unsigned char Process[4]; /*  +0x0008 92 10 00 00  */
    void *MappedSystemVa; /*  +0x000c  */
    void *StartVa; /*  +0x0010  */
    unsigned long  ByteCount; /*  +0x0014  */
    unsigned long  ByteOffset; /*  +0x0018  */
};

enum _MEMORY_CACHING_TYPE {
    MmNonCached = 0,
    MmCached = 1,
    MmWriteCombined = 2,
    MmHardwareCoherentCached = 3,
    MmNonCachedUnordered = 4,
    MmUSWCCached = 5,
    MmMaximumCacheType = 6
};

/* struct <unnamed-tag> {
    /* unsigned char MasterIrp[0];  +0x0000 a4 10 00 00 
    long  IrpCount;  +0x0000 
    void *SystemBuffer;  +0x0000 
}; */

/* struct <unnamed-tag> {
    /* unsigned char UserApcRoutine[0];  +0x0000 ab 10 00 00 
    void *IssuingProcess;  +0x0000 
    void *UserApcContext;  +0x0004 
}; */

/* struct <unnamed-tag> {
    /* unsigned char AsynchronousParameters[0];  +0x0000 ad 10 00 00 
    unsigned char AllocationSize[8];  +0x0000 3a 10 00 00 
}; */

/* struct <unnamed-tag> {
    /* unsigned char DeviceQueueEntry[0];  +0x0000 b5 10 00 00 
    unsigned char DriverContext[16];  +0x0000 b6 10 00 00 
    unsigned char Thread[4];  +0x0010 9f 10 00 00 
    char *AuxiliaryBuffer;  +0x0014 
    unsigned char ListEntry[8];  +0x0018 17 10 00 00 
    /* unsigned char CurrentStackLocation[0];  +0x0020 b8 10 00 00 
    unsigned long  PacketType;  +0x0020 
    unsigned char OriginalFileObject[4];  +0x0024 ba 10 00 00 
}; */

/* struct <unnamed-tag> {
    /* unsigned char Overlay[0];  +0x0000 bc 10 00 00 
    /* unsigned char Apc[0];  +0x0000 bd 10 00 00 
    void *CompletionKey;  +0x0000 
}; */

struct _IRP {
    short  Type; /*  +0x0000  */
    unsigned short  Size; /*  +0x0002  */
    unsigned char MdlAddress[4]; /*  +0x0004 90 10 00 00  */
    unsigned long  Flags; /*  +0x0008  */
    unsigned char AssociatedIrp[4]; /*  +0x000c a6 10 00 00  */
    unsigned char ThreadListEntry[8]; /*  +0x0010 17 10 00 00  */
    unsigned char IoStatus[8]; /*  +0x0018 a7 10 00 00  */
    char  RequestorMode; /*  +0x0020  */
    unsigned char  PendingReturned; /*  +0x0021  */
    char  StackCount; /*  +0x0022  */
    char  CurrentLocation; /*  +0x0023  */
    unsigned char  Cancel; /*  +0x0024  */
    unsigned char  CancelIrql; /*  +0x0025  */
    char  ApcEnvironment; /*  +0x0026  */
    unsigned char  AllocationFlags; /*  +0x0027  */
    unsigned char UserIosb[4]; /*  +0x0028 a8 10 00 00  */
    unsigned char UserEvent[4]; /*  +0x002c 4f 10 00 00  */
    unsigned char Overlay[8]; /*  +0x0030 af 10 00 00  */
    unsigned char CancelRoutine[4]; /*  +0x0038 b4 10 00 00  */
    void *UserBuffer; /*  +0x003c  */
    unsigned char Tail[48]; /*  +0x0040 bf 10 00 00  */
};

/* struct <unnamed-tag> {
    unsigned char SecurityContext[4];  +0x0000 c4 10 00 00 
    unsigned long  Options;  +0x0004 
    unsigned short  FileAttributes;  +0x0008 
    unsigned short  ShareAccess;  +0x000a 
    unsigned long  EaLength;  +0x000c 
}; */

/* struct <unnamed-tag> {
    unsigned char SecurityContext[4];  +0x0000 c4 10 00 00 
    unsigned long  Options;  +0x0004 
    unsigned short  Reserved;  +0x0008 
    unsigned short  ShareAccess;  +0x000a 
    unsigned char Parameters[4];  +0x000c c8 10 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned char SecurityContext[4];  +0x0000 c4 10 00 00 
    unsigned long  Options;  +0x0004 
    unsigned short  Reserved;  +0x0008 
    unsigned short  ShareAccess;  +0x000a 
    unsigned char Parameters[4];  +0x000c cc 10 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned long  Length;  +0x0000 
    unsigned long  Key;  +0x0004 
    unsigned char ByteOffset[8];  +0x0008 3a 10 00 00 
}; */

enum _FILE_INFORMATION_CLASS {
    FileDirectoryInformation = 1,
    FileFullDirectoryInformation = 2,
    FileBothDirectoryInformation = 3,
    FileBasicInformation = 4,
    FileStandardInformation = 5,
    FileInternalInformation = 6,
    FileEaInformation = 7,
    FileAccessInformation = 8,
    FileNameInformation = 9,
    FileRenameInformation = 10,
    FileLinkInformation = 11,
    FileNamesInformation = 12,
    FileDispositionInformation = 13,
    FilePositionInformation = 14,
    FileFullEaInformation = 15,
    FileModeInformation = 16,
    FileAlignmentInformation = 17,
    FileAllInformation = 18,
    FileAllocationInformation = 19,
    FileEndOfFileInformation = 20,
    FileAlternateNameInformation = 21,
    FileStreamInformation = 22,
    FilePipeInformation = 23,
    FilePipeLocalInformation = 24,
    FilePipeRemoteInformation = 25,
    FileMailslotQueryInformation = 26,
    FileMailslotSetInformation = 27,
    FileCompressionInformation = 28,
    FileObjectIdInformation = 29,
    FileCompletionInformation = 30,
    FileMoveClusterInformation = 31,
    FileQuotaInformation = 32,
    FileReparsePointInformation = 33,
    FileNetworkOpenInformation = 34,
    FileAttributeTagInformation = 35,
    FileTrackingInformation = 36,
    FileIdBothDirectoryInformation = 37,
    FileIdFullDirectoryInformation = 38,
    FileValidDataLengthInformation = 39,
    FileShortNameInformation = 40,
    FileIoCompletionNotificationInformation = 41,
    FileIoStatusBlockRangeInformation = 42,
    FileIoPriorityHintInformation = 43,
    FileSfioReserveInformation = 44,
    FileSfioVolumeInformation = 45,
    FileHardLinkInformation = 46,
    FileProcessIdsUsingFileInformation = 47,
    FileNormalizedNameInformation = 48,
    FileNetworkPhysicalNameInformation = 49,
    FileIdGlobalTxDirectoryInformation = 50,
    FileIsRemoteDeviceInformation = 51,
    FileAttributeCacheInformation = 52,
    FileNumaNodeInformation = 53,
    FileStandardLinkInformation = 54,
    FileRemoteProtocolInformation = 55,
    FileRenameInformationBypassAccessCheck = 56,
    FileLinkInformationBypassAccessCheck = 57,
    FileIntegrityStreamInformation = 58,
    FileVolumeNameInformation = 59,
    FileMaximumInformation = 60
};

/* struct <unnamed-tag> {
    unsigned long  Length;  +0x0000 
    unsigned char FileName[4];  +0x0004 2f 10 00 00 
    unsigned char FileInformationClass[4];  +0x0008 d2 10 00 00 
    unsigned long  FileIndex;  +0x000c 
}; */

/* struct <unnamed-tag> {
    unsigned long  Length;  +0x0000 
    unsigned long  CompletionFilter;  +0x0004 
}; */

/* struct <unnamed-tag> {
    unsigned long  Length;  +0x0000 
    unsigned char FileInformationClass[4];  +0x0004 d2 10 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned long  Length;  +0x0000 
    unsigned char FileInformationClass[4];  +0x0004 d2 10 00 00 
    unsigned char FileObject[4];  +0x0008 ba 10 00 00 
    unsigned char  ReplaceIfExists;  +0x000c 
    unsigned char  AdvanceOnly;  +0x000d 
    unsigned long  ClusterCount;  +0x000c 
    void *DeleteHandle;  +0x000c 
}; */

/* struct <unnamed-tag> {
    unsigned long  Length;  +0x0000 
    void *EaList;  +0x0004 
    unsigned long  EaListLength;  +0x0008 
    unsigned long  EaIndex;  +0x000c 
}; */

/* struct <unnamed-tag> {
    unsigned long  Length;  +0x0000 
}; */

enum _FSINFOCLASS {
    FileFsVolumeInformation = 1,
    FileFsLabelInformation = 2,
    FileFsSizeInformation = 3,
    FileFsDeviceInformation = 4,
    FileFsAttributeInformation = 5,
    FileFsControlInformation = 6,
    FileFsFullSizeInformation = 7,
    FileFsObjectIdInformation = 8,
    FileFsDriverPathInformation = 9,
    FileFsVolumeFlagsInformation = 10,
    FileFsSectorSizeInformation = 11,
    FileFsMaximumInformation = 12
};

/* struct <unnamed-tag> {
    unsigned long  Length;  +0x0000 
    unsigned char FsInformationClass[4];  +0x0004 e0 10 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned long  OutputBufferLength;  +0x0000 
    unsigned long  InputBufferLength;  +0x0004 
    unsigned long  FsControlCode;  +0x0008 
    void *Type3InputBuffer;  +0x000c 
}; */

/* struct <unnamed-tag> {
    unsigned char Length[4];  +0x0000 e5 10 00 00 
    unsigned long  Key;  +0x0004 
    unsigned char ByteOffset[8];  +0x0008 3a 10 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned long  OutputBufferLength;  +0x0000 
    unsigned long  InputBufferLength;  +0x0004 
    unsigned long  IoControlCode;  +0x0008 
    void *Type3InputBuffer;  +0x000c 
}; */

/* struct <unnamed-tag> {
    unsigned long  SecurityInformation;  +0x0000 
    unsigned long  Length;  +0x0004 
}; */

/* struct <unnamed-tag> {
    unsigned long  SecurityInformation;  +0x0000 
    void *SecurityDescriptor;  +0x0004 
}; */

/* struct <unnamed-tag> {
    unsigned char Vpb[4];  +0x0000 ef 10 00 00 
    unsigned char DeviceObject[4];  +0x0004 b1 10 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned char Srb[4];  +0x0000 f3 10 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned long  Length;  +0x0000 
    void *StartSid;  +0x0004 
    unsigned char SidList[4];  +0x0008 f7 10 00 00 
    unsigned long  SidListLength;  +0x000c 
}; */

enum _DEVICE_RELATION_TYPE {
    BusRelations = 0,
    EjectionRelations = 1,
    PowerRelations = 2,
    RemovalRelations = 3,
    TargetDeviceRelation = 4,
    SingleBusRelations = 5,
    TransportRelations = 6
};

/* struct <unnamed-tag> {
    unsigned char Type[4];  +0x0000 fb 10 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned char InterfaceType[4];  +0x0000 00 11 00 00 
    unsigned short  Size;  +0x0004 
    unsigned short  Version;  +0x0006 
    unsigned char Interface[4];  +0x0008 02 11 00 00 
    void *InterfaceSpecificData;  +0x000c 
}; */

/* struct <unnamed-tag> {
    unsigned char Capabilities[4];  +0x0000 06 11 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned char IoResourceRequirementList[4];  +0x0000 0a 11 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned long  WhichSpace;  +0x0000 
    void *Buffer;  +0x0004 
    unsigned long  Offset;  +0x0008 
    unsigned long  Length;  +0x000c 
}; */

/* struct <unnamed-tag> {
    unsigned char  Lock;  +0x0000 
}; */

enum BUS_QUERY_ID_TYPE {
    BusQueryDeviceID = 0,
    BusQueryHardwareIDs = 1,
    BusQueryCompatibleIDs = 2,
    BusQueryInstanceID = 3,
    BusQueryDeviceSerialNumber = 4,
    BusQueryContainerID = 5
};

/* struct <unnamed-tag> {
    unsigned char IdType[4];  +0x0000 12 11 00 00 
}; */

enum DEVICE_TEXT_TYPE {
    DeviceTextDescription = 0,
    DeviceTextLocationInformation = 1
};

/* struct <unnamed-tag> {
    unsigned char DeviceTextType[4];  +0x0000 16 11 00 00 
    unsigned long  LocaleId;  +0x0004 
}; */

enum _DEVICE_USAGE_NOTIFICATION_TYPE {
    DeviceUsageTypeUndefined = 0,
    DeviceUsageTypePaging = 1,
    DeviceUsageTypeHibernation = 2,
    DeviceUsageTypeDumpFile = 3,
    DeviceUsageTypeBoot = 4
};

/* struct <unnamed-tag> {
    unsigned char  InPath;  +0x0000 
    unsigned char Reserved[3];  +0x0001 19 11 00 00 
    unsigned char Type[4];  +0x0004 1b 11 00 00 
}; */

enum _SYSTEM_POWER_STATE {
    PowerSystemUnspecified = 0,
    PowerSystemWorking = 1,
    PowerSystemSleeping1 = 2,
    PowerSystemSleeping2 = 3,
    PowerSystemSleeping3 = 4,
    PowerSystemHibernate = 5,
    PowerSystemShutdown = 6,
    PowerSystemMaximum = 7
};

/* struct <unnamed-tag> {
    unsigned char PowerState[4];  +0x0000 1f 11 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned char PowerSequence[4];  +0x0000 23 11 00 00 
}; */

enum _POWER_STATE_TYPE {
    SystemPowerState = 0,
    DevicePowerState = 1
};

enum POWER_ACTION {
    PowerActionNone = 0,
    PowerActionReserved = 1,
    PowerActionSleep = 2,
    PowerActionHibernate = 3,
    PowerActionShutdown = 4,
    PowerActionShutdownReset = 5,
    PowerActionShutdownOff = 6,
    PowerActionWarmEject = 7
};

/* struct <unnamed-tag> {
    unsigned long  SystemContext;  +0x0000 
    unsigned char SystemPowerStateContext[4];  +0x0000 26 11 00 00 
    unsigned char Type[4];  +0x0004 28 11 00 00 
    unsigned char State[4];  +0x0008 29 11 00 00 
    unsigned char ShutdownType[4];  +0x000c 2b 11 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned char AllocatedResources[4];  +0x0000 2f 11 00 00 
    unsigned char AllocatedResourcesTranslated[4];  +0x0004 2f 11 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned long  ProviderId;  +0x0000 
    void *DataPath;  +0x0004 
    unsigned long  BufferSize;  +0x0008 
    void *Buffer;  +0x000c 
}; */

/* struct <unnamed-tag> {
    void *Argument1;  +0x0000 
    void *Argument2;  +0x0004 
    void *Argument3;  +0x0008 
    void *Argument4;  +0x000c 
}; */

/* struct <unnamed-tag> {
    /* unsigned char Create[0];  +0x0000 c6 10 00 00 
    /* unsigned char CreatePipe[0];  +0x0000 ca 10 00 00 
    /* unsigned char CreateMailslot[0];  +0x0000 ce 10 00 00 
    /* unsigned char Read[0];  +0x0000 d0 10 00 00 
    /* unsigned char Write[0];  +0x0000 d0 10 00 00 
    /* unsigned char QueryDirectory[0];  +0x0000 d4 10 00 00 
    /* unsigned char NotifyDirectory[0];  +0x0000 d6 10 00 00 
    /* unsigned char QueryFile[0];  +0x0000 d8 10 00 00 
    /* unsigned char SetFile[0];  +0x0000 da 10 00 00 
    /* unsigned char QueryEa[0];  +0x0000 dc 10 00 00 
    /* unsigned char SetEa[0];  +0x0000 de 10 00 00 
    /* unsigned char QueryVolume[0];  +0x0000 e2 10 00 00 
    /* unsigned char SetVolume[0];  +0x0000 e2 10 00 00 
    /* unsigned char FileSystemControl[0];  +0x0000 e4 10 00 00 
    /* unsigned char LockControl[0];  +0x0000 e7 10 00 00 
    /* unsigned char DeviceIoControl[0];  +0x0000 e9 10 00 00 
    /* unsigned char QuerySecurity[0];  +0x0000 eb 10 00 00 
    /* unsigned char SetSecurity[0];  +0x0000 ed 10 00 00 
    /* unsigned char MountVolume[0];  +0x0000 f1 10 00 00 
    /* unsigned char VerifyVolume[0];  +0x0000 f1 10 00 00 
    /* unsigned char Scsi[0];  +0x0000 f5 10 00 00 
    /* unsigned char QueryQuota[0];  +0x0000 f9 10 00 00 
    /* unsigned char SetQuota[0];  +0x0000 de 10 00 00 
    /* unsigned char QueryDeviceRelations[0];  +0x0000 fd 10 00 00 
    /* unsigned char QueryInterface[0];  +0x0000 04 11 00 00 
    /* unsigned char DeviceCapabilities[0];  +0x0000 08 11 00 00 
    /* unsigned char FilterResourceRequirements[0];  +0x0000 0c 11 00 00 
    /* unsigned char ReadWriteConfig[0];  +0x0000 0e 11 00 00 
    /* unsigned char SetLock[0];  +0x0000 10 11 00 00 
    /* unsigned char QueryId[0];  +0x0000 14 11 00 00 
    /* unsigned char QueryDeviceText[0];  +0x0000 18 11 00 00 
    /* unsigned char UsageNotification[0];  +0x0000 1d 11 00 00 
    /* unsigned char WaitWake[0];  +0x0000 21 11 00 00 
    /* unsigned char PowerSequence[0];  +0x0000 25 11 00 00 
    /* unsigned char Power[0];  +0x0000 2d 11 00 00 
    /* unsigned char StartDevice[0];  +0x0000 31 11 00 00 
    /* unsigned char WMI[0];  +0x0000 33 11 00 00 
    unsigned char Others[16];  +0x0000 35 11 00 00 
}; */

struct _IO_STACK_LOCATION {
    unsigned char  MajorFunction; /*  +0x0000  */
    unsigned char  MinorFunction; /*  +0x0001  */
    unsigned char  Flags; /*  +0x0002  */
    unsigned char  Control; /*  +0x0003  */
    unsigned char Parameters[16]; /*  +0x0004 37 11 00 00  */
    unsigned char DeviceObject[4]; /*  +0x0014 b1 10 00 00  */
    unsigned char FileObject[4]; /*  +0x0018 ba 10 00 00  */
    unsigned char CompletionRoutine[4]; /*  +0x001c 3a 11 00 00  */
    void *Context; /*  +0x0020  */
};

/* struct <unnamed-tag> {
    /* unsigned char ListEntry[0];  +0x0000 17 10 00 00 
    unsigned char Wcb[40];  +0x0000 4c 11 00 00 
}; */

struct _DEVICE_OBJECT {
    short  Type; /*  +0x0000  */
    unsigned short  Size; /*  +0x0002  */
    long  ReferenceCount; /*  +0x0004  */
    unsigned char DriverObject[4]; /*  +0x0008 49 11 00 00  */
    unsigned char NextDevice[4]; /*  +0x000c b1 10 00 00  */
    unsigned char AttachedDevice[4]; /*  +0x0010 b1 10 00 00  */
    unsigned char CurrentIrp[4]; /*  +0x0014 a4 10 00 00  */
    unsigned char Timer[4]; /*  +0x0018 4b 11 00 00  */
    unsigned long  Flags; /*  +0x001c  */
    unsigned long  Characteristics; /*  +0x0020  */
    unsigned char Vpb[4]; /*  +0x0024 ef 10 00 00  */
    void *DeviceExtension; /*  +0x0028  */
    unsigned long  DeviceType; /*  +0x002c  */
    char  StackSize; /*  +0x0030  */
    unsigned char Queue[40]; /*  +0x0034 4e 11 00 00  */
    unsigned long  AlignmentRequirement; /*  +0x005c  */
    unsigned char DeviceQueue[20]; /*  +0x0060 4f 11 00 00  */
    unsigned char Dpc[32]; /*  +0x0074 40 11 00 00  */
    unsigned long  ActiveThreadCount; /*  +0x0094  */
    void *SecurityDescriptor; /*  +0x0098  */
    unsigned char DeviceLock[16]; /*  +0x009c 4b 10 00 00  */
    unsigned short  SectorSize; /*  +0x00ac  */
    unsigned short  Spare1; /*  +0x00ae  */
    unsigned char DeviceObjectExtension[4]; /*  +0x00b0 51 11 00 00  */
    void *Reserved; /*  +0x00b4  */
};

struct _KDPC {
    unsigned char  Type; /*  +0x0000  */
    unsigned char  Importance; /*  +0x0001  */
    unsigned char Number[2]; /*  +0x0002 58 11 00 00  */
    unsigned char DpcListEntry[8]; /*  +0x0004 17 10 00 00  */
    unsigned char DeferredRoutine[4]; /*  +0x000c 44 11 00 00  */
    void *DeferredContext; /*  +0x0010  */
    void *SystemArgument1; /*  +0x0014  */
    void *SystemArgument2; /*  +0x0018  */
    void *DpcData; /*  +0x001c  */
};

struct _EVENT_DATA_DESCRIPTOR {
    unsigned long long  Ptr; /*  +0x0000  */
    unsigned long  Size; /*  +0x0008  */
    unsigned long  Reserved; /*  +0x000c  */
};

struct _EVENT_DESCRIPTOR {
    unsigned short  Id; /*  +0x0000  */
    unsigned char  Version; /*  +0x0002  */
    unsigned char  Channel; /*  +0x0003  */
    unsigned char  Level; /*  +0x0004  */
    unsigned char  Opcode; /*  +0x0005  */
    unsigned short  Task; /*  +0x0006  */
    unsigned long long  Keyword; /*  +0x0008  */
};

enum _DEVICE_POWER_STATE {
    PowerDeviceUnspecified = 0,
    PowerDeviceD0 = 1,
    PowerDeviceD1 = 2,
    PowerDeviceD2 = 3,
    PowerDeviceD3 = 4,
    PowerDeviceMaximum = 5
};

enum _DEVICE_WAKE_DEPTH {
    DeviceWakeDepthNotWakeable = 0,
    DeviceWakeDepthD0 = 1,
    DeviceWakeDepthD1 = 2,
    DeviceWakeDepthD2 = 3,
    DeviceWakeDepthD3hot = 4,
    DeviceWakeDepthD3cold = 5,
    DeviceWakeDepthMaximum = 6
};

struct _OSVERSIONINFOW {
    unsigned long  dwOSVersionInfoSize; /*  +0x0000  */
    unsigned long  dwMajorVersion; /*  +0x0004  */
    unsigned long  dwMinorVersion; /*  +0x0008  */
    unsigned long  dwBuildNumber; /*  +0x000c  */
    unsigned long  dwPlatformId; /*  +0x0010  */
    unsigned char szCSDVersion[256]; /*  +0x0014 83 11 00 00  */
};

struct _RTL_SPLAY_LINKS {
    unsigned char Parent[4]; /*  +0x0000 87 11 00 00  */
    unsigned char LeftChild[4]; /*  +0x0004 87 11 00 00  */
    unsigned char RightChild[4]; /*  +0x0008 87 11 00 00  */
};

struct _RTL_DYNAMIC_HASH_TABLE_CONTEXT {
    unsigned char ChainHead[4]; /*  +0x0000 18 10 00 00  */
    unsigned char PrevLinkage[4]; /*  +0x0004 18 10 00 00  */
    unsigned long  Signature; /*  +0x0008  */
};

struct _RTL_DYNAMIC_HASH_TABLE_ENUMERATOR {
    unsigned char HashEntry[12]; /*  +0x0000 91 11 00 00  */
    unsigned char ChainHead[4]; /*  +0x000c 18 10 00 00  */
    unsigned long  BucketIndex; /*  +0x0010  */
};

struct _RTL_DYNAMIC_HASH_TABLE {
    unsigned long  Flags; /*  +0x0000  */
    unsigned long  Shift; /*  +0x0004  */
    unsigned long  TableSize; /*  +0x0008  */
    unsigned long  Pivot; /*  +0x000c  */
    unsigned long  DivisorMask; /*  +0x0010  */
    unsigned long  NumEntries; /*  +0x0014  */
    unsigned long  NonEmptyBuckets; /*  +0x0018  */
    unsigned long  NumEnumerators; /*  +0x001c  */
    void *Directory; /*  +0x0020  */
};

struct _IO_DRIVER_CREATE_CONTEXT {
    short  Size; /*  +0x0000  */
    unsigned char ExtraCreateParameter[4]; /*  +0x0004 a0 11 00 00  */
    void *DeviceObjectHint; /*  +0x0008  */
    unsigned char TxnParameters[4]; /*  +0x000c a2 11 00 00  */
};

enum _WHEA_ERROR_TYPE {
    WheaErrTypeProcessor = 0,
    WheaErrTypeMemory = 1,
    WheaErrTypePCIExpress = 2,
    WheaErrTypeNMI = 3,
    WheaErrTypePCIXBus = 4,
    WheaErrTypePCIXDevice = 5,
    WheaErrTypeGeneric = 6
};

enum _WHEA_ERROR_SEVERITY {
    WheaErrSevRecoverable = 0,
    WheaErrSevFatal = 1,
    WheaErrSevCorrected = 2,
    WheaErrSevInformational = 3
};

enum _WHEA_ERROR_SOURCE_TYPE {
    WheaErrSrcTypeMCE = 0,
    WheaErrSrcTypeCMC = 1,
    WheaErrSrcTypeCPE = 2,
    WheaErrSrcTypeNMI = 3,
    WheaErrSrcTypePCIe = 4,
    WheaErrSrcTypeGeneric = 5,
    WheaErrSrcTypeINIT = 6,
    WheaErrSrcTypeBOOT = 7,
    WheaErrSrcTypeSCIGeneric = 8,
    WheaErrSrcTypeIPFMCA = 9,
    WheaErrSrcTypeIPFCMC = 10,
    WheaErrSrcTypeIPFCPE = 11,
    WheaErrSrcTypeMax = 12
};

enum _WHEA_ERROR_PACKET_DATA_FORMAT {
    WheaDataFormatIPFSalRecord = 0,
    WheaDataFormatXPFMCA = 1,
    WheaDataFormatMemory = 2,
    WheaDataFormatPCIExpress = 3,
    WheaDataFormatNMIPort = 4,
    WheaDataFormatPCIXBus = 5,
    WheaDataFormatPCIXDevice = 6,
    WheaDataFormatGeneric = 7,
    WheaDataFormatMax = 8
};

struct _WHEA_ERROR_PACKET_V2 {
    unsigned long  Signature; /*  +0x0000  */
    unsigned long  Version; /*  +0x0004  */
    unsigned long  Length; /*  +0x0008  */
    unsigned char Flags[4]; /*  +0x000c a7 11 00 00  */
    unsigned char ErrorType[4]; /*  +0x0010 a9 11 00 00  */
    unsigned char ErrorSeverity[4]; /*  +0x0014 ab 11 00 00  */
    unsigned long  ErrorSourceId; /*  +0x0018  */
    unsigned char ErrorSourceType[4]; /*  +0x001c ad 11 00 00  */
    unsigned char NotifyType[16]; /*  +0x0020 fe 10 00 00  */
    unsigned long long  Context; /*  +0x0030  */
    unsigned char DataFormat[4]; /*  +0x0038 af 11 00 00  */
    unsigned long  Reserved1; /*  +0x003c  */
    unsigned long  DataOffset; /*  +0x0040  */
    unsigned long  DataLength; /*  +0x0044  */
    unsigned long  PshedDataOffset; /*  +0x0048  */
    unsigned long  PshedDataLength; /*  +0x004c  */
};

struct _WHEA_ERROR_RECORD {
    unsigned char Header[128]; /*  +0x0000 b4 11 00 00  */
    unsigned char SectionDescriptor[72]; /*  +0x0080 b6 11 00 00  */
};

struct _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR {
    unsigned long  SectionOffset; /*  +0x0000  */
    unsigned long  SectionLength; /*  +0x0004  */
    unsigned char Revision[2]; /*  +0x0008 bb 11 00 00  */
    unsigned char ValidBits[1]; /*  +0x000a bc 11 00 00  */
    unsigned char  Reserved; /*  +0x000b  */
    unsigned char Flags[4]; /*  +0x000c bd 11 00 00  */
    unsigned char SectionType[16]; /*  +0x0010 fe 10 00 00  */
    unsigned char FRUId[16]; /*  +0x0020 fe 10 00 00  */
    unsigned char SectionSeverity[4]; /*  +0x0030 ab 11 00 00  */
    unsigned char FRUText[20]; /*  +0x0034 be 11 00 00  */
};

struct _GUID {
    unsigned long  Data1; /*  +0x0000  */
    unsigned short  Data2; /*  +0x0004  */
    unsigned short  Data3; /*  +0x0006  */
    unsigned char Data4[8]; /*  +0x0008 c6 11 00 00  */
};

enum _IO_PRIORITY_HINT {
    IoPriorityVeryLow = 0,
    IoPriorityLow = 1,
    IoPriorityNormal = 2,
    IoPriorityHigh = 3,
    IoPriorityCritical = 4,
    MaxIoPriorityTypes = 5
};

struct _IO_PRIORITY_INFO {
    unsigned long  Size; /*  +0x0000  */
    unsigned long  ThreadPriority; /*  +0x0004  */
    unsigned long  PagePriority; /*  +0x0008  */
    unsigned char IoPriority[4]; /*  +0x000c cf 11 00 00  */
};

struct _FSRTL_ADVANCED_FCB_HEADER {
    short  NodeTypeCode; /*  +0x0000  */
    short  NodeByteSize; /*  +0x0002  */
    unsigned char  Flags; /*  +0x0004  */
    unsigned char  IsFastIoPossible; /*  +0x0005  */
    unsigned char  Flags2; /*  +0x0006  */
    /* unsigned char Reserved[0];  +0x0007 d5 11 00 00  */
    unsigned char Version[1]; /*  +0x0007 d6 11 00 00  */
    unsigned char Resource[4]; /*  +0x0008 d8 11 00 00  */
    unsigned char PagingIoResource[4]; /*  +0x000c d8 11 00 00  */
    unsigned char AllocationSize[8]; /*  +0x0010 3a 10 00 00  */
    unsigned char FileSize[8]; /*  +0x0018 3a 10 00 00  */
    unsigned char ValidDataLength[8]; /*  +0x0020 3a 10 00 00  */
    unsigned char FastMutex[4]; /*  +0x0028 4a 10 00 00  */
    unsigned char FilterContexts[8]; /*  +0x002c 17 10 00 00  */
    unsigned long  PushLock; /*  +0x0034  */
    unsigned char FileContextSupportPointer[4]; /*  +0x0038 4e 10 00 00  */
    void *Oplock; /*  +0x003c  */
    void *ReservedForRemote; /*  +0x003c  */
};

struct _WDF_DRIVER_GLOBALS {
    unsigned char Driver[4]; /*  +0x0000 e6 11 00 00  */
    unsigned long  DriverFlags; /*  +0x0004  */
    unsigned long  DriverTag; /*  +0x0008  */
    unsigned char DriverName[32]; /*  +0x000c e7 11 00 00  */
    unsigned char  DisplaceDriverUnload; /*  +0x002c  */
};

enum _WDF_EXECUTION_LEVEL {
    WdfExecutionLevelInvalid = 0,
    WdfExecutionLevelInheritFromParent = 1,
    WdfExecutionLevelPassive = 2,
    WdfExecutionLevelDispatch = 3
};

enum _WDF_SYNCHRONIZATION_SCOPE {
    WdfSynchronizationScopeInvalid = 0,
    WdfSynchronizationScopeInheritFromParent = 1,
    WdfSynchronizationScopeDevice = 2,
    WdfSynchronizationScopeQueue = 3,
    WdfSynchronizationScopeNone = 4
};

struct _WDF_OBJECT_ATTRIBUTES {
    unsigned long  Size; /*  +0x0000  */
    unsigned char EvtCleanupCallback[4]; /*  +0x0004 7e 10 00 00  */
    unsigned char EvtDestroyCallback[4]; /*  +0x0008 7e 10 00 00  */
    unsigned char ExecutionLevel[4]; /*  +0x000c f0 11 00 00  */
    unsigned char SynchronizationScope[4]; /*  +0x0010 f2 11 00 00  */
    void *ParentObject; /*  +0x0014  */
    unsigned char ContextSizeOverride[4]; /*  +0x0018 75 00 00 00  */
    unsigned char ContextTypeInfo[4]; /*  +0x001c f5 11 00 00  */
};

struct _WDF_OBJECT_CONTEXT_TYPE_INFO {
    unsigned long  Size; /*  +0x0000  */
    char *ContextName; /*  +0x0004  */
    unsigned char ContextSize[4]; /*  +0x0008 75 00 00 00  */
    unsigned char UniqueType[4]; /*  +0x000c f5 11 00 00  */
    unsigned char EvtDriverGetUniqueContextType[4]; /*  +0x0010 fe 11 00 00  */
};

struct WDFWAITLOCK__ {
    unsigned char unused[4]; /*  +0x0000 74 00 00 00  */
};

struct _WDF_DRIVER_CONFIG {
    unsigned long  Size; /*  +0x0000  */
    unsigned char EvtDriverDeviceAdd[4]; /*  +0x0004 33 12 00 00  */
    unsigned char EvtDriverUnload[4]; /*  +0x0008 36 12 00 00  */
    unsigned long  DriverInitFlags; /*  +0x000c  */
    unsigned long  DriverPoolTag; /*  +0x0010  */
};

struct _WDF_DRIVER_VERSION_AVAILABLE_PARAMS {
    unsigned long  Size; /*  +0x0000  */
    unsigned long  MajorVersion; /*  +0x0004  */
    unsigned long  MinorVersion; /*  +0x0008  */
};

struct _DRIVER_OBJECT {
    short  Type; /*  +0x0000  */
    short  Size; /*  +0x0002  */
    unsigned char DeviceObject[4]; /*  +0x0004 b1 10 00 00  */
    unsigned long  Flags; /*  +0x0008  */
    void *DriverStart; /*  +0x000c  */
    unsigned long  DriverSize; /*  +0x0010  */
    void *DriverSection; /*  +0x0014  */
    unsigned char DriverExtension[4]; /*  +0x0018 46 12 00 00  */
    unsigned char DriverName[8]; /*  +0x001c 2e 10 00 00  */
    unsigned char HardwareDatabase[4]; /*  +0x0024 2f 10 00 00  */
    unsigned char FastIoDispatch[4]; /*  +0x0028 48 12 00 00  */
    unsigned char DriverInit[4]; /*  +0x002c 4b 12 00 00  */
    unsigned char DriverStartIo[4]; /*  +0x0030 b4 10 00 00  */
    unsigned char DriverUnload[4]; /*  +0x0034 4e 12 00 00  */
    unsigned char MajorFunction[112]; /*  +0x0038 51 12 00 00  */
};

struct _WDF_QUERY_INTERFACE_CONFIG {
    unsigned long  Size; /*  +0x0000  */
    unsigned char Interface[4]; /*  +0x0004 02 11 00 00  */
    unsigned char InterfaceType[4]; /*  +0x0008 00 11 00 00  */
    unsigned char  SendQueryToParentStack; /*  +0x000c  */
    unsigned char EvtDeviceProcessQueryInterfaceRequest[4]; /*  +0x0010 78 12 00 00  */
    unsigned char  ImportInterface; /*  +0x0014  */
};

struct _INTERFACE {
    unsigned short  Size; /*  +0x0000  */
    unsigned short  Version; /*  +0x0002  */
    void *Context; /*  +0x0004  */
    unsigned char InterfaceReference[4]; /*  +0x0008 7e 10 00 00  */
    unsigned char InterfaceDereference[4]; /*  +0x000c 7e 10 00 00  */
};

enum _WDF_MEMORY_DESCRIPTOR_TYPE {
    WdfMemoryDescriptorTypeInvalid = 0,
    WdfMemoryDescriptorTypeBuffer = 1,
    WdfMemoryDescriptorTypeMdl = 2,
    WdfMemoryDescriptorTypeHandle = 3
};

/* struct <unnamed-tag> {
    void *Buffer;  +0x0000 
    unsigned long  Length;  +0x0004 
}; */

/* struct <unnamed-tag> {
    unsigned char Mdl[4];  +0x0000 90 10 00 00 
    unsigned long  BufferLength;  +0x0004 
}; */

/* struct <unnamed-tag> {
    unsigned char Memory[4];  +0x0000 8d 12 00 00 
    unsigned char Offsets[4];  +0x0004 8f 12 00 00 
}; */

/* struct <unnamed-tag> {
    /* unsigned char BufferType[0];  +0x0000 89 12 00 00 
    /* unsigned char MdlType[0];  +0x0000 8b 12 00 00 
    unsigned char HandleType[8];  +0x0000 91 12 00 00 
}; */

struct _WDF_MEMORY_DESCRIPTOR {
    unsigned char Type[4]; /*  +0x0000 87 12 00 00  */
    unsigned char u[8]; /*  +0x0004 93 12 00 00  */
};

struct _WDFMEMORY_OFFSET {
    unsigned char BufferOffset[4]; /*  +0x0000 75 00 00 00  */
    unsigned char BufferLength[4]; /*  +0x0004 75 00 00 00  */
};

struct _WDF_CHILD_IDENTIFICATION_DESCRIPTION_HEADER {
    unsigned long  IdentificationDescriptionSize; /*  +0x0000  */
};

struct _WDF_CHILD_ADDRESS_DESCRIPTION_HEADER {
    unsigned long  AddressDescriptionSize; /*  +0x0000  */
};

enum _WDF_CHILD_LIST_RETRIEVE_DEVICE_STATUS {
    WdfChildListRetrieveDeviceUndefined = 0,
    WdfChildListRetrieveDeviceSuccess = 1,
    WdfChildListRetrieveDeviceNotYetCreated = 2,
    WdfChildListRetrieveDeviceNoSuchDevice = 3
};

struct _WDF_CHILD_RETRIEVE_INFO {
    unsigned long  Size; /*  +0x0000  */
    unsigned char IdentificationDescription[4]; /*  +0x0004 b6 12 00 00  */
    unsigned char AddressDescription[4]; /*  +0x0008 ba 12 00 00  */
    unsigned char Status[4]; /*  +0x000c c0 12 00 00  */
    unsigned char EvtChildListIdentificationDescriptionCompare[4]; /*  +0x0010 c5 12 00 00  */
};

struct _WDF_CHILD_LIST_CONFIG {
    unsigned long  Size; /*  +0x0000  */
    unsigned long  IdentificationDescriptionSize; /*  +0x0004  */
    unsigned long  AddressDescriptionSize; /*  +0x0008  */
    unsigned char EvtChildListCreateDevice[4]; /*  +0x000c cd 12 00 00  */
    unsigned char EvtChildListScanForChildren[4]; /*  +0x0010 d0 12 00 00  */
    unsigned char EvtChildListIdentificationDescriptionCopy[4]; /*  +0x0014 d2 12 00 00  */
    unsigned char EvtChildListIdentificationDescriptionDuplicate[4]; /*  +0x0018 d4 12 00 00  */
    unsigned char EvtChildListIdentificationDescriptionCleanup[4]; /*  +0x001c d7 12 00 00  */
    unsigned char EvtChildListIdentificationDescriptionCompare[4]; /*  +0x0020 c5 12 00 00  */
    unsigned char EvtChildListAddressDescriptionCopy[4]; /*  +0x0024 da 12 00 00  */
    unsigned char EvtChildListAddressDescriptionDuplicate[4]; /*  +0x0028 dc 12 00 00  */
    unsigned char EvtChildListAddressDescriptionCleanup[4]; /*  +0x002c df 12 00 00  */
    unsigned char EvtChildListDeviceReenumerated[4]; /*  +0x0030 e2 12 00 00  */
};

struct _WDF_CHILD_LIST_ITERATOR {
    unsigned long  Size; /*  +0x0000  */
    unsigned long  Flags; /*  +0x0004  */
    unsigned char Reserved[16]; /*  +0x0008 b6 10 00 00  */
};

struct _FILE_OBJECT {
    short  Type; /*  +0x0000  */
    short  Size; /*  +0x0002  */
    unsigned char DeviceObject[4]; /*  +0x0004 b1 10 00 00  */
    unsigned char Vpb[4]; /*  +0x0008 ef 10 00 00  */
    void *FsContext; /*  +0x000c  */
    void *FsContext2; /*  +0x0010  */
    unsigned char SectionObjectPointer[4]; /*  +0x0014 13 13 00 00  */
    void *PrivateCacheMap; /*  +0x0018  */
    long  FinalStatus; /*  +0x001c  */
    unsigned char RelatedFileObject[4]; /*  +0x0020 ba 10 00 00  */
    unsigned char  LockOperation; /*  +0x0024  */
    unsigned char  DeletePending; /*  +0x0025  */
    unsigned char  ReadAccess; /*  +0x0026  */
    unsigned char  WriteAccess; /*  +0x0027  */
    unsigned char  DeleteAccess; /*  +0x0028  */
    unsigned char  SharedRead; /*  +0x0029  */
    unsigned char  SharedWrite; /*  +0x002a  */
    unsigned char  SharedDelete; /*  +0x002b  */
    unsigned long  Flags; /*  +0x002c  */
    unsigned char FileName[8]; /*  +0x0030 2e 10 00 00  */
    unsigned char CurrentByteOffset[8]; /*  +0x0038 3a 10 00 00  */
    unsigned long  Waiters; /*  +0x0040  */
    unsigned long  Busy; /*  +0x0044  */
    void *LastLock; /*  +0x0048  */
    unsigned char Lock[16]; /*  +0x004c 4b 10 00 00  */
    unsigned char Event[16]; /*  +0x005c 4b 10 00 00  */
    unsigned char CompletionContext[4]; /*  +0x006c 15 13 00 00  */
    unsigned long  IrpListLock; /*  +0x0070  */
    unsigned char IrpList[8]; /*  +0x0074 17 10 00 00  */
    void *FileObjectExtension; /*  +0x007c  */
};

enum _WDF_TRI_STATE {
    WdfFalse = 0,
    WdfTrue = 1,
    WdfUseDefault = 2
};

enum _WDF_FILEOBJECT_CLASS {
    WdfFileObjectInvalid = 0,
    WdfFileObjectNotRequired = 1,
    WdfFileObjectWdfCanUseFsContext = 2,
    WdfFileObjectWdfCanUseFsContext2 = 3,
    WdfFileObjectWdfCannotUseFsContexts = 4,
     = 32771
};

struct _WDF_FILEOBJECT_CONFIG {
    unsigned long  Size; /*  +0x0000  */
    unsigned char EvtDeviceFileCreate[4]; /*  +0x0004 1e 13 00 00  */
    unsigned char EvtFileClose[4]; /*  +0x0008 21 13 00 00  */
    unsigned char EvtFileCleanup[4]; /*  +0x000c 21 13 00 00  */
    unsigned char AutoForwardCleanupClose[4]; /*  +0x0010 23 13 00 00  */
    unsigned char FileObjectClass[4]; /*  +0x0014 25 13 00 00  */
};

struct _WDF_POWER_POLICY_EVENT_CALLBACKS {
    unsigned long  Size; /*  +0x0000  */
    unsigned char EvtDeviceArmWakeFromS0[4]; /*  +0x0004 30 13 00 00  */
    unsigned char EvtDeviceDisarmWakeFromS0[4]; /*  +0x0008 32 13 00 00  */
    unsigned char EvtDeviceWakeFromS0Triggered[4]; /*  +0x000c 32 13 00 00  */
    unsigned char EvtDeviceArmWakeFromSx[4]; /*  +0x0010 30 13 00 00  */
    unsigned char EvtDeviceDisarmWakeFromSx[4]; /*  +0x0014 32 13 00 00  */
    unsigned char EvtDeviceWakeFromSxTriggered[4]; /*  +0x0018 32 13 00 00  */
    unsigned char EvtDeviceArmWakeFromSxWithReason[4]; /*  +0x001c 35 13 00 00  */
};

enum _WDF_POWER_DEVICE_STATE {
    WdfPowerDeviceInvalid = 0,
    WdfPowerDeviceD0 = 1,
    WdfPowerDeviceD1 = 2,
    WdfPowerDeviceD2 = 3,
    WdfPowerDeviceD3 = 4,
    WdfPowerDeviceD3Final = 5,
    WdfPowerDevicePrepareForHibernation = 6,
    WdfPowerDeviceMaximum = 7
};

enum _WDF_SPECIAL_FILE_TYPE {
    WdfSpecialFileUndefined = 0,
    WdfSpecialFilePaging = 1,
    WdfSpecialFileHibernation = 2,
    WdfSpecialFileDump = 3,
    WdfSpecialFileBoot = 4,
    WdfSpecialFileMax = 5
};

struct _WDF_PNPPOWER_EVENT_CALLBACKS {
    unsigned long  Size; /*  +0x0000  */
    unsigned char EvtDeviceD0Entry[4]; /*  +0x0004 3e 13 00 00  */
    unsigned char EvtDeviceD0EntryPostInterruptsEnabled[4]; /*  +0x0008 3e 13 00 00  */
    unsigned char EvtDeviceD0Exit[4]; /*  +0x000c 3e 13 00 00  */
    unsigned char EvtDeviceD0ExitPreInterruptsDisabled[4]; /*  +0x0010 3e 13 00 00  */
    unsigned char EvtDevicePrepareHardware[4]; /*  +0x0014 43 13 00 00  */
    unsigned char EvtDeviceReleaseHardware[4]; /*  +0x0018 46 13 00 00  */
    unsigned char EvtDeviceSelfManagedIoCleanup[4]; /*  +0x001c 32 13 00 00  */
    unsigned char EvtDeviceSelfManagedIoFlush[4]; /*  +0x0020 32 13 00 00  */
    unsigned char EvtDeviceSelfManagedIoInit[4]; /*  +0x0024 30 13 00 00  */
    unsigned char EvtDeviceSelfManagedIoSuspend[4]; /*  +0x0028 30 13 00 00  */
    unsigned char EvtDeviceSelfManagedIoRestart[4]; /*  +0x002c 30 13 00 00  */
    unsigned char EvtDeviceSurpriseRemoval[4]; /*  +0x0030 32 13 00 00  */
    unsigned char EvtDeviceQueryRemove[4]; /*  +0x0034 30 13 00 00  */
    unsigned char EvtDeviceQueryStop[4]; /*  +0x0038 30 13 00 00  */
    unsigned char EvtDeviceUsageNotification[4]; /*  +0x003c 4b 13 00 00  */
    unsigned char EvtDeviceRelationsQuery[4]; /*  +0x0040 4e 13 00 00  */
    unsigned char EvtDeviceUsageNotificationEx[4]; /*  +0x0044 50 13 00 00  */
};

enum _WDF_POWER_POLICY_S0_IDLE_CAPABILITIES {
    IdleCapsInvalid = 0,
    IdleCannotWakeFromS0 = 1,
    IdleCanWakeFromS0 = 2,
    IdleUsbSelectiveSuspend = 3
};

enum _WDF_POWER_POLICY_S0_IDLE_USER_CONTROL {
    IdleUserControlInvalid = 0,
    IdleDoNotAllowUserControl = 1,
    IdleAllowUserControl = 2
};

struct _WDF_DEVICE_POWER_POLICY_IDLE_SETTINGS {
    unsigned long  Size; /*  +0x0000  */
    unsigned char IdleCaps[4]; /*  +0x0004 56 13 00 00  */
    unsigned char DxState[4]; /*  +0x0008 78 11 00 00  */
    unsigned long  IdleTimeout; /*  +0x000c  */
    unsigned char UserControlOfIdleSettings[4]; /*  +0x0010 58 13 00 00  */
    unsigned char Enabled[4]; /*  +0x0014 23 13 00 00  */
    unsigned char PowerUpIdleDeviceOnSystemWake[4]; /*  +0x0018 23 13 00 00  */
    unsigned char  UseSystemManagedIdleTimeout; /*  +0x001c  */
    unsigned char ExcludeD3Cold[4]; /*  +0x0020 23 13 00 00  */
};

enum _WDF_POWER_POLICY_SX_WAKE_USER_CONTROL {
    WakeUserControlInvalid = 0,
    WakeDoNotAllowUserControl = 1,
    WakeAllowUserControl = 2
};

struct _WDF_DEVICE_POWER_POLICY_WAKE_SETTINGS {
    unsigned long  Size; /*  +0x0000  */
    unsigned char DxState[4]; /*  +0x0004 78 11 00 00  */
    unsigned char UserControlOfWakeSettings[4]; /*  +0x0008 61 13 00 00  */
    unsigned char Enabled[4]; /*  +0x000c 23 13 00 00  */
    unsigned char  ArmForWakeIfChildrenAreArmedForWake; /*  +0x0010  */
    unsigned char  IndicateChildWakeOnParentWake; /*  +0x0011  */
};

struct _WDF_DEVICE_STATE {
    unsigned long  Size; /*  +0x0000  */
    unsigned char Disabled[4]; /*  +0x0004 23 13 00 00  */
    unsigned char DontDisplayInUI[4]; /*  +0x0008 23 13 00 00  */
    unsigned char Failed[4]; /*  +0x000c 23 13 00 00  */
    unsigned char NotDisableable[4]; /*  +0x0010 23 13 00 00  */
    unsigned char Removed[4]; /*  +0x0014 23 13 00 00  */
    unsigned char ResourcesChanged[4]; /*  +0x0018 23 13 00 00  */
};

struct _WDF_DEVICE_PNP_CAPABILITIES {
    unsigned long  Size; /*  +0x0000  */
    unsigned char LockSupported[4]; /*  +0x0004 23 13 00 00  */
    unsigned char EjectSupported[4]; /*  +0x0008 23 13 00 00  */
    unsigned char Removable[4]; /*  +0x000c 23 13 00 00  */
    unsigned char DockDevice[4]; /*  +0x0010 23 13 00 00  */
    unsigned char UniqueID[4]; /*  +0x0014 23 13 00 00  */
    unsigned char SilentInstall[4]; /*  +0x0018 23 13 00 00  */
    unsigned char SurpriseRemovalOK[4]; /*  +0x001c 23 13 00 00  */
    unsigned char HardwareDisabled[4]; /*  +0x0020 23 13 00 00  */
    unsigned char NoDisplayInUI[4]; /*  +0x0024 23 13 00 00  */
    unsigned long  Address; /*  +0x0028  */
    unsigned long  UINumber; /*  +0x002c  */
};

struct _WDF_DEVICE_POWER_CAPABILITIES {
    unsigned long  Size; /*  +0x0000  */
    unsigned char DeviceD1[4]; /*  +0x0004 23 13 00 00  */
    unsigned char DeviceD2[4]; /*  +0x0008 23 13 00 00  */
    unsigned char WakeFromD0[4]; /*  +0x000c 23 13 00 00  */
    unsigned char WakeFromD1[4]; /*  +0x0010 23 13 00 00  */
    unsigned char WakeFromD2[4]; /*  +0x0014 23 13 00 00  */
    unsigned char WakeFromD3[4]; /*  +0x0018 23 13 00 00  */
    unsigned char DeviceState[28]; /*  +0x001c 6f 13 00 00  */
    unsigned char DeviceWake[4]; /*  +0x0038 78 11 00 00  */
    unsigned char SystemWake[4]; /*  +0x003c 1f 11 00 00  */
    unsigned long  D1Latency; /*  +0x0040  */
    unsigned long  D2Latency; /*  +0x0044  */
    unsigned long  D3Latency; /*  +0x0048  */
    unsigned char IdealDxStateForSx[4]; /*  +0x004c 78 11 00 00  */
};

struct _WDF_REMOVE_LOCK_OPTIONS {
    unsigned long  Size; /*  +0x0000  */
    unsigned long  Flags; /*  +0x0004  */
};

struct _WDF_POWER_FRAMEWORK_SETTINGS {
    unsigned long  Size; /*  +0x0000  */
    unsigned char EvtDeviceWdmPostPoFxRegisterDevice[4]; /*  +0x0004 7e 13 00 00  */
    unsigned char EvtDeviceWdmPrePoFxUnregisterDevice[4]; /*  +0x0008 80 13 00 00  */
    unsigned char Component[4]; /*  +0x000c 82 13 00 00  */
    unsigned char ComponentActiveConditionCallback[4]; /*  +0x0010 85 13 00 00  */
    unsigned char ComponentIdleConditionCallback[4]; /*  +0x0014 85 13 00 00  */
    unsigned char ComponentIdleStateCallback[4]; /*  +0x0018 88 13 00 00  */
    unsigned char PowerControlCallback[4]; /*  +0x001c 8b 13 00 00  */
    void *PoFxDeviceContext; /*  +0x0020  */
};

enum _WDF_DEVICE_PNP_STATE {
    WdfDevStatePnpInvalid = 0,
    WdfDevStatePnpObjectCreated = 256,
    WdfDevStatePnpCheckForDevicePresence = 257,
    WdfDevStatePnpEjectFailed = 258,
    WdfDevStatePnpEjectHardware = 259,
    WdfDevStatePnpEjectedWaitingForRemove = 260,
    WdfDevStatePnpInit = 261,
    WdfDevStatePnpInitStarting = 262,
    WdfDevStatePnpInitSurpriseRemoved = 263,
    WdfDevStatePnpHardwareAvailable = 264,
    WdfDevStatePnpEnableInterfaces = 265,
    WdfDevStatePnpHardwareAvailablePowerPolicyFailed = 266,
    WdfDevStatePnpQueryRemoveAskDriver = 267,
    WdfDevStatePnpQueryRemovePending = 268,
    WdfDevStatePnpQueryRemoveStaticCheck = 269,
    WdfDevStatePnpQueriedRemoving = 270,
    WdfDevStatePnpQueryStopAskDriver = 271,
    WdfDevStatePnpQueryStopPending = 272,
    WdfDevStatePnpQueryStopStaticCheck = 273,
    WdfDevStatePnpQueryCanceled = 274,
    WdfDevStatePnpRemoved = 275,
    WdfDevStatePnpPdoRemoved = 276,
    WdfDevStatePnpRemovedPdoWait = 277,
    WdfDevStatePnpRemovedPdoSurpriseRemoved = 278,
    WdfDevStatePnpRemovingDisableInterfaces = 279,
    WdfDevStatePnpRestarting = 280,
    WdfDevStatePnpStarted = 281,
    WdfDevStatePnpStartedCancelStop = 282,
    WdfDevStatePnpStartedCancelRemove = 283,
    WdfDevStatePnpStartedRemoving = 284,
    WdfDevStatePnpStartingFromStopped = 285,
    WdfDevStatePnpStopped = 286,
    WdfDevStatePnpStoppedWaitForStartCompletion = 287,
    WdfDevStatePnpStartedStopping = 288,
    WdfDevStatePnpSurpriseRemove = 289,
    WdfDevStatePnpInitQueryRemove = 290,
    WdfDevStatePnpInitQueryRemoveCanceled = 291,
    WdfDevStatePnpFdoRemoved = 292,
    WdfDevStatePnpRemovedWaitForChildren = 293,
    WdfDevStatePnpQueriedSurpriseRemove = 294,
    WdfDevStatePnpSurpriseRemoveIoStarted = 295,
    WdfDevStatePnpFailedPowerDown = 296,
    WdfDevStatePnpFailedIoStarting = 297,
    WdfDevStatePnpFailedOwnHardware = 298,
    WdfDevStatePnpFailed = 299,
    WdfDevStatePnpFailedSurpriseRemoved = 300,
    WdfDevStatePnpFailedStarted = 301,
    WdfDevStatePnpFailedWaitForRemove = 302,
    WdfDevStatePnpFailedInit = 303,
    WdfDevStatePnpPdoInitFailed = 304,
    WdfDevStatePnpRestart = 305,
    WdfDevStatePnpRestartReleaseHardware = 306,
    WdfDevStatePnpRestartHardwareAvailable = 307,
    WdfDevStatePnpPdoRestart = 308,
    WdfDevStatePnpFinal = 309,
    WdfDevStatePnpRemovedChildrenRemoved = 310,
    WdfDevStatePnpQueryRemoveEnsureDeviceAwake = 311,
    WdfDevStatePnpQueryStopEnsureDeviceAwake = 312,
    WdfDevStatePnpFailedPowerPolicyRemoved = 313,
    WdfDevStatePnpNull = 314
};

enum _WDF_DEVICE_POWER_STATE {
    WdfDevStatePowerInvalid = 0,
    WdfDevStatePowerObjectCreated = 768,
    WdfDevStatePowerCheckDeviceType = 769,
    ÉWdfDevStatePowerCheckDeviceTypeNP = 32770,
    WdfDevStatePowerCheckParentState = 771,
    ÉWdfDevStatePowerCheckParentStateNP = 32770,
    WdfDevStatePowerEnablingWakeAtBus = 773,
    ÉWdfDevStatePowerEnablingWakeAtBusNP = 32770,
    WdfDevStatePowerD0 = 775,
    ÉWdfDevStatePowerD0NP = 32770,
    WdfDevStatePowerD0BusWakeOwner = 777,
    
ÉWdfDevStatePowerD0BusWakeOwnerNP = 32770,
    WdfDevStatePowerD0ArmedForWake = 779,
    ÉWdfDevStatePowerD0ArmedForWakeNP = 32770,
    WdfDevStatePowerD0DisarmingWakeAtBus = 781,
    ÉWdfDevStatePowerD0DisarmingWakeAtBusNP = 32770,
    WdfDevStatePowerD0Starting = 783,
    WdfDevStatePowerD0StartingConnectInterrupt = 784,
    WdfDevStatePowerD0StartingDmaEnable = 785,
    WdfDevStatePowerD0StartingStartSelfManagedIo = 786,
    WdfDevStatePowerDecideD0State = 787,
    WdfDevStatePowerGotoD3Stopped = 788,
    WdfDevStatePowerStopped = 789,
    WdfDevStatePowerStartingCheckDeviceType = 790,
    WdfDevStatePowerStartingChild = 791,
    WdfDevStatePowerDxDisablingWakeAtBus = 792,
    ÉWdfDevStatePowerDxDisablingWakeAtBusNP = 32770,
    WdfDevStatePowerGotoDx = 794,
    ÉWdfDevStatePowerGotoDxNP = 32770,
    WdfDevStatePowerGotoDxIoStopped = 796,
    ÉWdfDevStatePowerGotoDxIoStoppedNP = 32770,
    ÉWdfDevStatePowerGotoDxNPFailed = 32770,
    WdfDevStatePowerDx = 799,
     ÉWdfDevStatePowerDxNP = 32770,
    WdfDevStatePowerGotoDxArmedForWake = 801,
    "ÉWdfDevStatePowerGotoDxArmedForWakeNP = 32770,
    WdfDevStatePowerGotoDxIoStoppedArmedForWake = 803,
    $ÉWdfDevStatePowerGotoDxIoStoppedArmedForWakeNP = 32770,
    WdfDevStatePowerDxArmedForWake = 805,
    &ÉWdfDevStatePowerDxArmedForWakeNP = 32770,
    WdfDevStatePowerCheckParentStateArmedForWake = 807,
    (ÉWdfDevStatePowerCheckParentStateArmedForWakeNP = 32770,
    WdfDevStatePowerWaitForParentArmedForWake = 809,
    *ÉWdfDevStatePowerWaitForParentArmedForWakeNP = 32770,
    WdfDevStatePowerStartSelfManagedIo = 811,
    ,ÉWdfDevStatePowerStartSelfManagedIoNP = 32770,
    WdfDevStatePowerStartSelfManagedIoFailed = 813,
    .ÉWdfDevStatePowerStartSelfManagedIoFailedNP = 32770,
    WdfDevStatePowerWaitForParent = 815,
    0ÉWdfDevStatePowerWaitForParentNP = 32770,
    WdfDevStatePowerWakePending = 817,
    2ÉWdfDevStatePowerWakePendingNP = 32770,
    WdfDevStatePowerWaking = 819,
    4ÉWdfDevStatePowerWakingNP = 32770,
    WdfDevStatePowerWakingConnectInterrupt = 821,
    6ÉWdfDevStatePowerWakingConnectInterruptNP = 32770,
    WdfDevStatePowerWakingConnectInterruptFailed = 823,
    8ÉWdfDevStatePowerWakingConnectInterruptFailedNP = 32770,
    WdfDevStatePowerWakingDmaEnable = 825,
    :ÉWdfDevStatePowerWakingDmaEnableNP = 32770,
    WdfDevStatePowerWakingDmaEnableFailed = 827,
    <ÉWdfDevStatePowerWakingDmaEnableFailedNP = 32770,
    WdfDevStatePowerReportPowerUpFailedDerefParent = 829,
    WdfDevStatePowerReportPowerUpFailed = 830,
    WdfDevStatePowerPowerFailedPowerDown = 831,
    WdfDevStatePowerReportPowerDownFailed = 832,
    WdfDevStatePowerInitialConnectInterruptFailed = 833,
    WdfDevStatePowerInitialDmaEnableFailed = 834,
    WdfDevStatePowerInitialSelfManagedIoFailed = 835,
    WdfDevStatePowerInitialPowerUpFailedDerefParent = 836,
    WdfDevStatePowerInitialPowerUpFailed = 837,
    WdfDevStatePowerDxStoppedDisarmWake = 838,
    GÉWdfDevStatePowerDxStoppedDisarmWakeNP = 32770,
    HÉWdfDevStatePowerGotoDxStoppedDisableInterruptNP = 32770,
    WdfDevStatePowerGotoDxStopped = 841,
    WdfDevStatePowerDxStopped = 842,
    WdfDevStatePowerGotoStopped = 843,
    WdfDevStatePowerStoppedCompleteDx = 844,
    WdfDevStatePowerDxStoppedDecideDxState = 845,
    WdfDevStatePowerDxStoppedArmForWake = 846,
    OÉWdfDevStatePowerDxStoppedArmForWakeNP = 32770,
    WdfDevStatePowerFinalPowerDownFailed = 848,
    WdfDevStatePowerFinal = 849,
    WdfDevStatePowerGotoImplicitD3DisarmWakeAtBus = 850,
    WdfDevStatePowerNull = 851
};

enum _WDF_DEVICE_POWER_POLICY_STATE {
    WdfDevStatePwrPolInvalid = 0,
    WdfDevStatePwrPolObjectCreated = 1280,
    WdfDevStatePwrPolStarting = 1281,
    WdfDevStatePwrPolStartingSucceeded = 1282,
    WdfDevStatePwrPolStartingFailed = 1283,
    WdfDevStatePwrPolStartingDecideS0Wake = 1284,
    WdfDevStatePwrPolStartedIdleCapable = 1285,
    WdfDevStatePwrPolTimerExpiredNoWake = 1286,
    WdfDevStatePwrPolTimerExpiredNoWakeCompletePowerDown = 1287,
    WdfDevStatePwrPolWaitingUnarmed = 1288,
    WdfDevStatePwrPolWaitingUnarmedQueryIdle = 1289,
    WdfDevStatePwrPolS0NoWakePowerUp = 1290,
    WdfDevStatePwrPolS0NoWakeCompletePowerUp = 1291,
    WdfDevStatePwrPolSystemSleepFromDeviceWaitingUnarmed = 1292,
    WdfDevStatePwrPolSystemSleepNeedWake = 1293,
    WdfDevStatePwrPolSystemSleepNeedWakeCompletePowerUp = 1294,
    WdfDevStatePwrPolSystemSleepPowerRequestFailed = 1295,
    WdfDevStatePwrPolCheckPowerPageable = 1296,
    WdfDevStatePwrPolSleepingWakeWakeArrived = 1297,
    WdfDevStatePwrPolSleepingWakeRevertArmWake = 1298,
    WdfDevStatePwrPolSystemAsleepWakeArmed = 1299,
    WdfDevStatePwrPolSystemWakeDeviceWakeEnabled = 1300,
    WdfDevStatePwrPolSystemWakeDeviceWakeEnabledWakeCanceled = 1301,
    WdfDevStatePwrPolSystemWakeDeviceWakeDisarm = 1302,
    WdfDevStatePwrPolSystemWakeDeviceWakeTriggered = 1303,
    WdfDevStatePwrPolSystemWakeDeviceWakeTriggeredS0 = 1304,
    WdfDevStatePwrPolSystemWakeDeviceWokeDisarm = 1305,
    ÖWdfDevStatePwrPolSleepingWakeWakeArrivedNP = 32770,
    ÖWdfDevStatePwrPolSleepingWakeRevertArmWakeNP = 32770,
    WdfDevStatePwrPolSleepingWakePowerDownFailed = 1308,
    WdfDevStatePwrPolSleepingWakePowerDownFailedWakeCanceled = 1309,
    ÖWdfDevStatePwrPolSystemAsleepWakeArmedNP = 32770,
    ÖWdfDevStatePwrPolSystemWakeDeviceWakeEnabledNP = 32770,
     ÖWdfDevStatePwrPolSystemWakeDeviceWakeEnabledWakeCanceledNP = 32770,
    !ÖWdfDevStatePwrPolSystemWakeDeviceWakeDisarmNP = 32770,
    "ÖWdfDevStatePwrPolSystemWakeDeviceWakeTriggeredNP = 32770,
    #ÖWdfDevStatePwrPolSystemWakeDeviceWakeTriggeredS0NP = 32770,
    $ÖWdfDevStatePwrPolSystemWakeDeviceWokeDisarmNP = 32770,
    WdfDevStatePwrPolSystemWakeDeviceWakeCompletePowerUp = 1317,
    WdfDevStatePwrPolSleeping = 1318,
    WdfDevStatePwrPolSleepingNoWakePowerDown = 1319,
    WdfDevStatePwrPolSleepingNoWakeCompletePowerDown = 1320,
    WdfDevStatePwrPolSleepingNoWakeDxRequestFailed = 1321,
    WdfDevStatePwrPolSleepingWakePowerDown = 1322,
    WdfDevStatePwrPolSleepingSendWake = 1323,
    WdfDevStatePwrPolSystemAsleepNoWake = 1324,
    WdfDevStatePwrPolSystemWakeDeviceWakeDisabled = 1325,
    WdfDevStatePwrPolSystemWakeDeviceToD0 = 1326,
    WdfDevStatePwrPolSystemWakeDeviceToD0CompletePowerUp = 1327,
    WdfDevStatePwrPolSystemWakeQueryIdle = 1328,
    WdfDevStatePwrPolStartedWakeCapable = 1329,
    WdfDevStatePwrPolTimerExpiredDecideUsbSS = 1330,
    WdfDevStatePwrPolTimerExpiredWakeCapablePowerDown = 1331,
    WdfDevStatePwrPolTimerExpiredWakeCapableSendWake = 1332,
    WdfDevStatePwrPolTimerExpiredWakeCapableUsbSS = 1333,
    WdfDevStatePwrPolTimerExpiredWakeCapableWakeArrived = 1334,
    WdfDevStatePwrPolTimerExpiredWakeCapableCancelWake = 1335,
    WdfDevStatePwrPolTimerExpiredWakeCapableWakeCanceled = 1336,
    WdfDevStatePwrPolTimerExpiredWakeCapableCleanup = 1337,
    WdfDevStatePwrPolTimerExpiredWakeCapableDxAllocFailed = 1338,
    WdfDevStatePwrPolTimerExpiredWakeCompletedPowerDown = 1339,
    WdfDevStatePwrPolTimerExpiredWakeCompletedPowerUp = 1340,
    WdfDevStatePwrPolWaitingArmedUsbSS = 1341,
    WdfDevStatePwrPolWaitingArmed = 1342,
    WdfDevStatePwrPolWaitingArmedQueryIdle = 1343,
    WdfDevStatePwrPolIoPresentArmed = 1344,
    WdfDevStatePwrPolIoPresentArmedWakeCanceled = 1345,
    WdfDevStatePwrPolS0WakeDisarm = 1346,
    WdfDevStatePwrPolS0WakeCompletePowerUp = 1347,
    WdfDevStatePwrPolTimerExpiredWakeSucceeded = 1348,
    WdfDevStatePwrPolTimerExpiredWakeCompletedDisarm = 1349,
    WdfDevStatePwrPolTimerExpiredWakeCapableWakeSucceeded = 1350,
    WdfDevStatePwrPolTimerExpiredWakeCapableWakeFailed = 1351,
    WdfDevStatePwrPolWakeFailedUsbSS = 1352,
    WdfDevStatePwrPolTimerExpiredWakeCapablePowerDownFailedCancelWake = 1353,
    WdfDevStatePwrPolTimerExpiredWakeCapablePowerDownFailedWakeCanceled = 1354,
    WdfDevStatePwrPolTimerExpiredWakeCapablePowerDownFailedUsbSS = 1355,
    WdfDevStatePwrPolCancelingWakeForSystemSleep = 1356,
    WdfDevStatePwrPolCancelingWakeForSystemSleepWakeCanceled = 1357,
    WdfDevStatePwrPolDisarmingWakeForSystemSleepCompletePowerUp = 1358,
    WdfDevStatePwrPolPowerUpForSystemSleepFailed = 1359,
    WdfDevStatePwrPolWokeFromS0UsbSS = 1360,
    WdfDevStatePwrPolWokeFromS0 = 1361,
    WdfDevStatePwrPolWokeFromS0NotifyDriver = 1362,
    WdfDevStatePwrPolStoppingResetDevice = 1363,
    WdfDevStatePwrPolStoppingResetDeviceCompletePowerUp = 1364,
    WdfDevStatePwrPolStoppingResetDeviceFailed = 1365,
    WdfDevStatePwrPolStoppingD0 = 1366,
    WdfDevStatePwrPolStoppingD0Failed = 1367,
    WdfDevStatePwrPolStoppingDisarmWake = 1368,
    WdfDevStatePwrPolStoppingDisarmWakeCancelWake = 1369,
    WdfDevStatePwrPolStoppingDisarmWakeWakeCanceled = 1370,
    WdfDevStatePwrPolStopping = 1371,
    WdfDevStatePwrPolStoppingFailed = 1372,
    WdfDevStatePwrPolStoppingSendStatus = 1373,
    WdfDevStatePwrPolStoppingCancelTimer = 1374,
    WdfDevStatePwrPolStoppingWaitForIdleTimeout = 1375,
    WdfDevStatePwrPolStoppingCancelUsbSS = 1376,
    WdfDevStatePwrPolStoppingWaitForUsbSSCompletion = 1377,
    WdfDevStatePwrPolStoppingCancelWake = 1378,
    WdfDevStatePwrPolStopped = 1379,
    WdfDevStatePwrPolCancelUsbSS = 1380,
    WdfDevStatePwrPolStarted = 1381,
    WdfDevStatePwrPolStartedCancelTimer = 1382,
    WdfDevStatePwrPolStartedWaitForIdleTimeout = 1383,
    WdfDevStatePwrPolStartedWakeCapableCancelTimerForSleep = 1384,
    WdfDevStatePwrPolStartedWakeCapableWaitForIdleTimeout = 1385,
    WdfDevStatePwrPolStartedWakeCapableSleepingUsbSS = 1386,
    WdfDevStatePwrPolStartedIdleCapableCancelTimerForSleep = 1387,
    WdfDevStatePwrPolStartedIdleCapableWaitForIdleTimeout = 1388,
    WdfDevStatePwrPolDeviceD0PowerRequestFailed = 1389,
    WdfDevStatePwrPolDevicePowerRequestFailed = 1390,
    WdfDevStatePwrPolGotoDx = 1391,
    WdfDevStatePwrPolGotoDxInDx = 1392,
    WdfDevStatePwrPolDx = 1393,
    WdfDevStatePwrPolGotoD0 = 1394,
    WdfDevStatePwrPolGotoD0InD0 = 1395,
    WdfDevStatePwrPolFinal = 1396,
    WdfDevStatePwrPolSleepingPowerDownNotProcessed = 1397,
    WdfDevStatePwrPolTimerExpiredWakeCapablePowerDownNotProcessed = 1398,
    WdfDevStatePwrPolTimerExpiredNoWakePowerDownNotProcessed = 1399,
    WdfDevStatePwrPolTimerExpiredNoWakePoweredDownDisableIdleTimer = 1400,
    WdfDevStatePwrPolStoppingWaitingForImplicitPowerDown = 1401,
    WdfDevStatePwrPolStoppingPoweringUp = 1402,
    WdfDevStatePwrPolStoppingPoweringDown = 1403,
    WdfDevStatePwrPolPowerUpForSystemSleepNotSeen = 1404,
    WdfDevStatePwrPolWaitingArmedStoppingCancelUsbSS = 1405,
    WdfDevStatePwrPolWaitingArmedWakeFailedCancelUsbSS = 1406,
    WdfDevStatePwrPolWaitingArmedIoPresentCancelUsbSS = 1407,
    WdfDevStatePwrPolWaitingArmedWakeSucceededCancelUsbSS = 1408,
    WdfDevStatePwrPolCancelingUsbSSForSystemSleep = 1409,
    WdfDevStatePwrPolStoppingD0CancelUsbSS = 1410,
    WdfDevStatePwrPolStartingPoweredUp = 1411,
    WdfDevStatePwrPolIdleCapableDeviceIdle = 1412,
    WdfDevStatePwrPolDeviceIdleReturnToActive = 1413,
    WdfDevStatePwrPolDeviceIdleSleeping = 1414,
    WdfDevStatePwrPolDeviceIdleStopping = 1415,
    WdfDevStatePwrPolTimerExpiredNoWakeUndoPowerDown = 1416,
    WdfDevStatePwrPolD0RequestFailedCompleteDeviceActive = 1417,
    WdfDevStatePwrPolPowerRequestFailedCompleteDeviceActive = 1418,
    WdfDevStatePwrPolS0NoWakeReturnToActive = 1419,
    WdfDevStatePwrPolS0NoWakePowerUpHardwareStarted = 1420,
    WdfDevStatePwrPolStoppingResetDeviceReturnToActive = 1421,
    WdfDevStatePwrPolStoppingResetDeviceHardwareStarted = 1422,
    WdfDevStatePwrPolStoppingResetDeviceReturnToActiveFailed = 1423,
    WdfDevStatePwrPolSystemAsleepNoWakeDeviceWaitingUnarmed = 1424,
    WdfDevStatePwrPolSystemWakeWaitingUnarmedDeviceWakeDisabled = 1425,
    WdfDevStatePwrPolSystemWakeWaitingUnarmedQueryIdle = 1426,
    WdfDevStatePwrPolSystemWakeDeviceIdle = 1427,
    WdfDevStatePwrPolSystemSleepNeedWakeReturnToActive = 1428,
    WdfDevStatePwrPolSystemSleepNeedWakeHardwareStarted = 1429,
    WdfDevStatePwrPolSystemSleepNeedWakeD0AllocationFailed = 1430,
    WdfDevStatePwrPolSystemSleepPowerUpNotSeenReturnToActive = 1431,
    WdfDevStatePwrPolSystemSleepNeedWakeReturnToActiveFailed = 1432,
    WdfDevStatePwrPolWakeCapableDeviceIdle = 1433,
    WdfDevStatePwrPolWakeCapableUsbSSReturnToActive = 1434,
    WdfDevStatePwrPolWakeCapableUsbSSSleepingReturnToActive = 1435,
    WdfDevStatePwrPolWakeCapableUsbSSStopping = 1436,
    WdfDevStatePwrPolWakeCapableUsbSSCompleted = 1437,
    WdfDevStatePwrPolTimerExpiredWakeCapableUndoPowerDown = 1438,
    WdfDevStatePwrPolIoPresentArmedReturnToActive = 1439,
    WdfDevStatePwrPolIoPresentArmedHardwareStarted = 1440,
    WdfDevStatePwrPolWokeFromS0ReturnToActive = 1441,
    WdfDevStatePwrPolWokeFromS0HardwareStarted = 1442,
    WdfDevStatePwrPolTimerExpiredWakeCompletedReturnToActive = 1443,
    WdfDevStatePwrPolTimerExpiredWakeCompletedHardwareStarted = 1444,
    WdfDevStatePwrPolCancelingWakeForSystemSleepReturnToActive = 1445,
    WdfDevStatePwrPolSystemSleepWakeCanceledHardwareStarted = 1446,
    WdfDevStatePwrPolSystemSleepWakeCanceledReturnToActiveFailed = 1447,
    WdfDevStatePwrPolStoppingD0ReturnToActive = 1448,
    WdfDevStatePwrPolStoppingD0HardwareStarted = 1449,
    WdfDevStatePwrPolStoppingD0ReturnToActiveFailed = 1450,
    WdfDevStatePwrPolStoppedRemoving = 1451,
    WdfDevStatePwrPolRemoved = 1452,
    WdfDevStatePwrPolRestarting = 1453,
    WdfDevStatePwrPolRestartingFailed = 1454,
    WdfDevStatePwrPolRestartingPoweredUp = 1455,
    WdfDevStatePwrPolStartingPoweredUpFailed = 1456,
    WdfDevStatePwrPolSleepingPoSuspend = 1457,
    WdfDevStatePwrPolSystemSleepFromWaitingUnarmedPoSuspend = 1458,
    WdfDevStatePwrPolSystemSleepNeedWakeD0AllocFailedPoSuspend = 1459,
    WdfDevStatePwrPolStoppingPoSuspend = 1460,
    WdfDevStatePwrPolSystemWakeDeviceToD0PoweredUpPoResume = 1461,
    WdfDevStatePwrPolSystemWakeDeviceWaitingUnarmedPoResume = 1462,
    WdfDevStatePwrPolSystemWakeDeviceWakePoweredUpPoResume = 1463,
    WdfDevStatePwrPolNull = 1464
};

enum _WDF_DEVICE_IO_TYPE {
    WdfDeviceIoUndefined = 0,
    WdfDeviceIoNeither = 1,
    WdfDeviceIoBuffered = 2,
    WdfDeviceIoDirect = 3
};

enum DEVICE_REGISTRY_PROPERTY {
    DevicePropertyDeviceDescription = 0,
    DevicePropertyHardwareID = 1,
    DevicePropertyCompatibleIDs = 2,
    DevicePropertyBootConfiguration = 3,
    DevicePropertyBootConfigurationTranslated = 4,
    DevicePropertyClassName = 5,
    DevicePropertyClassGuid = 6,
    DevicePropertyDriverKeyName = 7,
    DevicePropertyManufacturer = 8,
    DevicePropertyFriendlyName = 9,
    DevicePropertyLocationInformation = 10,
    DevicePropertyPhysicalDeviceObjectName = 11,
    DevicePropertyBusTypeGuid = 12,
    DevicePropertyLegacyBusType = 13,
    DevicePropertyBusNumber = 14,
    DevicePropertyEnumeratorName = 15,
    DevicePropertyAddress = 16,
    DevicePropertyUINumber = 17,
    DevicePropertyInstallState = 18,
    DevicePropertyRemovalPolicy = 19,
    DevicePropertyResourceRequirements = 20,
    DevicePropertyAllocatedResources = 21,
    DevicePropertyContainerID = 22
};

enum _INTERFACE_TYPE {
    InterfaceTypeUndefined = -1,
    Internal = 0,
    Isa = 1,
    Eisa = 2,
    MicroChannel = 3,
    TurboChannel = 4,
    PCIBus = 5,
    VMEBus = 6,
    NuBus = 7,
    PCMCIABus = 8,
    CBus = 9,
    MPIBus = 10,
    MPSABus = 11,
    ProcessorInternal = 12,
    InternalPowerBus = 13,
    PNPISABus = 14,
    PNPBus = 15,
    Vmcs = 16,
    ACPIBus = 17,
    MaximumInterfaceType = 18
};

struct _PNP_BUS_INFORMATION {
    unsigned char BusTypeGuid[16]; /*  +0x0000 fe 10 00 00  */
    unsigned char LegacyBusType[4]; /*  +0x0010 45 14 00 00  */
    unsigned long  BusNumber; /*  +0x0014  */
};

enum _WDF_DEVICE_FAILED_ACTION {
    WdfDeviceFailedUndefined = 0,
    WdfDeviceFailedAttemptRestart = 1,
    WdfDeviceFailedNoRestart = 2
};

struct _WDF_DPC_CONFIG {
    unsigned long  Size; /*  +0x0000  */
    unsigned char EvtDpcFunc[4]; /*  +0x0004 86 14 00 00  */
    unsigned char  AutomaticSerialization; /*  +0x0008  */
};

struct _WDF_TIMER_CONFIG {
    unsigned long  Size; /*  +0x0000  */
    unsigned char EvtTimerFunc[4]; /*  +0x0004 9f 14 00 00  */
    unsigned long  Period; /*  +0x0008  */
    unsigned char  AutomaticSerialization; /*  +0x000c  */
    unsigned long  TolerableDelay; /*  +0x0010  */
};

struct _WDF_WORKITEM_CONFIG {
    unsigned long  Size; /*  +0x0000  */
    unsigned char EvtWorkItemFunc[4]; /*  +0x0004 b7 14 00 00  */
    unsigned char  AutomaticSerialization; /*  +0x0008  */
};

struct _WDF_INTERRUPT_CONFIG {
    unsigned long  Size; /*  +0x0000  */
    unsigned char SpinLock[4]; /*  +0x0004 21 12 00 00  */
    unsigned char ShareVector[4]; /*  +0x0008 23 13 00 00  */
    unsigned char  FloatingSave; /*  +0x000c  */
    unsigned char  AutomaticSerialization; /*  +0x000d  */
    unsigned char EvtInterruptIsr[4]; /*  +0x0010 cb 14 00 00  */
    unsigned char EvtInterruptDpc[4]; /*  +0x0014 ce 14 00 00  */
    unsigned char EvtInterruptEnable[4]; /*  +0x0018 d1 14 00 00  */
    unsigned char EvtInterruptDisable[4]; /*  +0x001c d1 14 00 00  */
    unsigned char EvtInterruptWorkItem[4]; /*  +0x0020 ce 14 00 00  */
    unsigned char InterruptRaw[4]; /*  +0x0024 d3 14 00 00  */
    unsigned char InterruptTranslated[4]; /*  +0x0028 d3 14 00 00  */
    unsigned char WaitLock[4]; /*  +0x002c 13 12 00 00  */
    unsigned char  PassiveHandling; /*  +0x0030  */
};

enum _KINTERRUPT_MODE {
    LevelSensitive = 0,
    Latched = 1
};

enum _WDF_INTERRUPT_POLARITY {
    WdfInterruptPolarityUnknown = 0,
    WdfInterruptActiveHigh = 1,
    WdfInterruptActiveLow = 2
};

struct _WDF_INTERRUPT_INFO {
    unsigned long  Size; /*  +0x0000  */
    unsigned long long  Reserved1; /*  +0x0008  */
    unsigned long  TargetProcessorSet; /*  +0x0010  */
    unsigned long  Reserved2; /*  +0x0014  */
    unsigned long  MessageNumber; /*  +0x0018  */
    unsigned long  Vector; /*  +0x001c  */
    unsigned char  Irql; /*  +0x0020  */
    unsigned char Mode[4]; /*  +0x0024 db 14 00 00  */
    unsigned char Polarity[4]; /*  +0x0028 dd 14 00 00  */
    unsigned char  MessageSignaled; /*  +0x002c  */
    unsigned char  ShareDisposition; /*  +0x002d  */
    unsigned short  Group; /*  +0x0030  */
};

enum _WDF_INTERRUPT_POLICY {
    WdfIrqPolicyMachineDefault = 0,
    WdfIrqPolicyAllCloseProcessors = 1,
    WdfIrqPolicyOneCloseProcessor = 2,
    WdfIrqPolicyAllProcessorsInMachine = 3,
    WdfIrqPolicySpecifiedProcessors = 4,
    WdfIrqPolicySpreadMessagesAcrossAllProcessors = 5
};

enum _WDF_INTERRUPT_PRIORITY {
    WdfIrqPriorityUndefined = 0,
    WdfIrqPriorityLow = 1,
    WdfIrqPriorityNormal = 2,
    WdfIrqPriorityHigh = 3
};

struct _WDF_INTERRUPT_EXTENDED_POLICY {
    unsigned long  Size; /*  +0x0000  */
    unsigned char Policy[4]; /*  +0x0004 e3 14 00 00  */
    unsigned char Priority[4]; /*  +0x0008 e5 14 00 00  */
    unsigned char TargetProcessorSetAndGroup[12]; /*  +0x000c e6 14 00 00  */
};

/* struct <unnamed-tag> {
    unsigned long  Length;  +0x0000 
    unsigned long  Alignment;  +0x0004 
    unsigned char MinimumAddress[8];  +0x0008 3a 10 00 00 
    unsigned char MaximumAddress[8];  +0x0010 3a 10 00 00 
}; */

enum _IRQ_DEVICE_POLICY {
    IrqPolicyMachineDefault = 0,
    IrqPolicyAllCloseProcessors = 1,
    IrqPolicyOneCloseProcessor = 2,
    IrqPolicyAllProcessorsInMachine = 3,
    IrqPolicySpecifiedProcessors = 4,
    IrqPolicySpreadMessagesAcrossAllProcessors = 5
};

enum _IRQ_PRIORITY {
    IrqPriorityUndefined = 0,
    IrqPriorityLow = 1,
    IrqPriorityNormal = 2,
    IrqPriorityHigh = 3
};

/* struct <unnamed-tag> {
    unsigned long  MinimumVector;  +0x0000 
    unsigned long  MaximumVector;  +0x0004 
    unsigned char AffinityPolicy[4];  +0x0008 2e 15 00 00 
    unsigned char PriorityPolicy[4];  +0x000c 30 15 00 00 
    unsigned long  TargetedProcessors;  +0x0010 
}; */

/* struct <unnamed-tag> {
    unsigned long  MinimumChannel;  +0x0000 
    unsigned long  MaximumChannel;  +0x0004 
}; */

/* struct <unnamed-tag> {
    unsigned long  RequestLine;  +0x0000 
    unsigned long  Reserved;  +0x0004 
    unsigned long  Channel;  +0x0008 
    unsigned long  TransferWidth;  +0x000c 
}; */

/* struct <unnamed-tag> {
    unsigned char Data[12];  +0x0000 37 15 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned long  Length;  +0x0000 
    unsigned long  MinBusNumber;  +0x0004 
    unsigned long  MaxBusNumber;  +0x0008 
    unsigned long  Reserved;  +0x000c 
}; */

/* struct <unnamed-tag> {
    unsigned long  Priority;  +0x0000 
    unsigned long  Reserved1;  +0x0004 
    unsigned long  Reserved2;  +0x0008 
}; */

/* struct <unnamed-tag> {
    unsigned long  Length40;  +0x0000 
    unsigned long  Alignment40;  +0x0004 
    unsigned char MinimumAddress[8];  +0x0008 3a 10 00 00 
    unsigned char MaximumAddress[8];  +0x0010 3a 10 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned long  Length48;  +0x0000 
    unsigned long  Alignment48;  +0x0004 
    unsigned char MinimumAddress[8];  +0x0008 3a 10 00 00 
    unsigned char MaximumAddress[8];  +0x0010 3a 10 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned long  Length64;  +0x0000 
    unsigned long  Alignment64;  +0x0004 
    unsigned char MinimumAddress[8];  +0x0008 3a 10 00 00 
    unsigned char MaximumAddress[8];  +0x0010 3a 10 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned char  Class;  +0x0000 
    unsigned char  Type;  +0x0001 
    unsigned char  Reserved1;  +0x0002 
    unsigned char  Reserved2;  +0x0003 
    unsigned long  IdLowPart;  +0x0004 
    unsigned long  IdHighPart;  +0x0008 
}; */

/* struct <unnamed-tag> {
    /* unsigned char Port[0];  +0x0000 2c 15 00 00 
    /* unsigned char Memory[0];  +0x0000 2c 15 00 00 
    /* unsigned char Interrupt[0];  +0x0000 32 15 00 00 
    /* unsigned char Dma[0];  +0x0000 34 15 00 00 
    /* unsigned char DmaV3[0];  +0x0000 36 15 00 00 
    /* unsigned char Generic[0];  +0x0000 2c 15 00 00 
    /* unsigned char DevicePrivate[0];  +0x0000 39 15 00 00 
    /* unsigned char BusNumber[0];  +0x0000 3b 15 00 00 
    /* unsigned char ConfigData[0];  +0x0000 3d 15 00 00 
    /* unsigned char Memory40[0];  +0x0000 3f 15 00 00 
    /* unsigned char Memory48[0];  +0x0000 41 15 00 00 
    /* unsigned char Memory64[0];  +0x0000 43 15 00 00 
    unsigned char Connection[24];  +0x0000 45 15 00 00 
}; */

struct _IO_RESOURCE_DESCRIPTOR {
    unsigned char  Option; /*  +0x0000  */
    unsigned char  Type; /*  +0x0001  */
    unsigned char  ShareDisposition; /*  +0x0002  */
    unsigned char  Spare1; /*  +0x0003  */
    unsigned short  Flags; /*  +0x0004  */
    unsigned short  Spare2; /*  +0x0006  */
    unsigned char u[24]; /*  +0x0008 47 15 00 00  */
};

/* struct <unnamed-tag> {
    unsigned char Start[8];  +0x0000 3a 10 00 00 
    unsigned long  Length;  +0x0008 
}; */

/* struct <unnamed-tag> {
    unsigned long  Level;  +0x0000 
    unsigned long  Vector;  +0x0004 
    unsigned long  Affinity;  +0x0008 
}; */

/* struct <unnamed-tag> {
    unsigned short  Reserved;  +0x0000 
    unsigned short  MessageCount;  +0x0002 
    unsigned long  Vector;  +0x0004 
    unsigned long  Affinity;  +0x0008 
}; */

/* struct <unnamed-tag> {
    /* unsigned char Raw[0];  +0x0000 61 15 00 00 
    unsigned char Translated[12];  +0x0000 5f 15 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned long  Channel;  +0x0000 
    unsigned long  Port;  +0x0004 
    unsigned long  Reserved1;  +0x0008 
}; */

/* struct <unnamed-tag> {
    unsigned long  Channel;  +0x0000 
    unsigned long  RequestLine;  +0x0004 
    unsigned long  Reserved1;  +0x0008 
}; */

/* struct <unnamed-tag> {
    unsigned long  Start;  +0x0000 
    unsigned long  Length;  +0x0004 
    unsigned long  Reserved;  +0x0008 
}; */

/* struct <unnamed-tag> {
    unsigned long  DataSize;  +0x0000 
    unsigned long  Reserved1;  +0x0004 
    unsigned long  Reserved2;  +0x0008 
}; */

/* struct <unnamed-tag> {
    unsigned char Start[8];  +0x0000 3a 10 00 00 
    unsigned long  Length40;  +0x0008 
}; */

/* struct <unnamed-tag> {
    unsigned char Start[8];  +0x0000 3a 10 00 00 
    unsigned long  Length48;  +0x0008 
}; */

/* struct <unnamed-tag> {
    unsigned char Start[8];  +0x0000 3a 10 00 00 
    unsigned long  Length64;  +0x0008 
}; */

/* struct <unnamed-tag> {
    /* unsigned char Generic[0];  +0x0000 5d 15 00 00 
    /* unsigned char Port[0];  +0x0000 5d 15 00 00 
    /* unsigned char Interrupt[0];  +0x0000 5f 15 00 00 
    /* unsigned char MessageInterrupt[0];  +0x0000 63 15 00 00 
    /* unsigned char Memory[0];  +0x0000 5d 15 00 00 
    /* unsigned char Dma[0];  +0x0000 65 15 00 00 
    /* unsigned char DmaV3[0];  +0x0000 67 15 00 00 
    /* unsigned char DevicePrivate[0];  +0x0000 39 15 00 00 
    /* unsigned char BusNumber[0];  +0x0000 69 15 00 00 
    /* unsigned char DeviceSpecificData[0];  +0x0000 6b 15 00 00 
    /* unsigned char Memory40[0];  +0x0000 6d 15 00 00 
    /* unsigned char Memory48[0];  +0x0000 6f 15 00 00 
    /* unsigned char Memory64[0];  +0x0000 71 15 00 00 
    unsigned char Connection[12];  +0x0000 45 15 00 00 
}; */

struct _CM_PARTIAL_RESOURCE_DESCRIPTOR {
    unsigned char  Type; /*  +0x0000  */
    unsigned char  ShareDisposition; /*  +0x0001  */
    unsigned short  Flags; /*  +0x0002  */
    unsigned char u[12]; /*  +0x0004 73 15 00 00  */
};

/* struct <unnamed-tag> {
    unsigned char Length[4];  +0x0000 75 00 00 00 
    unsigned long  Key;  +0x0004 
    long long  DeviceOffset;  +0x0008 
}; */

/* struct <unnamed-tag> {
    unsigned char OutputBufferLength[4];  +0x0000 75 00 00 00 
    unsigned char InputBufferLength[4];  +0x0004 75 00 00 00 
    unsigned long  IoControlCode;  +0x0008 
    void *Type3InputBuffer;  +0x000c 
}; */

/* struct <unnamed-tag> {
    void *Arg1;  +0x0000 
    void *Arg2;  +0x0004 
    unsigned long  IoControlCode;  +0x0008 
    void *Arg4;  +0x000c 
}; */

/* struct <unnamed-tag> {
    /* unsigned char Create[0];  +0x0000 c6 10 00 00 
    /* unsigned char Read[0];  +0x0000 87 15 00 00 
    /* unsigned char Write[0];  +0x0000 87 15 00 00 
    /* unsigned char DeviceIoControl[0];  +0x0000 89 15 00 00 
    unsigned char Others[16];  +0x0000 8b 15 00 00 
}; */

struct _WDF_REQUEST_PARAMETERS {
    unsigned short  Size; /*  +0x0000  */
    unsigned char  MinorFunction; /*  +0x0002  */
    unsigned char Type[4]; /*  +0x0004 5b 14 00 00  */
    unsigned char Parameters[16]; /*  +0x0008 8d 15 00 00  */
};

/* struct <unnamed-tag> {
    unsigned char Buffer[4];  +0x0000 8d 12 00 00 
    unsigned char Length[4];  +0x0004 75 00 00 00 
    unsigned char Offset[4];  +0x0008 75 00 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned char Buffer[4];  +0x0000 8d 12 00 00 
    unsigned char Offset[4];  +0x0004 75 00 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned char Buffer[4];  +0x0000 8d 12 00 00 
    unsigned char Offset[4];  +0x0004 75 00 00 00 
    unsigned char Length[4];  +0x0008 75 00 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned long  IoControlCode;  +0x0000 
    unsigned char Input[8];  +0x0004 95 15 00 00 
    unsigned char Output[12];  +0x000c 97 15 00 00 
}; */

/* struct <unnamed-tag> {
    void *Ptr;  +0x0000 
    unsigned long  Value;  +0x0000 
}; */

/* struct <unnamed-tag> {
    unsigned char Argument1[4];  +0x0000 9b 15 00 00 
    unsigned char Argument2[4];  +0x0004 9b 15 00 00 
    unsigned char Argument3[4];  +0x0008 9b 15 00 00 
    unsigned char Argument4[4];  +0x000c 9b 15 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned char Completion[4];  +0x0000 9f 15 00 00 
}; */

/* struct <unnamed-tag> {
    /* unsigned char Write[0];  +0x0000 93 15 00 00 
    /* unsigned char Read[0];  +0x0000 93 15 00 00 
    /* unsigned char Ioctl[0];  +0x0000 99 15 00 00 
    /* unsigned char Others[0];  +0x0000 9d 15 00 00 
    unsigned char Usb[24];  +0x0000 a1 15 00 00 
}; */

struct _WDF_REQUEST_COMPLETION_PARAMS {
    unsigned long  Size; /*  +0x0000  */
    unsigned char Type[4]; /*  +0x0004 5b 14 00 00  */
    unsigned char IoStatus[8]; /*  +0x0008 a7 10 00 00  */
    unsigned char Parameters[24]; /*  +0x0010 a3 15 00 00  */
};

enum _WDF_REQUEST_TYPE {
    WdfRequestTypeCreate = 0,
    WdfRequestTypeCreateNamedPipe = 1,
    WdfRequestTypeClose = 2,
    WdfRequestTypeRead = 3,
    WdfRequestTypeWrite = 4,
    WdfRequestTypeQueryInformation = 5,
    WdfRequestTypeSetInformation = 6,
    WdfRequestTypeQueryEA = 7,
    WdfRequestTypeSetEA = 8,
    WdfRequestTypeFlushBuffers = 9,
    WdfRequestTypeQueryVolumeInformation = 10,
    WdfRequestTypeSetVolumeInformation = 11,
    WdfRequestTypeDirectoryControl = 12,
    WdfRequestTypeFileSystemControl = 13,
    WdfRequestTypeDeviceControl = 14,
    WdfRequestTypeDeviceControlInternal = 15,
    WdfRequestTypeShutdown = 16,
    WdfRequestTypeLockControl = 17,
    WdfRequestTypeCleanup = 18,
    WdfRequestTypeCreateMailSlot = 19,
    WdfRequestTypeQuerySecurity = 20,
    WdfRequestTypeSetSecurity = 21,
    WdfRequestTypePower = 22,
    WdfRequestTypeSystemControl = 23,
    WdfRequestTypeDeviceChange = 24,
    WdfRequestTypeQueryQuota = 25,
    WdfRequestTypeSetQuota = 26,
    WdfRequestTypePnp = 27,
    WdfRequestTypeOther = 28,
    WdfRequestTypeUsb = 64,
    WdfRequestTypeNoFormat = 255,
    WdfRequestTypeMax = 256
};

struct _WDF_REQUEST_REUSE_PARAMS {
    unsigned long  Size; /*  +0x0000  */
    unsigned long  Flags; /*  +0x0004  */
    long  Status; /*  +0x0008  */
    unsigned char NewIrp[4]; /*  +0x000c a4 10 00 00  */
};

struct _WDF_REQUEST_SEND_OPTIONS {
    unsigned long  Size; /*  +0x0000  */
    unsigned long  Flags; /*  +0x0004  */
    long long  Timeout; /*  +0x0008  */
};

enum _WDF_IO_TARGET_OPEN_TYPE {
    WdfIoTargetOpenUndefined = 0,
    WdfIoTargetOpenUseExistingDevice = 1,
    WdfIoTargetOpenByName = 2,
    WdfIoTargetOpenReopen = 3
};

struct _WDF_IO_TARGET_OPEN_PARAMS {
    unsigned long  Size; /*  +0x0000  */
    unsigned char Type[4]; /*  +0x0004 11 16 00 00  */
    unsigned char EvtIoTargetQueryRemove[4]; /*  +0x0008 14 16 00 00  */
    unsigned char EvtIoTargetRemoveCanceled[4]; /*  +0x000c 16 16 00 00  */
    unsigned char EvtIoTargetRemoveComplete[4]; /*  +0x0010 16 16 00 00  */
    unsigned char TargetDeviceObject[4]; /*  +0x0014 b1 10 00 00  */
    unsigned char TargetFileObject[4]; /*  +0x0018 ba 10 00 00  */
    unsigned char TargetDeviceName[8]; /*  +0x001c 2e 10 00 00  */
    unsigned long  DesiredAccess; /*  +0x0024  */
    unsigned long  ShareAccess; /*  +0x0028  */
    unsigned long  FileAttributes; /*  +0x002c  */
    unsigned long  CreateDisposition; /*  +0x0030  */
    unsigned long  CreateOptions; /*  +0x0034  */
    void *EaBuffer; /*  +0x0038  */
    unsigned long  EaBufferLength; /*  +0x003c  */
    long long *AllocationSize; /*  +0x0040  */
    unsigned long  FileInformation; /*  +0x0044  */
};

enum _WDF_IO_TARGET_SENT_IO_ACTION {
    WdfIoTargetSentIoUndefined = 0,
    WdfIoTargetCancelSentIo = 1,
    WdfIoTargetWaitForSentIoToComplete = 2,
    WdfIoTargetLeaveSentIoPending = 3
};

enum _WDF_IO_TARGET_PURGE_IO_ACTION {
    WdfIoTargetPurgeIoUndefined = 0,
    WdfIoTargetPurgeIoAndWait = 1,
    WdfIoTargetPurgeIo = 2
};

enum _WDF_IO_TARGET_STATE {
    WdfIoTargetStateUndefined = 0,
    WdfIoTargetStarted = 1,
    WdfIoTargetStopped = 2,
    WdfIoTargetClosedForQueryRemove = 3,
    WdfIoTargetClosed = 4,
    WdfIoTargetDeleted = 5,
    WdfIoTargetPurged = 6
};

enum _WDF_IO_QUEUE_STATE {
    WdfIoQueueAcceptRequests = 1,
    WdfIoQueueDispatchRequests = 2,
    WdfIoQueueNoRequests = 4,
    WdfIoQueueDriverNoRequests = 8,
    WdfIoQueuePnpHeld = 16
};

enum _WDF_IO_QUEUE_DISPATCH_TYPE {
    WdfIoQueueDispatchInvalid = 0,
    WdfIoQueueDispatchSequential = 1,
    WdfIoQueueDispatchParallel = 2,
    WdfIoQueueDispatchManual = 3,
    WdfIoQueueDispatchMax = 4
};

/* struct <unnamed-tag> {
    unsigned long  NumberOfPresentedRequests;  +0x0000 
}; */

/* struct <unnamed-tag> {
    unsigned char Parallel[4];  +0x0000 6f 16 00 00 
}; */

struct _WDF_IO_QUEUE_CONFIG {
    unsigned long  Size; /*  +0x0000  */
    unsigned char DispatchType[4]; /*  +0x0004 61 16 00 00  */
    unsigned char PowerManaged[4]; /*  +0x0008 23 13 00 00  */
    unsigned char  AllowZeroLengthRequests; /*  +0x000c  */
    unsigned char  DefaultQueue; /*  +0x000d  */
    unsigned char EvtIoDefault[4]; /*  +0x0010 64 16 00 00  */
    unsigned char EvtIoRead[4]; /*  +0x0014 67 16 00 00  */
    unsigned char EvtIoWrite[4]; /*  +0x0018 67 16 00 00  */
    unsigned char EvtIoDeviceControl[4]; /*  +0x001c 6a 16 00 00  */
    unsigned char EvtIoInternalDeviceControl[4]; /*  +0x0020 6a 16 00 00  */
    unsigned char EvtIoStop[4]; /*  +0x0024 6d 16 00 00  */
    unsigned char EvtIoResume[4]; /*  +0x0028 64 16 00 00  */
    unsigned char EvtIoCanceledOnQueue[4]; /*  +0x002c 64 16 00 00  */
    unsigned char Settings[4]; /*  +0x0030 71 16 00 00  */
    unsigned char Driver[4]; /*  +0x0034 e6 11 00 00  */
};

enum _WDF_IO_FORWARD_PROGRESS_RESERVED_POLICY {
    WdfIoForwardProgressInvalidPolicy = 0,
    WdfIoForwardProgressReservedPolicyAlwaysUseReservedRequest = 1,
    WdfIoForwardProgressReservedPolicyUseExamine = 2,
    WdfIoForwardProgressReservedPolicyPagingIO = 3
};

struct _WDF_IO_QUEUE_FORWARD_PROGRESS_POLICY {
    unsigned long  Size; /*  +0x0000  */
    unsigned long  TotalForwardProgressRequests; /*  +0x0004  */
    unsigned char ForwardProgressReservedPolicy[4]; /*  +0x0008 78 16 00 00  */
    unsigned char ForwardProgressReservePolicySettings[4]; /*  +0x000c 79 16 00 00  */
    unsigned char EvtIoAllocateResourcesForReservedRequest[4]; /*  +0x0010 7b 16 00 00  */
    unsigned char EvtIoAllocateRequestResources[4]; /*  +0x0014 7b 16 00 00  */
};

enum _WDF_IO_FORWARD_PROGRESS_ACTION {
    WdfIoForwardProgressActionInvalid = 0,
    WdfIoForwardProgressActionFailRequest = 1,
    WdfIoForwardProgressActionUseReservedRequest = 2
};

struct _WDF_FDO_EVENT_CALLBACKS {
    unsigned long  Size; /*  +0x0000  */
    unsigned char EvtDeviceFilterAddResourceRequirements[4]; /*  +0x0004 ac 16 00 00  */
    unsigned char EvtDeviceFilterRemoveResourceRequirements[4]; /*  +0x0008 ac 16 00 00  */
    unsigned char EvtDeviceRemoveAddedResources[4]; /*  +0x000c 43 13 00 00  */
};

struct _WDF_PDO_EVENT_CALLBACKS {
    unsigned long  Size; /*  +0x0000  */
    unsigned char EvtDeviceResourcesQuery[4]; /*  +0x0004 46 13 00 00  */
    unsigned char EvtDeviceResourceRequirementsQuery[4]; /*  +0x0008 ac 16 00 00  */
    unsigned char EvtDeviceEject[4]; /*  +0x000c 30 13 00 00  */
    unsigned char EvtDeviceSetLock[4]; /*  +0x0010 cf 16 00 00  */
    unsigned char EvtDeviceEnableWakeAtBus[4]; /*  +0x0014 d2 16 00 00  */
    unsigned char EvtDeviceDisableWakeAtBus[4]; /*  +0x0018 32 13 00 00  */
    unsigned char EvtDeviceReportedMissing[4]; /*  +0x001c 32 13 00 00  */
};

enum _WDF_WMI_PROVIDER_CONTROL {
    WdfWmiControlInvalid = 0,
    WdfWmiEventControl = 1,
    WdfWmiInstanceControl = 2
};

struct _WDF_WMI_PROVIDER_CONFIG {
    unsigned long  Size; /*  +0x0000  */
    unsigned char Guid[16]; /*  +0x0004 fe 10 00 00  */
    unsigned long  Flags; /*  +0x0014  */
    unsigned long  MinInstanceBufferSize; /*  +0x0018  */
    unsigned char EvtWmiProviderFunctionControl[4]; /*  +0x001c f7 16 00 00  */
};

struct _WDF_WMI_INSTANCE_CONFIG {
    unsigned long  Size; /*  +0x0000  */
    unsigned char Provider[4]; /*  +0x0004 f2 16 00 00  */
    unsigned char ProviderConfig[4]; /*  +0x0008 f0 16 00 00  */
    unsigned char  UseContextForQuery; /*  +0x000c  */
    unsigned char  Register; /*  +0x000d  */
    unsigned char EvtWmiInstanceQueryInstance[4]; /*  +0x0010 00 17 00 00  */
    unsigned char EvtWmiInstanceSetInstance[4]; /*  +0x0014 03 17 00 00  */
    unsigned char EvtWmiInstanceSetItem[4]; /*  +0x0018 06 17 00 00  */
    unsigned char EvtWmiInstanceExecuteMethod[4]; /*  +0x001c 09 17 00 00  */
};

enum _WDF_DMA_PROFILE {
    WdfDmaProfileInvalid = 0,
    WdfDmaProfilePacket = 1,
    WdfDmaProfileScatterGather = 2,
    WdfDmaProfilePacket64 = 3,
    WdfDmaProfileScatterGather64 = 4,
    WdfDmaProfileScatterGatherDuplex = 5,
    WdfDmaProfileScatterGather64Duplex = 6,
    WdfDmaProfileSystem = 7,
    WdfDmaProfileSystemDuplex = 8
};

struct _WDF_DMA_ENABLER_CONFIG {
    unsigned long  Size; /*  +0x0000  */
    unsigned char Profile[4]; /*  +0x0004 68 17 00 00  */
    unsigned char MaximumLength[4]; /*  +0x0008 75 00 00 00  */
    unsigned char EvtDmaEnablerFill[4]; /*  +0x000c 6d 17 00 00  */
    unsigned char EvtDmaEnablerFlush[4]; /*  +0x0010 6d 17 00 00  */
    unsigned char EvtDmaEnablerDisable[4]; /*  +0x0014 6d 17 00 00  */
    unsigned char EvtDmaEnablerEnable[4]; /*  +0x0018 6d 17 00 00  */
    unsigned char EvtDmaEnablerSelfManagedIoStart[4]; /*  +0x001c 6d 17 00 00  */
    unsigned char EvtDmaEnablerSelfManagedIoStop[4]; /*  +0x0020 6d 17 00 00  */
    unsigned long  AddressWidthOverride; /*  +0x0024  */
    unsigned long  WdmDmaVersionOverride; /*  +0x0028  */
    unsigned long  Flags; /*  +0x002c  */
};

enum _DMA_WIDTH {
    Width8Bits = 0,
    Width16Bits = 1,
    Width32Bits = 2,
    Width64Bits = 3,
    WidthNoWrap = 4,
    MaximumDmaWidth = 5
};

struct _WDF_DMA_SYSTEM_PROFILE_CONFIG {
    unsigned long  Size; /*  +0x0000  */
    unsigned char  DemandMode; /*  +0x0004  */
    unsigned char  LoopedTransfer; /*  +0x0005  */
    unsigned char DmaWidth[8]; /*  +0x0008 74 17 00 00  */
    unsigned char DeviceAddress[8]; /*  +0x0010 3a 10 00 00  */
    unsigned char DmaDescriptor[8]; /*  +0x0018 d3 14 00 00  */
};

enum _WDF_DMA_DIRECTION {
    WdfDmaDirectionReadFromDevice = 0,
    WdfDmaDirectionWriteToDevice = 1
};

struct _DMA_ADAPTER {
    unsigned short  Version; /*  +0x0000  */
    unsigned short  Size; /*  +0x0002  */
    unsigned char DmaOperations[4]; /*  +0x0004 91 17 00 00  */
};

enum DMA_COMPLETION_STATUS {
    DmaComplete = 0,
    DmaAborted = 1,
    DmaError = 2,
    DmaCancelled = 3
};

struct _WDF_COMMON_BUFFER_CONFIG {
    unsigned long  Size; /*  +0x0000  */
    unsigned long  AlignmentRequirement; /*  +0x0004  */
};

struct _URB {
    /* unsigned char UrbHeader[0];  +0x0000 79 18 00 00  */
    /* unsigned char UrbSelectInterface[0];  +0x0000 7a 18 00 00  */
    /* unsigned char UrbSelectConfiguration[0];  +0x0000 7b 18 00 00  */
    /* unsigned char UrbPipeRequest[0];  +0x0000 7c 18 00 00  */
    /* unsigned char UrbFrameLengthControl[0];  +0x0000 7d 18 00 00  */
    /* unsigned char UrbGetFrameLength[0];  +0x0000 7e 18 00 00  */
    /* unsigned char UrbSetFrameLength[0];  +0x0000 7f 18 00 00  */
    /* unsigned char UrbGetCurrentFrameNumber[0];  +0x0000 80 18 00 00  */
    /* unsigned char UrbControlTransfer[0];  +0x0000 81 18 00 00  */
    /* unsigned char UrbControlTransferEx[0];  +0x0000 82 18 00 00  */
    /* unsigned char UrbBulkOrInterruptTransfer[0];  +0x0000 83 18 00 00  */
    /* unsigned char UrbIsochronousTransfer[0];  +0x0000 84 18 00 00  */
    /* unsigned char UrbControlDescriptorRequest[0];  +0x0000 85 18 00 00  */
    /* unsigned char UrbControlGetStatusRequest[0];  +0x0000 86 18 00 00  */
    /* unsigned char UrbControlFeatureRequest[0];  +0x0000 87 18 00 00  */
    /* unsigned char UrbControlVendorClassRequest[0];  +0x0000 88 18 00 00  */
    /* unsigned char UrbControlGetInterfaceRequest[0];  +0x0000 89 18 00 00  */
    /* unsigned char UrbControlGetConfigurationRequest[0];  +0x0000 8a 18 00 00  */
    /* unsigned char UrbOSFeatureDescriptorRequest[0];  +0x0000 8b 18 00 00  */
    unsigned char UrbOpenStaticStreams[96]; /*  +0x0000 8c 18 00 00  */
};

struct _USBD_STREAM_INFORMATION {
    void *PipeHandle; /*  +0x0000  */
    unsigned long  StreamID; /*  +0x0004  */
    unsigned long  MaximumTransferSize; /*  +0x0008  */
    unsigned long  PipeFlags; /*  +0x000c  */
};

struct _COMPOSITE_DEVICE_CAPABILITIES {
    /* unsigned char CapabilityFunctionSuspend[0];  +0x0000 96 18 00 00  */
    unsigned char Reserved[4]; /*  +0x0000 97 18 00 00  */
};

struct _RECORDER_CONFIGURE_PARAMS {
    unsigned long  Size; /*  +0x0000  */
    unsigned char  CreateDefaultLog; /*  +0x0004  */
};

struct _RECORDER_LOG_CREATE_PARAMS {
    unsigned long  Size; /*  +0x0000  */
    unsigned char LogIdentifier[16]; /*  +0x0004 a0 18 00 00  */
    unsigned long  LogTag; /*  +0x0014  */
    unsigned long  TotalBufferSize; /*  +0x0018  */
    unsigned long  ErrorPartitionSize; /*  +0x001c  */
};

struct _UCX_GLOBALS {
    unsigned long  Size; /*  +0x0000  */
};

struct _UCX_CONTROLLER_CONFIG {
    unsigned long  Size; /*  +0x0000  */
    unsigned long  NumberOfPresentedDeviceMgmtEvtCallbacks; /*  +0x0004  */
    unsigned char EvtControllerQueryUsbCapability[4]; /*  +0x0008 b4 18 00 00  */
    unsigned char EvtControllerGetBandwidthInformation[4]; /*  +0x000c b7 18 00 00  */
    unsigned char EvtControllerGetCurrentFrameNumber[4]; /*  +0x0010 ba 18 00 00  */
    unsigned char EvtControllerUsbDeviceAdd[4]; /*  +0x0014 c1 18 00 00  */
    unsigned char EvtControllerReset[4]; /*  +0x0018 c3 18 00 00  */
    unsigned char EvtControllerGetDumpData[4]; /*  +0x001c cc 18 00 00  */
    unsigned char EvtControllerFreeDumpData[4]; /*  +0x0020 cf 18 00 00  */
    unsigned char  IsValidPciIds; /*  +0x0024  */
    unsigned char  IsValidPciBusAddress; /*  +0x0025  */
    unsigned long  PciVendorId; /*  +0x0028  */
    unsigned long  PciDeviceId; /*  +0x002c  */
    unsigned long  PciRevisionId; /*  +0x0030  */
    unsigned long  PciBusNumber; /*  +0x0034  */
    unsigned long  PciDeviceNumber; /*  +0x0038  */
    unsigned long  PciFunctionNumber; /*  +0x003c  */
    unsigned char DeviceDescription[40]; /*  +0x0040 d0 18 00 00  */
};

enum UCX_CONTROLLER_STATE {
    UcxControllerStateLost = 0,
    UcxControllerStatePreserved = 1
};

struct _UCX_CONTROLLER_RESET_COMPLETE_INFO {
    unsigned long  Size; /*  +0x0000  */
    unsigned char UcxControllerState[4]; /*  +0x0004 e4 18 00 00  */
    unsigned char  UcxCoordinated; /*  +0x0008  */
};

struct _UCX_ROOTHUB_CONFIG {
    unsigned long  Size; /*  +0x0000  */
    unsigned long  NumberOfPresentedControlUrbCallbacks; /*  +0x0004  */
    unsigned char EvtRootHubClearHubFeature[4]; /*  +0x0008 f1 18 00 00  */
    unsigned char EvtRootHubClearPortFeature[4]; /*  +0x000c f1 18 00 00  */
    unsigned char EvtRootHubGetHubStatus[4]; /*  +0x0010 f1 18 00 00  */
    unsigned char EvtRootHubGetPortStatus[4]; /*  +0x0014 f1 18 00 00  */
    unsigned char EvtRootHubSetHubFeature[4]; /*  +0x0018 f1 18 00 00  */
    unsigned char EvtRootHubSetPortFeature[4]; /*  +0x001c f1 18 00 00  */
    unsigned char EvtRootHubGetPortErrorCount[4]; /*  +0x0020 f1 18 00 00  */
    unsigned char EvtRootHubControlUrb[4]; /*  +0x0024 f1 18 00 00  */
    unsigned char EvtRootHubInterruptTx[4]; /*  +0x0028 f4 18 00 00  */
    unsigned char EvtRootHubGetInfo[4]; /*  +0x002c f1 18 00 00  */
    unsigned char EvtRootHubGet20PortInfo[4]; /*  +0x0030 f1 18 00 00  */
    unsigned char EvtRootHubGet30PortInfo[4]; /*  +0x0034 f1 18 00 00  */
    unsigned char WdfRequestAttributes[32]; /*  +0x0038 ed 11 00 00  */
};

struct _UCX_USBDEVICE_EVENT_CALLBACKS {
    unsigned long  Size; /*  +0x0000  */
    unsigned char EvtUsbDeviceEndpointsConfigure[4]; /*  +0x0004 09 19 00 00  */
    unsigned char EvtUsbDeviceEnable[4]; /*  +0x0008 09 19 00 00  */
    unsigned char EvtUsbDeviceDisable[4]; /*  +0x000c 09 19 00 00  */
    unsigned char EvtUsbDeviceReset[4]; /*  +0x0010 09 19 00 00  */
    unsigned char EvtUsbDeviceAddress[4]; /*  +0x0014 09 19 00 00  */
    unsigned char EvtUsbDeviceUpdate[4]; /*  +0x0018 09 19 00 00  */
    unsigned char EvtUsbDeviceHubInfo[4]; /*  +0x001c 09 19 00 00  */
    unsigned char EvtUsbDeviceDefaultEndpointAdd[4]; /*  +0x0020 0e 19 00 00  */
    unsigned char EvtUsbDeviceEndpointAdd[4]; /*  +0x0024 15 19 00 00  */
};

struct _UCX_ENDPOINT_EVENT_CALLBACKS {
    unsigned long  Size; /*  +0x0000  */
    unsigned char EvtEndpointPurge[4]; /*  +0x0004 2d 19 00 00  */
    unsigned char EvtEndpointStart[4]; /*  +0x0008 2d 19 00 00  */
    unsigned char EvtEndpointAbort[4]; /*  +0x000c 2d 19 00 00  */
    unsigned char EvtEndpointReset[4]; /*  +0x0010 30 19 00 00  */
    unsigned char EvtEndpointOkToCancelTransfers[4]; /*  +0x0014 33 19 00 00  */
    unsigned char EvtEndpointStaticStreamsAdd[4]; /*  +0x0018 38 19 00 00  */
    unsigned char EvtEndpointStaticStreamsEnable[4]; /*  +0x001c 3d 19 00 00  */
    unsigned char EvtEndpointStaticStreamsDisable[4]; /*  +0x0020 3d 19 00 00  */
    unsigned char EvtEndpointEnableForwardProgress[4]; /*  +0x0024 40 19 00 00  */
};

struct _UCX_DEFAULT_ENDPOINT_EVENT_CALLBACKS {
    unsigned long  Size; /*  +0x0000  */
    unsigned char EvtEndpointPurge[4]; /*  +0x0004 2d 19 00 00  */
    unsigned char EvtEndpointStart[4]; /*  +0x0008 2d 19 00 00  */
    unsigned char EvtEndpointAbort[4]; /*  +0x000c 2d 19 00 00  */
    unsigned char EvtEndpointOkToCancelTransfers[4]; /*  +0x0010 33 19 00 00  */
    unsigned char EvtDefaultEndpointUpdate[4]; /*  +0x0014 09 19 00 00  */
    unsigned char EvtEndpointEnableForwardProgress[4]; /*  +0x0018 40 19 00 00  */
};

struct _STREAM_INFO {
    unsigned long  Size; /*  +0x0000  */
    unsigned char WdfQueue[4]; /*  +0x0004 9e 13 00 00  */
    unsigned long  StreamId; /*  +0x0008  */
};

struct _DEVICE_CONTEXT {
    unsigned char HubFdoContext[4]; /*  +0x0000 75 19 00 00  */
    unsigned char PortContext[4]; /*  +0x0004 77 19 00 00  */
    unsigned char PdoContext[4]; /*  +0x0008 79 19 00 00  */
    unsigned char UsbDevice[4]; /*  +0x000c c5 18 00 00  */
    unsigned long  EnumRetryCount; /*  +0x0010  */
    unsigned long  ConfigurationLock; /*  +0x0014  */
    unsigned char CurrentDeviceConfiguration[4]; /*  +0x0018 7b 19 00 00  */
    unsigned char OldDeviceConfiguration[4]; /*  +0x001c 7b 19 00 00  */
    unsigned char NextInterfaceToSet[4]; /*  +0x0020 7d 19 00 00  */
    unsigned char OldInterface[4]; /*  +0x0024 7d 19 00 00  */
    unsigned char NewInterface[4]; /*  +0x0028 7d 19 00 00  */
    unsigned char DefaultEndpoint[4]; /*  +0x002c 2a 19 00 00  */
    unsigned long  UcxEndpointArrayCount; /*  +0x0030  */
    unsigned char EndpointsToBeEnabled[4]; /*  +0x0034 57 19 00 00  */
    unsigned long  EndpointsToBeEnabledCount; /*  +0x0038  */
    unsigned char EndpointsToBeDisabled[4]; /*  +0x003c 57 19 00 00  */
    unsigned long  EndpointsToBeDisabledCount; /*  +0x0040  */
    unsigned char EndpointsToRemainUnchanged[4]; /*  +0x0044 57 19 00 00  */
    unsigned long  EndpointsToRemainUnchangedCount; /*  +0x0048  */
    unsigned long  MaxPacketSize; /*  +0x004c  */
    unsigned char UsbDeviceInfo[16]; /*  +0x0050 7e 19 00 00  */
    unsigned char MuxContext[28]; /*  +0x0060 7f 19 00 00  */
    unsigned char ControlRequest[92]; /*  +0x007c 80 19 00 00  */
    unsigned char UcxRequest[4]; /*  +0x00d8 1b 13 00 00  */
    unsigned char UcxRequestIrp[4]; /*  +0x00dc a4 10 00 00  */
    unsigned char UcxIoctlRequestMemory[4]; /*  +0x00e0 8d 12 00 00  */
    unsigned long  UcxIoctl; /*  +0x00e4  */
    unsigned char Timer[4]; /*  +0x00e8 9c 14 00 00  */
    unsigned char BootResetTimer[4]; /*  +0x00ec 9c 14 00 00  */
    unsigned char CurrentClientRequest[4]; /*  +0x00f0 1b 13 00 00  */
    unsigned char CurrentFdoRequest[4]; /*  +0x00f4 1b 13 00 00  */
    unsigned char QueryDeviceTextEvent[16]; /*  +0x00f8 4b 10 00 00  */
    unsigned char FdoGetDescriptorRequestEvent[16]; /*  +0x0108 4b 10 00 00  */
    unsigned char PreformattedGetDescriptorRequest[4]; /*  +0x0118 1b 13 00 00  */
    unsigned char DsmContext[1000]; /*  +0x011c 81 19 00 00  */
    long  LastOperationNtStatus; /*  +0x0504  */
    long  LastOperationUsbdStatus; /*  +0x0508  */
    unsigned char PdoDeviceInit[4]; /*  +0x050c 30 12 00 00  */
    long  PnPPowerStatus; /*  +0x0510  */
    unsigned char PnPPowerEvent[16]; /*  +0x0514 4b 10 00 00  */
    unsigned char DeviceFlags[4]; /*  +0x0524 82 19 00 00  */
    unsigned char DeviceSqmFlags[4]; /*  +0x0528 83 19 00 00  */
    unsigned char DeviceHackFlags[4]; /*  +0x052c 84 19 00 00  */
    unsigned long  DeviceAddress; /*  +0x0530  */
    unsigned char CurrentTargetPipe[4]; /*  +0x0534 86 19 00 00  */
    unsigned char UxdSettings[68]; /*  +0x0538 87 19 00 00  */
    unsigned char ScratchBuffer[256]; /*  +0x057c 88 19 00 00  */
    unsigned char DeviceDescriptor[20]; /*  +0x067c 89 19 00 00  */
    unsigned char CompatIdInterfaceDescriptor[4]; /*  +0x0690 8b 19 00 00  */
    unsigned char ConfigurationDescriptor[4]; /*  +0x0694 8d 19 00 00  */
    unsigned char LanguageIdDescriptor[4]; /*  +0x0698 8f 19 00 00  */
    unsigned char ProductIdStringDescriptor[4]; /*  +0x069c 8f 19 00 00  */
    unsigned short  CurrentLanguageId; /*  +0x06a0  */
    unsigned char DeviceQualifierDescriptor[10]; /*  +0x06a2 90 19 00 00  */
    unsigned char  MsOsVendorCode; /*  +0x06ac  */
    unsigned char BOSDescriptor[4]; /*  +0x06b0 92 19 00 00  */
    unsigned char ContainerId[16]; /*  +0x06b4 fe 10 00 00  */
    unsigned char MsOsDescriptor[20]; /*  +0x06c4 93 19 00 00  */
    unsigned char MsExtConfigDesc[4]; /*  +0x06d8 95 19 00 00  */
    unsigned char MsExtPropertyDesc[4]; /*  +0x06dc 97 19 00 00  */
    unsigned char UxdId[8]; /*  +0x06e0 2e 10 00 00  */
    unsigned char SymbolicLinkName[4]; /*  +0x06e8 6a 12 00 00  */
    unsigned char SerialNumberId[12]; /*  +0x06ec 98 19 00 00  */
    unsigned char PnpDeviceId[12]; /*  +0x06f8 98 19 00 00  */
    unsigned char PnpHardwareId[12]; /*  +0x0704 98 19 00 00  */
    unsigned char PnpCompatibleId[12]; /*  +0x0710 98 19 00 00  */
    unsigned char UniqueId[12]; /*  +0x071c 98 19 00 00  */
    unsigned char ProductId[12]; /*  +0x0728 98 19 00 00  */
    unsigned char SupportedLanguageIds[12]; /*  +0x0734 98 19 00 00  */
    unsigned char GenericDevString[12]; /*  +0x0740 98 19 00 00  */
    unsigned char FriendlyNameIdString[12]; /*  +0x074c 98 19 00 00  */
    unsigned char TextLocationIdString[12]; /*  +0x0758 98 19 00 00  */
    unsigned char WdfActivityId[16]; /*  +0x0764 fe 10 00 00  */
    unsigned short  U1ExitLatency; /*  +0x0774  */
    unsigned short  U2ExitLatency; /*  +0x0776  */
    unsigned char UsbSelInfo[6]; /*  +0x0778 99 19 00 00  */
    unsigned short  HostInitiatedU1ExitLatency; /*  +0x077e  */
    unsigned short  HostInitiatedU2ExitLatency; /*  +0x0780  */
    unsigned char  U1Timeout; /*  +0x0782  */
    unsigned char  U2Timeout; /*  +0x0783  */
    void *BootDeviceHandle; /*  +0x0784  */
    long  BootDeviceReportedMissing; /*  +0x0788  */
    unsigned char ControlRequestForBootDevice[92]; /*  +0x078c 80 19 00 00  */
    unsigned char OutOfBandwidthTimer[4]; /*  +0x07e8 9c 14 00 00  */
};

enum _USB_PORT_FEATURE_SELECTOR {
    PORT_CONNECTION = 0,
    PORT_ENABLE = 1,
    PORT_SUSPEND = 2,
    PORT_OVER_CURRENT = 3,
    PORT_RESET = 4,
    PORT_LINK_STATE = 5,
    PORT_POWER = 8,
    PORT_LOW_SPEED = 9,
    C_PORT_CONNECTION = 16,
    C_PORT_ENABLE = 17,
    C_PORT_SUSPEND = 18,
    C_PORT_OVER_CURRENT = 19,
    C_PORT_RESET = 20,
    PORT_TEST = 21,
    PORT_INDICATOR = 22,
    PORT_U1_TIMEOUT = 23,
    PORT_U2_TIMEOUT = 24,
    C_PORT_LINK_STATE = 25,
    C_PORT_CONFIG_ERROR = 26,
    PORT_REMOTE_WAKE_MASK = 27,
    BH_PORT_RESET = 28,
    C_BH_PORT_RESET = 29,
    FORCE_LINKPM_ACCEPT = 30
};

enum _USB_CONNECTION_STATUS {
    NoDeviceConnected = 0,
    DeviceConnected = 1,
    DeviceFailedEnumeration = 2,
    DeviceGeneralFailure = 3,
    DeviceCausedOvercurrent = 4,
    DeviceNotEnoughPower = 5,
    DeviceNotEnoughBandwidth = 6,
    DeviceHubNestedTooDeeply = 7,
    DeviceInLegacyHub = 8,
    DeviceEnumerating = 9,
    DeviceReset = 10
};

struct _PORT_CONTEXT {
    unsigned char HubFdoContext[4]; /*  +0x0000 75 19 00 00  */
    unsigned char CurrentPortEvent[4]; /*  +0x0004 9d 19 00 00  */
    unsigned char CurrentFeatureSelector[4]; /*  +0x0008 9f 19 00 00  */
    unsigned char PortControlRequest[92]; /*  +0x000c 80 19 00 00  */
    unsigned char CurrentPortStatusChange[4]; /*  +0x0068 a0 19 00 00  */
    unsigned char PreviousPortStatus[2]; /*  +0x006c a1 19 00 00  */
    unsigned char CumulativePortChange[2]; /*  +0x006e a2 19 00 00  */
    unsigned char PortInformation[16]; /*  +0x0070 a3 19 00 00  */
    unsigned char Timer[4]; /*  +0x0080 9c 14 00 00  */
    unsigned char ResetPollingTimer[4]; /*  +0x0084 9c 14 00 00  */
    unsigned char MuxContext[12]; /*  +0x0088 a4 19 00 00  */
    unsigned char PsmContext[1000]; /*  +0x0094 81 19 00 00  */
    unsigned char DeviceContext[4]; /*  +0x047c 73 19 00 00  */
    unsigned char PortFlags[4]; /*  +0x0480 a5 19 00 00  */
    unsigned char AcpiUpcPackage[12]; /*  +0x0484 a6 19 00 00  */
    unsigned char AcpiPldPackage[16]; /*  +0x0490 a7 19 00 00  */
    unsigned char ConnectorId[48]; /*  +0x04a0 a8 19 00 00  */
    unsigned char ConnectionStatus[4]; /*  +0x04d0 aa 19 00 00  */
    unsigned char IfrLog[4]; /*  +0x04d4 ac 19 00 00  */
};

struct _USER_MODE_IOCTL_QUEUE_CONTEXT {
    unsigned char ControlRequest[92]; /*  +0x0000 80 19 00 00  */
};

enum _USB_HUB_FEATURE_SELECTOR {
    C_HUB_LOCAL_POWER = 0,
    C_HUB_OVER_CURRENT = 1
};

struct _HUB_FDO_CONTEXT {
    unsigned char Usbhub3TriageInfo[4]; /*  +0x0000 b5 19 00 00  */
    unsigned long  Reserved; /*  +0x0004  */
    unsigned char  QueryPortStatusForDebugging; /*  +0x0008  */
    unsigned char HubFdoDevice[4]; /*  +0x000c 75 12 00 00  */
    unsigned char HubPdo[4]; /*  +0x0010 b1 10 00 00  */
    unsigned char RootHubIoTarget[4]; /*  +0x0014 b3 13 00 00  */
    unsigned char HubInformation[88]; /*  +0x0018 b6 19 00 00  */
    unsigned char HubParentInterface[84]; /*  +0x0070 b7 19 00 00  */
    unsigned char HubControllerStackInterface[96]; /*  +0x00c4 b8 19 00 00  */
    unsigned char UsbdBusInterface[48]; /*  +0x0124 b9 19 00 00  */
    unsigned char DeviceCapabilities[64]; /*  +0x0154 05 11 00 00  */
    unsigned char HubStatusAndChange[4]; /*  +0x0194 ba 19 00 00  */
    unsigned char OldHubStatusAndChange[4]; /*  +0x0198 ba 19 00 00  */
    unsigned char CurrentFeatureSelector[4]; /*  +0x019c bc 19 00 00  */
    unsigned char CurrentHubChangeEvent[4]; /*  +0x01a0 bd 19 00 00  */
    unsigned char HubDeviceStatus[4]; /*  +0x01a4 be 19 00 00  */
    unsigned char HubControlRequest[92]; /*  +0x01a8 80 19 00 00  */
    unsigned char StatusChangeInterruptRequest[100]; /*  +0x0204 bf 19 00 00  */
    unsigned char PnPPowerEvent[16]; /*  +0x0268 4b 10 00 00  */
    long  PnPPowerStatus; /*  +0x0278  */
    unsigned char Timer[4]; /*  +0x027c 9c 14 00 00  */
    unsigned char HubDescriptor[72]; /*  +0x0280 c0 19 00 00  */
    unsigned char ConfigurationDescriptor[4]; /*  +0x02c8 8d 19 00 00  */
    unsigned char HsmContext[1000]; /*  +0x02cc 81 19 00 00  */
    unsigned char MuxContext[60]; /*  +0x06b4 c1 19 00 00  */
    unsigned char FromPDOQueue[4]; /*  +0x06f0 9e 13 00 00  */
    unsigned char DeviceControlQueue[4]; /*  +0x06f4 9e 13 00 00  */
    unsigned char ResetFlags[4]; /*  +0x06f8 c2 19 00 00  */
    unsigned char CurrentActivityId[16]; /*  +0x06fc fe 10 00 00  */
    unsigned char ListEntry[8]; /*  +0x070c 17 10 00 00  */
    unsigned char HubInfoFromParent[40]; /*  +0x0714 c3 19 00 00  */
    unsigned char IfrLog[4]; /*  +0x073c ac 19 00 00  */
    unsigned char PdoGetPortStatusRequest[4]; /*  +0x0740 1b 13 00 00  */
    unsigned char WmiNotificationHandle[4]; /*  +0x0744 fd 16 00 00  */
    unsigned char HubSymbolicLinkNameUnicode[8]; /*  +0x0748 2e 10 00 00  */
};

enum UCX_FORWARD_PROGRESS_ENQUEUE_OPTIONS {
     = 32771
};

struct _HUB_CONTROLLERSTACK_INTERFACE {
    unsigned short  Size; /*  +0x0000  */
    unsigned short  Version; /*  +0x0002  */
    void *Context; /*  +0x0004  */
    unsigned char InterfaceReference[4]; /*  +0x0008 7e 10 00 00  */
    unsigned char InterfaceDereference[4]; /*  +0x000c 7e 10 00 00  */
    unsigned char Hub[4]; /*  +0x0010 c5 18 00 00  */
    unsigned char HubContext[4]; /*  +0x0014 c9 19 00 00  */
    unsigned char ClearTTBuffer[4]; /*  +0x0018 ce 19 00 00  */
    unsigned char UsbDeviceCreate[4]; /*  +0x001c d2 19 00 00  */
    unsigned char UsbDeviceDelete[4]; /*  +0x0020 d5 19 00 00  */
    unsigned char UsbDeviceDisconnect[4]; /*  +0x0024 d5 19 00 00  */
    unsigned char UsbDeviceSetPdoInformation[4]; /*  +0x0028 d8 19 00 00  */
    unsigned char DefaultEndpointCreate[4]; /*  +0x002c db 19 00 00  */
    unsigned char Address0OwnershipRelease[4]; /*  +0x0030 d5 19 00 00  */
    unsigned char EndpointCreate[4]; /*  +0x0034 de 19 00 00  */
    unsigned char EndpointDelete[4]; /*  +0x0038 e1 19 00 00  */
    unsigned char EndpointGetUsbdPipeHandle[4]; /*  +0x003c e3 19 00 00  */
    void *UsbDeviceGetPerformanceInfo; /*  +0x0040  */
    unsigned char ForwardProgressWorkItemAllocate[4]; /*  +0x0044 e8 19 00 00  */
    unsigned char ForwardProgressWorkItemDelete[4]; /*  +0x0048 eb 19 00 00  */
    unsigned char ForwardProgressWorkItemEnqueue[4]; /*  +0x004c f3 19 00 00  */
    unsigned char ForwardProgressWorkItemFlush[4]; /*  +0x0050 eb 19 00 00  */
    unsigned char ClearTTBufferComplete[4]; /*  +0x0054 f6 19 00 00  */
    unsigned char NoPingResponse[4]; /*  +0x0058 f9 19 00 00  */
    unsigned char IsDeviceDisconnected[4]; /*  +0x005c fc 19 00 00  */
};

struct _IDLE_WORKER_CONTEXT {
    unsigned char SmContext[4]; /*  +0x0000 07 1a 00 00  */
};

enum _MS_OS_MODE {
    MsOsModeOneTimeQuery = 0,
    MsOsModeForceQuery = 1,
    MsOsModeDisableQuery = 2
};

struct _HUB_GLOBALS {
    unsigned long  Reserved; /*  +0x0000  */
    unsigned char HubGlobalFlags[4]; /*  +0x0004 0d 1a 00 00  */
    unsigned char MsOsMode[4]; /*  +0x0008 0f 1a 00 00  */
    unsigned char HubFdoListHead[8]; /*  +0x000c 17 10 00 00  */
    unsigned char HubFdoListLock[4]; /*  +0x0014 13 12 00 00  */
    unsigned char LpmValues[8]; /*  +0x0018 10 1a 00 00  */
    unsigned char ConnectorMapHead[8]; /*  +0x0020 17 10 00 00  */
    unsigned char ConnectorMapLock[4]; /*  +0x0028 13 12 00 00  */
};

struct _MCGEN_TRACE_CONTEXT {
    unsigned long long  RegistrationHandle; /*  +0x0000  */
    unsigned long long  Logger; /*  +0x0008  */
    unsigned long long  MatchAnyKeyword; /*  +0x0010  */
    unsigned long long  MatchAllKeyword; /*  +0x0018  */
    unsigned long  Flags; /*  +0x0020  */
    unsigned long  IsEnabled; /*  +0x0024  */
    unsigned char  Level; /*  +0x0028  */
    unsigned char  Reserve; /*  +0x0029  */
    unsigned short  EnableBitsCount; /*  +0x002a  */
    unsigned long *EnableBitMask; /*  +0x002c  */
    unsigned char EnableKeyWords[4]; /*  +0x0030 76 11 00 00  */
    unsigned char EnableLevel[4]; /*  +0x0034 74 11 00 00  */
};

struct _EVENT_FILTER_DESCRIPTOR {
    unsigned long long  Ptr; /*  +0x0000  */
    unsigned long  Size; /*  +0x0008  */
    unsigned long  Type; /*  +0x000c  */
};

struct _HUB_PDO_CONTEXT {
    unsigned char  FailIo; /*  +0x0000  */
    long  CyclePortInProgress; /*  +0x0004  */
    unsigned char TargetDeviceObject[4]; /*  +0x0008 b1 10 00 00  */
    unsigned char HubFdoContext[4]; /*  +0x000c 75 19 00 00  */
    unsigned char AssociatedDSM[4]; /*  +0x0010 73 19 00 00  */
    unsigned char PdoFlags[12]; /*  +0x0014 3b 1a 00 00  */
    unsigned long  LastPowerRequested; /*  +0x0020  */
    unsigned char ConfigurationHandleMemory[4]; /*  +0x0024 8d 12 00 00  */
    unsigned short  PortNumber; /*  +0x0028  */
    unsigned char FailData[4]; /*  +0x002c 3d 1a 00 00  */
    unsigned char ChildHubFdoContext[4]; /*  +0x0030 75 19 00 00  */
    unsigned char IdleIrpContext[160]; /*  +0x0034 06 1a 00 00  */
    unsigned char WakeNotification[4]; /*  +0x00d4 1b 13 00 00  */
    unsigned char LpmPowerSettingsHandles[32]; /*  +0x00d8 3e 1a 00 00  */
    unsigned char DummyParentTarget[4]; /*  +0x00f8 b3 13 00 00  */
};

struct _WAKE_NOTIFICATION_REQUEST_CONTEXT {
    unsigned char UcxRequestContext[12]; /*  +0x0000 44 1a 00 00  */
    unsigned char CompletionEvent[16]; /*  +0x000c 4b 10 00 00  */
};

enum _USB_DEVICE_SPEED {
    UsbLowSpeed = 0,
    UsbFullSpeed = 1,
    UsbHighSpeed = 2,
    UsbSuperSpeed = 3
};

struct _VALIDATION_DEVICE_INFO {
    unsigned short  USBVersion; /*  +0x0000  */
    unsigned char USBSpeed[4]; /*  +0x0004 62 1a 00 00  */
    unsigned char  EnforceStrictestParsing; /*  +0x0008  */
    unsigned char  EnableWin7StricterParsing; /*  +0x0009  */
    unsigned char  RelaxParsing; /*  +0x000a  */
};

struct _USB_COMMON_DESCRIPTOR {
    unsigned char  bLength; /*  +0x0000  */
    unsigned char  bDescriptorType; /*  +0x0001  */
};

enum _VALIDATION_RESULT {
    ValidationSuccess = 0,
    ValidationFatalError = 1,
    ValidationFailed = 2
};

struct _INTERNAL_VALIDATION_DATA {
    unsigned char DevInfo[12]; /*  +0x0000 5f 1a 00 00  */
    unsigned char *DescriptorSetBeginning; /*  +0x000c  */
    unsigned char *DescriptorSetEnd; /*  +0x0010  */
    unsigned long  BufferLength; /*  +0x0014  */
};

struct _INTERNAL_CONFIG_VALIDATION_DATA {
    unsigned char DevInfo[12]; /*  +0x0000 5f 1a 00 00  */
    unsigned char *DescriptorSetBeginning; /*  +0x000c  */
    unsigned char *DescriptorSetEnd; /*  +0x0010  */
    unsigned long  BufferLength; /*  +0x0014  */
    unsigned char  CurrentInterfaceNumber; /*  +0x0018  */
    unsigned char  CurrentAltSetting; /*  +0x0019  */
    unsigned char AlternateSettingsBitmap[8]; /*  +0x001c 7b 1a 00 00  */
    unsigned char AlternateSettings[32]; /*  +0x0024 7c 1a 00 00  */
    unsigned char EndpointAddressesBitmap[8]; /*  +0x0044 7b 1a 00 00  */
    unsigned char EndpointAddresses[32]; /*  +0x004c 7c 1a 00 00  */
    unsigned char  NumberEndpoints; /*  +0x006c  */
    unsigned char  EndpointCount; /*  +0x006d  */
    unsigned char LastEndpointDescriptor[4]; /*  +0x0070 10 19 00 00  */
    unsigned char  EndpointCompanionFound; /*  +0x0074  */
    unsigned short  InterfacesFound; /*  +0x0076  */
    unsigned char InterfaceNumberBitmap[8]; /*  +0x0078 7b 1a 00 00  */
    unsigned char InterfaceNumbers[32]; /*  +0x0080 7c 1a 00 00  */
    unsigned char ValidationFlags[4]; /*  +0x00a0 7d 1a 00 00  */
};

struct _USB_CONFIGURATION_DESCRIPTOR {
    unsigned char  bLength; /*  +0x0000  */
    unsigned char  bDescriptorType; /*  +0x0001  */
    unsigned short  wTotalLength; /*  +0x0002  */
    unsigned char  bNumInterfaces; /*  +0x0004  */
    unsigned char  bConfigurationValue; /*  +0x0005  */
    unsigned char  iConfiguration; /*  +0x0006  */
    unsigned char  bmAttributes; /*  +0x0007  */
    unsigned char  MaxPower; /*  +0x0008  */
};

struct _USB_BOS_DESCRIPTOR {
    unsigned char  bLength; /*  +0x0000  */
    unsigned char  bDescriptorType; /*  +0x0001  */
    unsigned short  wTotalLength; /*  +0x0002  */
    unsigned char  bNumDeviceCaps; /*  +0x0004  */
};

struct _BOS_DESC_SET_INFO {
    unsigned char USB20CapabilityDescriptor[4]; /*  +0x0000 8b 1a 00 00  */
    unsigned char USB30CapabilityDescriptor[4]; /*  +0x0004 8d 1a 00 00  */
    unsigned char ContainerIDDescriptor[4]; /*  +0x0008 8f 1a 00 00  */
};

struct _INTERNAL_BOS_VALIDATION_DATA {
    unsigned char DevInfo[12]; /*  +0x0000 5f 1a 00 00  */
    unsigned char *DescriptorSetBeginning; /*  +0x000c  */
    unsigned char *DescriptorSetEnd; /*  +0x0010  */
    unsigned long  BufferLength; /*  +0x0014  */
    unsigned char BOSInfo[4]; /*  +0x0018 88 1a 00 00  */
};

struct _USB_STRING_DESCRIPTOR {
    unsigned char  bLength; /*  +0x0000  */
    unsigned char  bDescriptorType; /*  +0x0001  */
    unsigned char bString[2]; /*  +0x0002 9c 1a 00 00  */
};

enum _STATE_FLAGS {
    StateFlagNone = 0,
    StateFlagHandlesCriticalEventsOnly = 1,
    StateFlagHandlesLowPriEvents = 2,
    StateFlagPopIfParentStateChanges = 4,
    StateFlagEndSubStateMachine = 8,
    StateFlagRequiresPassive = 16,
    StateFlagAllowsHubSuspend = 32
};

struct _STATE_ENTRY {
    unsigned char EntryFunc[4]; /*  +0x0000 a5 1a 00 00  */
    unsigned char StateFlags[4]; /*  +0x0004 a7 1a 00 00  */
    unsigned char SubSmEntries[4]; /*  +0x0008 a9 1a 00 00  */
    /* unsigned char Transitions[0];  +0x000c ab 1a 00 00  */
};

struct _URB_BULK_OR_INTERRUPT_TRANSFER {
    unsigned char Hdr[16]; /*  +0x0000 79 18 00 00  */
    void *PipeHandle; /*  +0x0010  */
    unsigned long  TransferFlags; /*  +0x0014  */
    unsigned long  TransferBufferLength; /*  +0x0018  */
    void *TransferBuffer; /*  +0x001c  */
    unsigned char TransferBufferMDL[4]; /*  +0x0020 90 10 00 00  */
    unsigned char UrbLink[4]; /*  +0x0024 78 18 00 00  */
    unsigned char hca[32]; /*  +0x0028 ae 1a 00 00  */
};

struct _SUBSM_ENTRY {
    unsigned char SubSmFlags[4]; /*  +0x0000 b2 1a 00 00  */
    unsigned char SubSmStartState[4]; /*  +0x0004 b3 1a 00 00  */
};

struct _IO_RESOURCE_REQUIREMENTS_LIST {
    unsigned long  ListSize; /*  +0x0000  */
    unsigned char InterfaceType[4]; /*  +0x0004 45 14 00 00  */
    unsigned long  BusNumber; /*  +0x0008  */
    unsigned long  SlotNumber; /*  +0x000c  */
    unsigned char Reserved[12]; /*  +0x0010 37 15 00 00  */
    unsigned long  AlternativeLists; /*  +0x001c  */
    unsigned char List[40]; /*  +0x0020 b7 1a 00 00  */
};

struct _ERESOURCE {
    unsigned char SystemResourcesList[8]; /*  +0x0000 17 10 00 00  */
    unsigned char OwnerTable[4]; /*  +0x0008 bb 1a 00 00  */
    short  ActiveCount; /*  +0x000c  */
    unsigned short  Flag; /*  +0x000e  */
    unsigned char  ReservedLowFlags; /*  +0x000e  */
    unsigned char  WaiterPriority; /*  +0x000f  */
    unsigned char SharedWaiters[4]; /*  +0x0010 bd 1a 00 00  */
    unsigned char ExclusiveWaiters[4]; /*  +0x0014 4f 10 00 00  */
    unsigned char OwnerEntry[8]; /*  +0x0018 ba 1a 00 00  */
    unsigned long  ActiveEntries; /*  +0x0020  */
    unsigned long  ContentionCount; /*  +0x0024  */
    unsigned long  NumberOfSharedWaiters; /*  +0x0028  */
    unsigned long  NumberOfExclusiveWaiters; /*  +0x002c  */
    void *Address; /*  +0x0030  */
    unsigned long  CreatorBackTraceIndex; /*  +0x0030  */
    unsigned long  SpinLock; /*  +0x0034  */
};

struct _URB_CONTROL_GET_STATUS_REQUEST {
    unsigned char Hdr[16]; /*  +0x0000 79 18 00 00  */
    void *Reserved; /*  +0x0010  */
    unsigned long  Reserved0; /*  +0x0014  */
    unsigned long  TransferBufferLength; /*  +0x0018  */
    void *TransferBuffer; /*  +0x001c  */
    unsigned char TransferBufferMDL[4]; /*  +0x0020 90 10 00 00  */
    unsigned char UrbLink[4]; /*  +0x0024 78 18 00 00  */
    unsigned char hca[32]; /*  +0x0028 ae 1a 00 00  */
    unsigned char Reserved1[4]; /*  +0x0048 c0 1a 00 00  */
    unsigned short  Index; /*  +0x004c  */
    unsigned short  Reserved2; /*  +0x004e  */
};

struct _DISPATCHER_HEADER {
    unsigned char  Type; /*  +0x0000  */
    unsigned char  TimerControlFlags; /*  +0x0001  */
    /* unsigned char Absolute[0];  +0x0001 c3 1a 00 00  */
    /* unsigned char Wake[0];  +0x0001 c4 1a 00 00  */
    /* unsigned char Coalescable[0];  +0x0001 c5 1a 00 00  */
    /* unsigned char KeepShifting[0];  +0x0001 c6 1a 00 00  */
    /* unsigned char EncodedTolerableDelay[0];  +0x0001 d6 11 00 00  */
    unsigned char  Abandoned; /*  +0x0001  */
    unsigned char  Signalling; /*  +0x0001  */
    unsigned char  ThreadControlFlags; /*  +0x0002  */
    /* unsigned char CycleProfiling[0];  +0x0002 c3 1a 00 00  */
    /* unsigned char CounterProfiling[0];  +0x0002 c4 1a 00 00  */
    /* unsigned char GroupScheduling[0];  +0x0002 c5 1a 00 00  */
    /* unsigned char AffinitySet[0];  +0x0002 c6 1a 00 00  */
    /* unsigned char Reserved[0];  +0x0002 d6 11 00 00  */
    unsigned char  Hand; /*  +0x0002  */
    unsigned char  Size; /*  +0x0002  */
    unsigned char  TimerMiscFlags; /*  +0x0003  */
    /* unsigned char Index[0];  +0x0003 c3 1a 00 00  */
    /* unsigned char Processor[0];  +0x0003 c7 1a 00 00  */
    /* unsigned char Inserted[0];  +0x0003 c8 1a 00 00  */
    /* unsigned char Expired[0];  +0x0003 ca 1a 00 00  */
    unsigned char  DebugActive; /*  +0x0003  */
    unsigned char  DpcActive; /*  +0x0003  */
    unsigned char Lock[4]; /*  +0x0000 15 10 00 00  */
    long  SignalState; /*  +0x0004  */
    unsigned char WaitListHead[8]; /*  +0x0008 17 10 00 00  */
};

enum _DSM_SUBSM_FLAGS {
    DsmSubSmFlagNone = 0,
    DsmSubSmFlagVersion10 = 1,
    DsmSubSmFlagVersion1X = 2,
    DsmSubSmFlagVersion20 = 4,
    DsmSubSmFlagVersion2X = 8,
    DsmSubSmFlagVersion3X = 16,
    DsmSubSmFlagVersionAny = 255,
    DsmSubSmFlagSpeedHigh = 256,
    DsmSubSmFlagSpeedFull = 512,
    DsmSubSmFlagSpeedLow = 1024,
    DsmSubSmFlagSpeedSuper = 2048,
     = 32770
};

enum _ISM_EVENT {
    IsmEventNull = 1000,
    IsmEventCallbackReturned = 6001,
    IsmEventIrpCancelled = 6002,
    IsmEventNewRequest = 6003,
    IsmEventOperationFailure = 6004,
    IsmEventOperationSuccess = 6005,
    IsmEventPDOCleanup = 6006,
    IsmEventPDOD0 = 6007,
    IsmEventPDOD3 = 6008,
    IsmEventStart = 6009,
    IsmEventWorkerRoutine = 6010
};

struct _ISM_STATE_ENTRY {
    unsigned char EntryFunc[4]; /*  +0x0000 d6 1a 00 00  */
    /* unsigned char Transitions[0];  +0x0004 d8 1a 00 00  */
};

struct _URB_CONTROL_DESCRIPTOR_REQUEST {
    unsigned char Hdr[16]; /*  +0x0000 79 18 00 00  */
    void *Reserved; /*  +0x0010  */
    unsigned long  Reserved0; /*  +0x0014  */
    unsigned long  TransferBufferLength; /*  +0x0018  */
    void *TransferBuffer; /*  +0x001c  */
    unsigned char TransferBufferMDL[4]; /*  +0x0020 90 10 00 00  */
    unsigned char UrbLink[4]; /*  +0x0024 78 18 00 00  */
    unsigned char hca[32]; /*  +0x0028 ae 1a 00 00  */
    unsigned short  Reserved1; /*  +0x0048  */
    unsigned char  Index; /*  +0x004a  */
    unsigned char  DescriptorType; /*  +0x004b  */
    unsigned short  LanguageId; /*  +0x004c  */
    unsigned short  Reserved2; /*  +0x004e  */
};

struct _HUB_INTERRUPT_REQUEST {
    unsigned char WdfRequest[4]; /*  +0x0000 1b 13 00 00  */
    unsigned char Urb[72]; /*  +0x0004 83 18 00 00  */
    void *UsbdInterruptPipeHandle; /*  +0x004c  */
    unsigned char  NoChangesInLastInterrupt; /*  +0x0050  */
    unsigned long *StatusChangeBitMap; /*  +0x0054  */
    unsigned short  StatusChangeBitMapSize; /*  +0x0058  */
    unsigned char StatusChangeBitMapHeader[8]; /*  +0x005c 7b 1a 00 00  */
};

struct _GROUP_AFFINITY {
    unsigned long  Mask; /*  +0x0000  */
    unsigned short  Group; /*  +0x0004  */
    unsigned char Reserved[6]; /*  +0x0006 e0 1a 00 00  */
};

struct _URB_ISOCH_TRANSFER {
    unsigned char Hdr[16]; /*  +0x0000 79 18 00 00  */
    void *PipeHandle; /*  +0x0010  */
    unsigned long  TransferFlags; /*  +0x0014  */
    unsigned long  TransferBufferLength; /*  +0x0018  */
    void *TransferBuffer; /*  +0x001c  */
    unsigned char TransferBufferMDL[4]; /*  +0x0020 90 10 00 00  */
    unsigned char UrbLink[4]; /*  +0x0024 78 18 00 00  */
    unsigned char hca[32]; /*  +0x0028 ae 1a 00 00  */
    unsigned long  StartFrame; /*  +0x0048  */
    unsigned long  NumberOfPackets; /*  +0x004c  */
    unsigned long  ErrorCount; /*  +0x0050  */
    unsigned char IsoPacket[12]; /*  +0x0054 e4 1a 00 00  */
};

struct _KAPC {
    unsigned char  Type; /*  +0x0000  */
    unsigned char  SpareByte0; /*  +0x0001  */
    unsigned char  Size; /*  +0x0002  */
    unsigned char  SpareByte1; /*  +0x0003  */
    unsigned long  SpareLong0; /*  +0x0004  */
    unsigned char Thread[4]; /*  +0x0008 9f 10 00 00  */
    unsigned char ApcListEntry[8]; /*  +0x000c 17 10 00 00  */
    unsigned char Reserved[12]; /*  +0x0014 e7 1a 00 00  */
    void *NormalContext; /*  +0x0020  */
    void *SystemArgument1; /*  +0x0024  */
    void *SystemArgument2; /*  +0x0028  */
    char  ApcStateIndex; /*  +0x002c  */
    char  ApcMode; /*  +0x002d  */
    unsigned char  Inserted; /*  +0x002e  */
};

struct _FILE_GET_QUOTA_INFORMATION {
    unsigned long  NextEntryOffset; /*  +0x0000  */
    unsigned long  SidLength; /*  +0x0004  */
    unsigned char Sid[12]; /*  +0x0008 ed 1a 00 00  */
};

enum _GENERIC_STATE {
    GenericStateIgnored = 1000,
    GenericStateEmptySubState = 1001,
    GenericStateNull = 1002
};

enum _HSM_STATE {
    HsmStateIgnored = 1000,
    HsmStateEmptySubState = 1001,
    HsmStateNull = 1002,
    HsmStateCompleteWithStatusFailed = 1003,
    HsmStateRequestPortCycle = 1004,
    HsmStateSignalQueryDeviceTextEvent = 1005,
    HsmStateCompleteFDORequestWithStatusFailed = 1006,
    HsmStateCompleteGetPortStatusWithInternalError = 1007,
    HsmStateCompleteGetPortStatusWithNoSuchDevice = 1008,
    HsmStateWaitingForAddDevice = 2000,
    HsmStateAcquiringWdfPowerReferenceInitialD0Entry = 2001,
    HsmStateAcquiringWdfPowerReferenceOnInterrupt = 2002,
    HsmStateAcquiringWdfPowerReferenceOnInterruptFailure = 2003,
    HsmStateAcquiringWdfPowerReferenceOnReset = 2004,
    HsmStateAcquiringWdfPowerReferenceOnResumeInSX = 2005,
    HsmStateAcquiringWdfReferenceOnResumeInS0 = 2006,
    HsmStateCancellingInterruptTransferOnReset = 2007,
    HsmStateCancellingInterruptTransferOnStop = 2008,
    HsmStateCancellingInterruptTransferOnSuspend = 2009,
    HsmStateCheckIfThereIsAValidHubChange = 2010,
    HsmStateCheckingForUnexpectedPowerLoss = 2011,
    HsmStateCheckingIfResetByParent = 2012,
    HsmStateCheckingIfResetByParentWithResetPending = 2013,
    HsmStateCheckingIfResetRecoveryHasBeenInvokedTooManyTimes = 2014,
    HsmStateCheckingPSMInterruptReferencesOnReset = 2015,
    HsmStateCheckingPSMInterruptReferencesOnResetInNoInterrupt = 2016,
    HsmStateCheckingPSMInterruptReferencesOnResetInNoInterruptOnFatalError = 2017,
    HsmStateCheckingPSMInterruptReferencesOnStop = 2018,
    HsmStateCheckingPSMInterruptReferencesOnStopInNoInterrupt = 2019,
    HsmStateCheckingPSMInterruptReferencesOnSuspend = 2020,
    HsmStateCheckingPSMInterruptReferencesOnSxInNoInterrupt = 2021,
    HsmStateCheckOverCurrentBit = 2022,
    HsmStateCompletingPDORequestForGetPortStatus = 2023,
    HsmStateCompletingPDORequestForGetPortStatusFromConfigWithIntTransfer = 2024,
    HsmStateCompletingPDORequestForGetPortStatusFromConfigWithIntTransferWithNoSuchDevice = 2025,
    HsmStateCompletingPDORequestForGetPortStatusInSuspended = 2026,
    HsmStateCompletingPDORequestForGetPortStatusWithNoSuchDevice = 2027,
    HsmStateConfiguredWithIntTransfer = 2028,
    HsmStateConfiguredWithoutInterruptTransfer = 2029,
    HsmStateConfiguring = 2030,
    HsmStateConfiguringHubAfterReset = 2031,
    HsmStateConfiguringHubAfterResetOnSystemResume = 2032,
    HsmStateCreatingChildPSMs = 2033,
    HsmStateErrorOnWaitingForOvercurrentClear = 2034,
    HsmStateGettingAdditionalConfigInfo = 2035,
    HsmStateGettingHubPortStatus = 2036,
    HsmStateGettingHubPortStatusForLostChanges = 2037,
    HsmStateGettingOverCurrentBitStatus = 2038,
    HsmStateGettingPortStatusOnPDORequest = 2039,
    HsmStateGettingPortStatusOnPDORequestFromConfigWithIntTransfer = 2040,
    HsmStateHasResetCountReachedMaximum = 2041,
    HsmStateHubStatusError = 2042,
    HsmStateInitializingResetCount = 2043,
    HsmStateIsItHubChange = 2044,
    HsmStateLoggingHubWasReset = 2045,
    HsmStateNotifyingHubResetToPortsOnReset = 2046,
    HsmStateNotifyingHubResetToPortsOnResetOnFatalError = 2047,
    HsmStateNotifyingHubResetToPortsOnResetOnResume = 2048,
    HsmStateNotifyingHubResumeInS0ToDevices = 2049,
    HsmStateNotifyingHubResumeToDevices = 2050,
    HsmStateNotifyingHubResumeWithResetToDevices = 2051,
    HsmStateNotifyingHubResumeWithResetToDevicesOnFailure = 2052,
    HsmStateNotifyingHubStopToDevices = 2053,
    HsmStateNotifyingHubStopToPorts = 2054,
    HsmStateNotifyingHubStopToPortsOnFatalError = 2055,
    HsmStateNotifyingHubStopToPortsOnReset = 2056,
    HsmStateQueueingFakeStatusChangeOnResumeInS0 = 2057,
    HsmStateQueueingHubStatusForLostChanges = 2058,
    HsmStateQueueingPortStatusChangeEvents = 2059,
    HsmStateQueuingHubChange = 2060,
    HsmStateReConfiguring = 2061,
    HsmStateRegisteringFDOForResetNotification = 2062,
    HsmStateReleasingWdfPowerReferenceOnStopFromPnPFailure = 2063,
    HsmStateReportingErrorToPnp = 2064,
    HsmStateReportingReStartFailure = 2065,
    HsmStateReportingStartFailure = 2066,
    HsmStateResettingHub = 2067,
    HsmStateResettingHubOnResume = 2068,
    HsmStateSendingAckForHubChange = 2069,
    HsmStateSendingInterruptTransfer = 2070,
    HsmStateSignalingPnPPowerEventOnPendingStop = 2071,
    HsmStateSignalingPnPPowerEventOnStart = 2072,
    HsmStateSignalingPnPPowerEventOnStop = 2073,
    HsmStateSignalingPnPPowerEventOnSurpriseRemove = 2074,
    HsmStateSignallingPnpPowerEventInUnconfigured = 2075,
    HsmStateStartingTimerForResetRetry = 2076,
    HsmStateStopped = 2077,
    HsmStateStoppingResetTimerOnStop = 2078,
    HsmStateStoppingResetTimerOnSuspend = 2079,
    HsmStateSupriseRemoved = 2080,
    HsmStateSuspended = 2081,
    HsmStateSuspendedInRecycle = 2082,
    HsmStateSuspendedWhileTryingHubReset = 2083,
    HsmStateSuspendedWithPendingReset = 2084,
    HsmStateUnblockingResumeOnHubResetFailure = 2085,
    HsmStateUnblockingResumeWhileTryingHubReset = 2086,
    HsmStateUnblockResumeWaitingForStop = 2087,
    HsmStateUnconfigured = 2088,
    HsmStateWaitingForD0Entry = 2089,
    HsmStateWaitingForDevicesToAcquireReferenceOnStart = 2090,
    HsmStateWaitingForDevicesToReleaseReferenceOnD0ExitFinalFromReset = 2091,
    HsmStateWaitingForDevicesToReleaseReferenceOnSuspend = 2092,
    HsmStateWaitingForEnableInterruptsOnReset = 2093,
    HsmStateWaitingForEnableInterruptsOnStop = 2094,
    HsmStateWaitingForEnableInterruptsOnSx = 2095,
    HsmStateWaitingForInterruptReferencesReleasedOnFatalError = 2096,
    HsmStateWaitingForInterruptReferencesReleasedOnReset = 2097,
    HsmStateWaitingForInterruptReferencesReleasedOnStop = 2098,
    HsmStateWaitingForInterruptReferencesReleasedOnSuspend = 2099,
    HsmStateWaitingForOvercurrentToClear = 2100,
    HsmStateWaitingForPortsToAcquireReferenceOnResume = 2101,
    HsmStateWaitingForPortsToAcquireReferenceOnResumeInS0 = 2102,
    HsmStateWaitingForPortsToAcquireReferenceOnResumeWithReset = 2103,
    HsmStateWaitingForPortsToAcquireReferenceOnStart = 2104,
    HsmStateWaitingForPortsToAcquireReferencePostReset = 2105,
    HsmStateWaitingForPortsToReleaseReferenceOnReset = 2106,
    HsmStateWaitingForPortsToReleaseReferenceOnResetOnResume = 2107,
    HsmStateWaitingForPortsToReleaseReferenceOnStop = 2108,
    HsmStateWaitingForPortsToReleaseReferenceOnSuspend = 2109,
    HsmStateWaitingForPSMInterruptReferencesOnReset = 2110,
    HsmStateWaitingForPSMInterruptReferencesOnStop = 2111,
    HsmStateWaitingForPSMInterruptReferencesOnSuspend = 2112,
    HsmStateWaitingForReleaseHardware = 2113,
    HsmStateWaitingForReleaseHardwareOnReStartFailure = 2114,
    HsmStateWaitingForReleaseHardwareOnStartFailure = 2115,
    HsmStateWaitingForResetRetryTimer = 2116,
    HsmStateWaitingForStop = 2117,
    HsmStateWaitingForTimerToFlushOnStop = 2118,
    HsmStateWaitingForTimerToFlushOnSuspendWithPendingReset = 2119,
    HsmStateWaitingToBeDeleted = 2120,
    HsmStateUnblockingUpStreamReset = 2121,
    HsmStateWaitingForUpStreamReset = 2122,
    HsmStateCheckingBytesReturnedInHubConfigDescriptor = 2123,
    HsmStateCheckingIfHubDescriptorRetryCountExceededMax = 2124,
    HsmStateConfiguringAfterSetConfig = 2125,
    HsmStateGettingHubConfigurationDescriptorWithDefaultLength = 2126,
    HsmStateGettingHubConfigurationDescriptorWithReturnedLength = 2127,
    HsmStateGettingHubDescriptor = 2128,
    HsmStateGettingHubStatus = 2129,
    HsmStateInitializingHubDescriptorRetryCount = 2130,
    HsmStateReturningConfigurationFailure = 2131,
    HsmStateReturningConfigurationSuccess = 2132,
    HsmStateSettingHubConfiguration = 2133,
    HsmStateUpdatingHubInfoInUCX = 2134,
    HsmStateValidatingAndParsingHubDescriptor = 2135,
    HsmStateValidatingAndParsingHubPowerStatus = 2136,
    HsmStateValidatingHubConfigurationDescriptor = 2137,
    HsmStateWaitingForHubDescriptorRetryTimer = 2138,
    HsmStateGettingRootHub20PortsInfo = 2139,
    HsmStateGettingRootHub30PortsInfo = 2140,
    HsmStateGettingRootHubInfo = 2141,
    HsmStateReturningConfigurationFailureForRootHub = 2142,
    HsmStateReturningConfigurationSuccessForRootHub = 2143,
    HsmStateGettingAdditionalInfoFromParent = 2144,
    HsmStateReturningOperationFailure = 2145,
    HsmStateReturningOperationSuccess = 2146,
    HsmStateGettingHubDescriptorToCheckForPowerLoss = 2147,
    HsmStateReturningOperationFailureInCheckingForPowerLoss = 2148,
    HsmStateReturningOperationSuccessInCheckingForPowerLoss = 2149,
    HsmStateReturningOperationFailureInSettingHubDepth = 2150,
    HsmStateReturningOperationSuccessInSettingHubDepth = 2151,
    HsmStateSettingHubDepth = 2152
};

enum _PSM20_STATE {
    Psm20StateIgnored = 1000,
    Psm20StateEmptySubState = 1001,
    Psm20StateNull = 1002,
    Psm20StateCompleteWithStatusFailed = 1003,
    Psm20StateRequestPortCycle = 1004,
    Psm20StateSignalQueryDeviceTextEvent = 1005,
    Psm20StateCompleteFDORequestWithStatusFailed = 1006,
    Psm20StateCompleteGetPortStatusWithInternalError = 1007,
    Psm20StateCompleteGetPortStatusWithNoSuchDevice = 1008,
    Psm20StatePoweredOffDisconnected = 3000,
    Psm20StateAcquiringInterruptReferenceOnHSMInDisabled = 3001,
    Psm20StateAcquiringInterruptReferenceOnHSMInEnabled = 3002,
    Psm20StateAcquiringInterruptReferenceOnResuming = 3003,
    Psm20StateAcquiringPowerReferenceFromPoweredOffDisabledInS0 = 3004,
    Psm20StateAcquiringPowerReferenceFromPoweredOffDisconnectedInS0 = 3005,
    Psm20StateAcquiringPowerReferenceFromPoweredOffSuspendedInS0 = 3006,
    Psm20StateCancellingDisableOnHubStopSuspend = 3007,
    Psm20StateCancellingDisablingPortOnPortCycleOnHubStop = 3008,
    Psm20StateCancellingDisablingPortOnPortCycleWithTimerOnHubStop = 3009,
    Psm20StateCancellingQueryPortStatus = 3010,
    Psm20StateCancellingResetOnSurpriseRemove = 3011,
    Psm20StateCancellingSetPortPower = 3012,
    Psm20StateCheckingIfConnectBitOne = 3013,
    Psm20StateConnectedDisabled = 3014,
    Psm20StateConnectedEnabled = 3015,
    Psm20StateCreatingDevice = 3016,
    Psm20StateDetachingDeviceFromPortOnCycleOnHubStop = 3017,
    Psm20StateDetachingDeviceFromPortOnDisconnect = 3018,
    Psm20StateDetachingDeviceFromPortOnDisconnectWithTimer = 3019,
    Psm20StateDetachingDeviceFromPortOnOverCurrent = 3020,
    Psm20StateDetachingDeviceFromPortOnOverCurrentClear = 3021,
    Psm20StateDetachingDeviceFromPortOnOverCurrentClearWithTimer = 3022,
    Psm20StateDetachingDeviceFromPortOnOverCurrentWithTimer = 3023,
    Psm20StateDetachingDeviceFromPortOnPortCycle = 3024,
    Psm20StateDetachingDeviceOnCleanup = 3025,
    Psm20StateDetachingDeviceOnDisableAndCycle = 3026,
    Psm20StateDetachingDeviceOnHubReset = 3027,
    Psm20StateDetachingDeviceOnPortCycleWithTimer = 3028,
    Psm20StateDetachingDeviceOnPortDisableAndCycleWithTimer = 3029,
    Psm20StateDisablingOnHubSuspendWithTimer = 3030,
    Psm20StateDisablingPortBeforeConnecting = 3031,
    Psm20StateDisablingPortOnCycle = 3032,
    Psm20StateDisablingPortOnDeviceRequest = 3033,
    Psm20StateDisablingPortOnHubSuspend = 3034,
    Psm20StateDisablingPortOnPortCycleWithTimer = 3035,
    Psm20StateDisablingPortOnTimeOut = 3036,
    Psm20StateDisconnected = 3037,
    Psm20StateErrorOnAcquringReferenceOnHubResume = 3038,
    Psm20StateErrorOnConnectedDisabled = 3039,
    Psm20StateErrorOnConnectedEnabled = 3040,
    Psm20StateErrorOnDisconnected = 3041,
    Psm20StateErrorOnIssuingResetComplete = 3042,
    Psm20StateErrorOnResettingEnabled = 3043,
    Psm20StateErrorOnResettingPort = 3044,
    Psm20StateErrorOnStartingAndAcquiringReferenceOnHubResumeFromDisabled = 3045,
    Psm20StateErrorOnStoppingTimerOnDisconnect = 3046,
    Psm20StateErrorOnStoppingTimerOnOverCurrent = 3047,
    Psm20StateErrorOnStoppingTimerOnOverCurrentClear = 3048,
    Psm20StateErrorOnStoppingTimerOnPortCycle = 3049,
    Psm20StateErrorOnSuspended = 3050,
    Psm20StateErrorOnWaitingForCompanionPort = 3051,
    Psm20StateErrorOnWaitingForDebounce = 3052,
    Psm20StateErrorOnWaitingForDSMResumeResponse = 3053,
    Psm20StateErrorOnWaitingForOldDeviceToCleanup = 3054,
    Psm20StateErrorOnWaitingForOverCurrentClear = 3055,
    Psm20StateErrorOnWaitingForResumeComplete = 3056,
    Psm20StateErrorOnWaitingForResumeTimerToFlush = 3057,
    Psm20StateFlushingStaleDeviceEvents = 3058,
    Psm20StateFlushingUserResetForOverCurrentOnHubStopSuspend = 3059,
    Psm20StateFlushingUserResetForOverCurrentOnOverCurrentClear = 3060,
    Psm20StateInitiatingResetPort = 3061,
    Psm20StateInitiatingResume = 3062,
    Psm20StateIsItBootDevice = 3063,
    Psm20StateIsOldDevicePresent = 3064,
    Psm20StateIssuingAttachDeviceToPort = 3065,
    Psm20StateIssuingDetachDeviceOnCycleFromPoweredOffDisabledOrSuspended = 3066,
    Psm20StateIssuingDisabledToDSMFromDisabled = 3067,
    Psm20StateIssuingHubReset = 3068,
    Psm20StateIssuingHubResetFromDisconnected = 3069,
    Psm20StateIssuingHubResetOnDisableFailure = 3070,
    Psm20StateIssuingHubResetWhenWaitingForDSMResumeResponse = 3071,
    Psm20StateIssuingHubResetWhileHubSuspend = 3072,
    Psm20StateIssuingHubResetWithPendingTimer = 3073,
    Psm20StateIssuingHubResetWithTimer = 3074,
    Psm20StateIssuingHubResetWithTimerOnHubSuspend = 3075,
    Psm20StateIssuingHubResetWithTimerWhileHubSuspend = 3076,
    Psm20StateIssuingPortDisabledToDevice = 3077,
    Psm20StateIssuingPortDisableFailedToDevice = 3078,
    Psm20StateIssuingReAttachDeviceToBootDevice = 3079,
    Psm20StateIssuingResetFailedDuetoPendingHubSuspendToDSMInDisabled = 3080,
    Psm20StateIssuingResetFailedDuetoPendingHubSuspendToDSMInEnabled = 3081,
    Psm20StateIssuingResumedToDeviceSM = 3082,
    Psm20StateIssuingSuspendedToDeviceSM = 3083,
    Psm20StateNotifyingUserAboutPersistentOverCurrent = 3084,
    Psm20StatePoweredOffDisabled = 3085,
    Psm20StatePoweredOffSuspended = 3086,
    Psm20StateQueryingPortStatusOnOverCurrent = 3087,
    Psm20StateQueueingPortFailureToDSMOnSuspend = 3088,
    Psm20StateQueueingPortResumeFailedDueToPendingSuspend = 3089,
    Psm20StateQueueingPortResumeTimedOut = 3090,
    Psm20StateQueueingStateDisabledOnHubResumeFromDisabled = 3091,
    Psm20StateQueueingStateDisabledToDeviceSM = 3092,
    Psm20StateQueueingStateDisabledToDeviceSMOnResetHub = 3093,
    Psm20StateQueueingStateEnabledToDeviceSM = 3094,
    Psm20StateQueueingStateSuspendedToDeviceSM = 3095,
    Psm20StateQueueingStateSuspendedToDeviceSMOnIgnoreError = 3096,
    Psm20StateReleasingInterruptReferenceAndIssuingPortResetTimedOutToDSM = 3097,
    Psm20StateReleasingInterruptReferenceAndStoppingTimer = 3098,
    Psm20StateReleasingInterruptReferenceOnResetTransferFailure = 3099,
    Psm20StateReleasingInterruptReferenceOnSuccessfulReset = 3100,
    Psm20StateReleasingPowerReferenceonPoweredOffDisabled = 3101,
    Psm20StateReleasingPowerReferenceonPoweredOffDisconnected = 3102,
    Psm20StateReleasingResetReferenceOnDeviceRemoval = 3103,
    Psm20StateResettingEnabled = 3104,
    Psm20StateSettingPortPowerOnOverCurrent = 3105,
    Psm20StateStartingAndAcquiringReferenceOnHubResume = 3106,
    Psm20StateStartingAndAcquiringReferenceOnHubResumeFromDisabled = 3107,
    Psm20StateStartingAndAcquiringReferenceOnHubStart = 3108,
    Psm20StateStartingAndAcquiringReferenceOnHubStartFromDisabled = 3109,
    Psm20StateStartingAndAcquiringReferenceOnWarmResume = 3110,
    Psm20StateStartingOverCurrentTimer = 3111,
    Psm20StateStartingResetTimer = 3112,
    Psm20StateStartingResumeTimer = 3113,
    Psm20StateStoppingResumeTimer = 3114,
    Psm20StateStoppingTimerAndQueueingHubResetInDisconnected = 3115,
    Psm20StateStoppingTimerOnDisconnect = 3116,
    Psm20StateStoppingTimerOnHubStopSuspendInDisconnected = 3117,
    Psm20StateStoppingTimerOnOverCurrent = 3118,
    Psm20StateStoppingTimerOnOverCurrentClear = 3119,
    Psm20StateStoppingTimerOnPortCycle = 3120,
    Psm20StateStoppingTimerOnResetComplete = 3121,
    Psm20StateSuspended = 3122,
    Psm20StateSuspending = 3123,
    Psm20StateWaitingForDebounce = 3124,
    Psm20StateWaitingForDisableCompleteOnHubSuspend = 3125,
    Psm20StateWaitingForDisableCompleteWithTimerOnHubSuspend = 3126,
    Psm20StateWaitingForDSMResumeResponse = 3127,
    Psm20StateWaitingForDSMResumeResponseOnHubStop = 3128,
    Psm20StateWaitingForHubStopSuspend = 3129,
    Psm20StateWaitingForHubStopSuspendInDisconnected = 3130,
    Psm20StateWaitingForHubStopSuspendOnAttachFailure = 3131,
    Psm20StateWaitingForHubStopSuspendOrTimer = 3132,
    Psm20StateWaitingForOldDeviceToDetach = 3133,
    Psm20StateWaitingForOverCurrentClear = 3134,
    Psm20StateWaitingForResetComplete = 3135,
    Psm20StateWaitingForResetTimerToFlush = 3136,
    Psm20StateWaitingForResumeComplete = 3137,
    Psm20StateWaitingForResumeTimerToFlush = 3138,
    Psm20StateWaitingForTimerOnResetInDisconnected = 3139,
    Psm20StateWaitingForTimerToFlushOnDisconnect = 3140,
    Psm20StateWaitingForTimerToFlushOnHubStopSuspend = 3141,
    Psm20StateWaitingForTimerToFlushOnHubStopSuspendInDisconnected = 3142,
    Psm20StateWaitingForTimerToFlushOnOverCurrent = 3143,
    Psm20StateWaitingForTimerToFlushOnOverCurrentClear = 3144,
    Psm20StateWaitingForTimerToFlushOnPortCycle = 3145,
    Psm20StateWaitingForUserResetOnOverCurrent = 3146,
    Psm20StateWaitingToBeDeleted = 3147,
    Psm20StateAckingPortChange = 3148,
    Psm20StateCheckIfThereIsAPortChange = 3149,
    Psm20StateCheckIfThereIsAPortChangeOnPortStatus = 3150,
    Psm20StateEnablingInterruptsAndGettingPortEvent = 3151,
    Psm20StateGettingPortStatus = 3152,
    Psm20StateInitializingCumulativePortChangeBits = 3153,
    Psm20StateIssuingHubResetOnControlTransferFailure = 3154,
    Psm20StateQueueingEnableInterruptTransferOnPortChange = 3155,
    Psm20StateWaitingForPortChangeEvent = 3156,
    Psm20StateAcquiringPortReferenceOnStart = 3157,
    Psm20StateGettingPortLostChangesOnStart = 3158,
    Psm20StateGettingPortStatusOnStart = 3159,
    Psm20StateIssuingHubResetOnControlTransferFailureOnStart = 3160,
    Psm20StatePoweringOnPortOnStart = 3161,
    Psm20StateQueueingEnableInterruptTransferOnStart = 3162,
    Psm20StateWaitingForPortPowerOnTimerOnStart = 3163,
    Psm20StateAckingConnectChangeOnResume = 3164,
    Psm20StateAcquiringPortReferenceOnResume = 3165,
    Psm20StateAcquiringPortReferenceOnResumeInFailure = 3166,
    Psm20StateCheckingIfConnectBitChangeSetOnResume = 3167,
    Psm20StateCheckingIfDeviceDisconnectedOnResume = 3168,
    Psm20StateCheckingIfDeviceDisconnectedOnResumeAfterWaiting = 3169,
    Psm20StateEnablingInterruptsWaitingForReconnect = 3170,
    Psm20StateGettingPortLostChangesOnStartOnResume = 3171,
    Psm20StateGettingPortStatusOnResume = 3172,
    Psm20StateGettingPortStatusOnResumeAfterWaiting = 3173,
    Psm20StateIssuingHubResetOnControlTransferFailureOnResume = 3174,
    Psm20StatePoweringOnPortOnResume = 3175,
    Psm20StateQueueingEnableInterruptTransferOnResume = 3176,
    Psm20StateQueueingStateDisabledOnFailure = 3177,
    Psm20StateReturningHubStopOnResume = 3178,
    Psm20StateStartingTimerForAllowingReconnect = 3179,
    Psm20StateStoppingReconnectTimerOnHubStop = 3180,
    Psm20StateWaitingForDeviceToReconnect = 3181,
    Psm20StateWaitingForPortPowerOnTimerOnResume = 3182,
    Psm20StateWaitingForReconnectTimerToFlushOnHubStop = 3183,
    Psm20StateAckingPortChangeInSuspended = 3184,
    Psm20StateCheckIfThereIsAPortChangeAfterInitialGetPortStatusOnSuspended = 3185,
    Psm20StateCheckIfThereIsAPortChangeOnSuspended = 3186,
    Psm20StateGettingPortChangeEventInSuspended = 3187,
    Psm20StateGettingPortStatusInSuspended = 3188,
    Psm20StateInitializingCumulativePortChangeBitsInSuspended = 3189,
    Psm20StateIssuingHubResetOnControlTransferFailureInSuspended = 3190,
    Psm20StateQueueingEnableInterruptTransferOnPortChangeForSuspended = 3191,
    Psm20StateQueueingResumeToDSMFromSuspended = 3192,
    Psm20StateReEnablingInterruptsOnConnectChangeInSuspended = 3193,
    Psm20StateReEnablingInterruptsOnErrorInSuspended = 3194,
    Psm20StateReEnablingInterruptsOnOverCurrentClearedInSuspended = 3195,
    Psm20StateReEnablingInterruptsOnOverCurrentInSuspended = 3196,
    Psm20StateReturningPortConnectChangeFromSuspended = 3197,
    Psm20StateReturningPortErrorFromSuspended = 3198,
    Psm20StateReturningPortOverCurrentClearedFromSuspended = 3199,
    Psm20StateReturningPortOverCurrentFromSuspended = 3200,
    Psm20StateReturningPortResumedFromSuspended = 3201,
    Psm20StateWaitingForPortChangeEventInSuspended = 3202,
    Psm20StateAckingPortChangeInInWaitingForStopSuspend = 3203,
    Psm20StateCheckIfThereIsAPortChangeInInWaitingForStopSuspend = 3204,
    Psm20StateGettingPortStatusInWaitingForStopSuspend = 3205,
    Psm20StateQueueingEnableInterruptTransferInWaitingForStopSuspend = 3206,
    Psm20StateQueueingPortEventFailureToDSM = 3207,
    Psm20StateWaitingForDevicePortEvents = 3208,
    Psm20StateAckingPortChangeInInWaitingForStopSuspendInDisconnected = 3209,
    Psm20StateCheckIfThereIsAPortChangeInInWaitingForStopSuspendInDisconnected = 3210,
    Psm20StateGettingPortStatusInWaitingForStopSuspendInDisconnected = 3211,
    Psm20StateQueueingEnableInterruptTransferInWaitingForStopSuspendInDisconnected = 3212,
    Psm20StateWaitingForDevicePortEventsInDisconnected = 3213
};

enum _PSM30_STATE {
    Psm30StateIgnored = 1000,
    Psm30StateEmptySubState = 1001,
    Psm30StateNull = 1002,
    Psm30StateCompleteWithStatusFailed = 1003,
    Psm30StateRequestPortCycle = 1004,
    Psm30StateSignalQueryDeviceTextEvent = 1005,
    Psm30StateCompleteFDORequestWithStatusFailed = 1006,
    Psm30StateCompleteGetPortStatusWithInternalError = 1007,
    Psm30StateCompleteGetPortStatusWithNoSuchDevice = 1008,
    Psm30StatePoweredOffDisconnected = 5000,
    Psm30StateAcquiringInterruptReferenceOnHSMInDisabled = 5001,
    Psm30StateAcquiringInterruptReferenceOnHSMInEnabled = 5002,
    Psm30StateAcquiringInterruptReferenceOnHSMOnResetRequest = 5003,
    Psm30StateAcquiringInterruptReferenceOnResuming = 5004,
    Psm30StateAcquiringPowerReferenceonPoweredOffConnectedErrorInS0 = 5005,
    Psm30StateAcquiringPowerReferenceonPoweredOffDisconnectedInS0 = 5006,
    Psm30StateAcquiringPowerReferenceonPoweredOffSuspendedInS0 = 5007,
    Psm30StateAcquiringReferenceInConnectedWithResetNeeded = 5008,
    Psm30StateCancellingResetOnSurpriseRemove = 5009,
    Psm30StateCancellingSetPortPower = 5010,
    Psm30StateCheckingIfADeviceIsPresent = 5011,
    Psm30StateCheckingIfLinkStateIsU0 = 5012,
    Psm30StateConnectedEnabled = 5013,
    Psm30StateConnectedError = 5014,
    Psm30StateCreatingDevice = 5015,
    Psm30StateCreatingDeviceInConnectedWithResetInProgress = 5016,
    Psm30StateCreatingDeviceInConnectedWithResetNeeded = 5017,
    Psm30StateDetachingDeviceFromPortOnDisconnect = 5018,
    Psm30StateDetachingDeviceFromPortOnDisconnectOnTimedOut = 5019,
    Psm30StateDetachingDeviceFromPortOnDisconnectWithTimer = 5020,
    Psm30StateDetachingDeviceFromPortOnOverCurrent = 5021,
    Psm30StateDetachingDeviceFromPortOnOverCurrentClear = 5022,
    Psm30StateDetachingDeviceFromPortOnOverCurrentClearOnTimedOut = 5023,
    Psm30StateDetachingDeviceFromPortOnOverCurrentClearWithTimer = 5024,
    Psm30StateDetachingDeviceFromPortOnOverCurrentOnTimedOut = 5025,
    Psm30StateDetachingDeviceFromPortOnOverCurrentWithTimer = 5026,
    Psm30StateDetachingDeviceFromPortOnPortCycle = 5027,
    Psm30StateDetachingDeviceOnCleanup = 5028,
    Psm30StateDetachingDeviceOnHubReset = 5029,
    Psm30StateDisconnected = 5030,
    Psm30StateDoesDeviceSupportsReAttach = 5031,
    Psm30StateDoesDeviceSupportsReAttachWithResetNeeded = 5032,
    Psm30StateFlushingStaleDeviceEvents = 5033,
    Psm30StateFlushingStaleDeviceEventsWithResetInProgress = 5034,
    Psm30StateFlushingStaleDeviceEventsWithResetNeeded = 5035,
    Psm30StateFlushingUserResetForOverCurrentOnHubStopSuspend = 5036,
    Psm30StateFlushingUserResetForOverCurrentOnOverCurrentClear = 5037,
    Psm30StateGettingPortChangeOnStartResumeFromConnectedError = 5038,
    Psm30StateGettingPortStatusOnResetTimeout = 5039,
    Psm30StateGettingPortStatusOnResumeRequest = 5040,
    Psm30StateGettingPortStatusOnResumeTimeout = 5041,
    Psm30StateInitiatingResetPort = 5042,
    Psm30StateInitiatingResume = 5043,
    Psm30StateIsDeviceInU0OnResumeRequest = 5044,
    Psm30StateIsDeviceInU0OnResumeTimeout = 5045,
    Psm30StateIsOldDevicePresent = 5046,
    Psm30StateIsOldDevicePresentInConnectedWithResetNeeded = 5047,
    Psm30StateIsOldDevicePresentWithResetInProgress = 5048,
    Psm30StateIssuingAttachDeviceToDsm = 5049,
    Psm30StateIssuingAttachDeviceWithResetToDsm = 5050,
    Psm30StateIssuingAttachDeviceWithResetToDsmWithResetInProgress = 5051,
    Psm30StateIssuingDetachDeviceOnCycleFromPoweredOffDisabled = 5052,
    Psm30StateIssuingDisabledToDSMFromDisabled = 5053,
    Psm30StateIssuingHubReset = 5054,
    Psm30StateIssuingHubResetFromDisconnected = 5055,
    Psm30StateIssuingHubResetOnDisableFailure = 5056,
    Psm30StateIssuingHubResetOnTimedOut = 5057,
    Psm30StateIssuingHubResetWithPendingTimer = 5058,
    Psm30StateIssuingHubResetWithTimer = 5059,
    Psm30StateIssuingPortDisabledToDevice = 5060,
    Psm30StateIssuingPortDisableFailedToDevice = 5061,
    Psm30StateIssuingReAttachDeviceToBootDevice = 5062,
    Psm30StateIssuingResetFailedDuetoPendingHubSuspendToDSMInDisabled = 5063,
    Psm30StateIssuingResetFailedDuetoPendingHubSuspendToDSMInEnabled = 5064,
    Psm30StateIssuingResetFailedDuetoPendingHubSuspendToDSMWhileResetInProgress = 5065,
    Psm30StateIssuingResumedToDeviceSM = 5066,
    Psm30StateIssuingSuspendedToDeviceSM = 5067,
    Psm30StateNotifyingUserAboutPersistentOverCurrent = 5068,
    Psm30StatePoweredOffConnectedError = 5069,
    Psm30StatePoweredOffConnectedWithResetNeededAndDeviceDetached = 5070,
    Psm30StatePoweredOffSuspended = 5071,
    Psm30StateQueueingPortFailureToDSMOnTransferFailure = 5072,
    Psm30StateQueueingPortResumeFailedDueToPendingSuspend = 5073,
    Psm30StateQueueingPortResumeTimedOut = 5074,
    Psm30StateQueueStateDisabledToDSMOnStartFromConnectedError = 5075,
    Psm30StateReleasingInterruptReferenceAndIssuingPortResetTimedOutToDSM = 5076,
    Psm30StateReleasingInterruptReferenceAndStoppingTimer = 5077,
    Psm30StateReleasingInterruptReferenceOnResetTransferFailure = 5078,
    Psm30StateReleasingInterruptReferenceOnResumed = 5079,
    Psm30StateReleasingInterruptReferenceOnSuccessfulReset = 5080,
    Psm30StateReleasingInterruptReferenceOnTransferFailureInResuming = 5081,
    Psm30StateReleasingPowerReferenceonPoweredOffConnectedWithResetNeeded = 5082,
    Psm30StateReleasingPowerReferenceonPoweredOffDisabled = 5083,
    Psm30StateReleasingPowerReferenceonPoweredOffDisconnected = 5084,
    Psm30StateReleasingResetReferenceInDisconnected = 5085,
    Psm30StateReleasingResetReferenceOnDeviceRemoval = 5086,
    Psm30StateResettingHubAndFlushingUserInitiatedResetOnOverCurrent = 5087,
    Psm30StateSettingPortPowerOnOverCurrent = 5088,
    Psm30StateSettingRemotWakeMask = 5089,
    Psm30StateSettingRemotWakeMaskInDisconected = 5090,
    Psm30StateSettingU1TImeOut = 5091,
    Psm30StateSettingU2TImeOut = 5092,
    Psm30StateStartingAndAcquiringReferenceOnHubStart = 5093,
    Psm30StateStartingAndAcquiringReferenceOnSystemResume = 5094,
    Psm30StateStartingOverCurrentTimer = 5095,
    Psm30StateStartingResetTimer = 5096,
    Psm30StateStartingResumeTimer = 5097,
    Psm30StateStoppingResumeTimer = 5098,
    Psm30StateStoppingTimerAndQueueingHubResetInDisconnected = 5099,
    Psm30StateStoppingTimerOnDisconnect = 5100,
    Psm30StateStoppingTimerOnOverCurrent = 5101,
    Psm30StateStoppingTimerOnOverCurrentClear = 5102,
    Psm30StateStoppingTimerOnResetComplete = 5103,
    Psm30StateSuspended = 5104,
    Psm30StateSuspending = 5105,
    Psm30StateSuspendingPortOnDisableRequest = 5106,
    Psm30StateSuspendingPortOnHubSuspend = 5107,
    Psm30StateWaitingForHubStopSuspend = 5108,
    Psm30StateWaitingForHubStopSuspendInDisconnected = 5109,
    Psm30StateWaitingForHubStopSuspendOnAttachFailure = 5110,
    Psm30StateWaitingForHubStopSuspendOnAttachWithResetFailure = 5111,
    Psm30StateWaitingForHubStopSuspendOrTimer = 5112,
    Psm30StateWaitingForOldDeviceToDetach = 5113,
    Psm30StateWaitingForOldDeviceToDetachInConnectedWithResetNeeded = 5114,
    Psm30StateWaitingForOldDeviceToDetachWithResetInProgress = 5115,
    Psm30StateWaitingForOverCurrentClear = 5116,
    Psm30StateWaitingForResetComplete = 5117,
    Psm30StateWaitingForResetRequestFromDSMWithResetInPorgress = 5118,
    Psm30StateWaitingForResetTimerToFlush = 5119,
    Psm30StateWaitingForResumeComplete = 5120,
    Psm30StateWaitingForResumeTimerToFlush = 5121,
    Psm30StateWaitingForTimerOnResetInDisconnected = 5122,
    Psm30StateWaitingForTimerToFlushOnDisconnect = 5123,
    Psm30StateWaitingForTimerToFlushOnHubStopSuspend = 5124,
    Psm30StateWaitingForTimerToFlushOnHubStopSuspendInDisconnected = 5125,
    Psm30StateWaitingForTimerToFlushOnOverCurrent = 5126,
    Psm30StateWaitingForTimerToFlushOnOverCurrentClear = 5127,
    Psm30StateWaitingForUserResetOnOverCurrent = 5128,
    Psm30StateWaitingToBeDeleted = 5129,
    Psm30StateAckingPortChange = 5130,
    Psm30StateCheckIfThereIsAPortChange = 5131,
    Psm30StateCheckIfThereIsAPortChangeOnGetPortStatus = 5132,
    Psm30StateEnablingInterruptsAndGettingPortEvent = 5133,
    Psm30StateEnablingInterruptsOnFailure = 5134,
    Psm30StateGettingPortStatus = 5135,
    Psm30StateInitializingCumulativePortChangeBits = 5136,
    Psm30StateReturningPortResetHubOnError = 5137,
    Psm30StateAckingPortChangeInNoChange = 5138,
    Psm30StateCheckIfThereIsAPortChangeInNoChange = 5139,
    Psm30StateCheckIfThereIsAPortChangeOnGetPortStatusInNoChange = 5140,
    Psm30StateEnablingInterruptsAndGettingPortEventInNoChange = 5141,
    Psm30StateGettingPortStatusInNoChange = 5142,
    Psm30StateInitializingCumulativePortChangeBitsInNoChange = 5143,
    Psm30StateReturningPortResetHubOnErrorInNoChange = 5144,
    Psm30StateAckingPortChangeOnStartResume = 5145,
    Psm30StateAcquiringPortReferenceAndGettingPortEvent = 5146,
    Psm30StateAcquiringPortReferenceOnFailure = 5147,
    Psm30StateCheckIfThereIsAPortChangeOnStartResume = 5148,
    Psm30StateCheckIfThereIsAPortChangeOnStartResumeOnGetPortStatus = 5149,
    Psm30StateGettingPortStatusOnStartResume = 5150,
    Psm30StateInitializingCumulativePortChangeBitsOnStartResume = 5151,
    Psm30StateReturningPortResetHubOnErrorOnStartResume = 5152,
    Psm30StateGettingPortChange = 5153,
    Psm30StateReturningConnectChangeOnLinkError = 5154,
    Psm30StateReturningPortResetHubOnErrorInPortChangeHandler = 5155,
    Psm30StateWaitingForPortChangeEvent = 5156,
    Psm30StateAcquiringPortReferenceOnTransferFailure = 5157,
    Psm30StateCheckingIfPortIsPoweredOnStart = 5158,
    Psm30StateCheckingIfPowerOnStartHackIsPresent = 5159,
    Psm30StateGettingPortStatusOnStart = 5160,
    Psm30StateGettingPortStatusOnStartBeforePoweringOn = 5161,
    Psm30StatePoweringOnPortOnStart = 5162,
    Psm30StateReturningPortConnectChangeOnLinkErrorOnStart = 5163,
    Psm30StateReturningPortResetHubOnErrorOnStart = 5164,
    Psm30StateWaitingForPortPowerOnTimerOnStart = 5165,
    Psm30StateCheckingIfDeviceIsStillConnectedOnResume = 5166,
    Psm30StateGettingPortStatusOnResume = 5167,
    Psm30StateGettingPortStatusOnResumeAfterWaiting = 5168,
    Psm30StateQueueingStateDisabledOnConnectChangeOnResume = 5169,
    Psm30StateQueueingStateDisabledOnFailure = 5170,
    Psm30StateQueueingStateDisabledOnResetInProgress = 5171,
    Psm30StateQueueingStateEnabledOnResume = 5172,
    Psm30StateQueueingStateSuspendedOnResume = 5173,
    Psm30StateReturningHubStopOnResume = 5174,
    Psm30StateReturningPortConnectChange = 5175,
    Psm30StateReturningPortNeedsResetOnResume = 5176,
    Psm30StateReturningPortOperationSuccessOnResume = 5177,
    Psm30StateReturningPortResetHubOnErrorOnResume = 5178,
    Psm30StateReturningPortResetInProgressOnResume = 5179,
    Psm30StateReturningPortResumedOnResume = 5180,
    Psm30StateStartingTimerForAllowingReconnect = 5181,
    Psm30StateStoppingReconnectTimerOnHubStatusChange = 5182,
    Psm30StateStoppingReconnectTimerOnHubStop = 5183,
    Psm30StateWaitingForDeviceToReconnect = 5184,
    Psm30StateWaitingForReconnectTimerToFlushOnHubStatusChange = 5185,
    Psm30StateWaitingForReconnectTimerToFlushOnHubStop = 5186,
    Psm30StateGettingPortStatusInResuming = 5187,
    Psm30StateReturningConnectChangeOnLinkErrorInResuming = 5188,
    Psm30StateReturningPortResetHubOnErrorInResuming = 5189,
    Psm30StateWaitingForPortChangeEventInResuming = 5190,
    Psm30StateGettingPortStatusInWaitingForStopSuspend = 5191,
    Psm30StateQueueingPortEventFailureToDSM = 5192,
    Psm30StateWaitingForDevicePortEvents = 5193,
    Psm30StateGettingPortStatusInWaitingForStopSuspendInDisconnected = 5194,
    Psm30StateWaitingForDevicePortEventsInDisconnected = 5195,
    Psm30StateCheckingIfLinkIsInU0AfterResetPolling = 5196,
    Psm30StateCheckingIfResetCompletionRequiresPolling = 5197,
    Psm30StateGettingPortStatusInReset = 5198,
    Psm30StateGettingPortStatusInResetAfterPollingInterval = 5199,
    Psm30StateReturningPortResetCompleted = 5200,
    Psm30StateReturningPortResetHubOnErrorInReset = 5201,
    Psm30StateWaitingForPollingIntervalForResetCompletion = 5202,
    Psm30StateWaitingForPortChangeEventInReset = 5203,
    Psm30StateCheckingIfParentHubIsArmedForWake = 5204,
    Psm30StateDisablingRemoteWakeOnPort = 5205,
    Psm30StateEnablingRemoteWakeOnPort = 5206,
    Psm30StateIssuingHubResetOnRemoteWakeMaskFailure = 5207,
    Psm30StateReturningOperationSucessFromArmingForWake = 5208
};

enum _DSM_STATE {
    DsmStateIgnored = 1000,
    DsmStateEmptySubState = 1001,
    DsmStateNull = 1002,
    DsmStateCompleteWithStatusFailed = 1003,
    DsmStateRequestPortCycle = 1004,
    DsmStateSignalQueryDeviceTextEvent = 1005,
    DsmStateCompleteFDORequestWithStatusFailed = 1006,
    DsmStateCompleteGetPortStatusWithInternalError = 1007,
    DsmStateCompleteGetPortStatusWithNoSuchDevice = 1008,
    DsmStateWaitingForPortAttach = 4000,
    DsmStateAcquiringPowerReferenceOnHubOnAttach = 4001,
    DsmStateAcquiringPowerReferenceOnHubStart = 4002,
    DsmStateCheckingForZeroBwPipeOnClientClearStall = 4003,
    DsmStateCheckingForZeroBwPipeOnClientResetPipe = 4004,
    DsmStateCheckingForZeroBwPipeOnClientSyncResetPipe = 4005,
    DsmStateCheckingIfBootDeviceOnD0Exit = 4006,
    DsmStateCheckingIfBootDeviceOnDetach = 4007,
    DsmStateCheckingIfBootDeviceOnReset = 4008,
    DsmStateCheckingIfDeviceShouldBeDisabled = 4009,
    DsmStateCheckingIfItIsIsochronousEndpoint = 4010,
    DsmStateCleaningUpAnyExistingConfigurationOnStart = 4011,
    DsmStateClearingEndpointHaltOnClientClearStall = 4012,
    DsmStateClearingEndpointHaltOnClientResetPipe = 4013,
    DsmStateClearingFailIoFlagOnSuccessfulRecovery = 4014,
    DsmStateCompletingClientRequestInConfigured = 4015,
    DsmStateCompletingClientRequestInConfiguredWithLastStatus = 4016,
    DsmStateCompletingClientRequestInConfiguredWithSpecialFile = 4017,
    DsmStateCompletingClientRequestInUnconfigured = 4018,
    DsmStateCompletingClientRequestInUnConfiguredWithLastStatus = 4019,
    DsmStateCompletingClientRequestOnDetachInDisabled = 4020,
    DsmStateCompletingClientRequestOnFailureInConfigured = 4021,
    DsmStateCompletingClientRequestOnFailureInDisabled = 4022,
    DsmStateCompletingClientRequestOnFailureInUnconfigured = 4023,
    DsmStateCompletingClientUnconfigureRequest = 4024,
    DsmStateCompletingClientUnconfigureRequestWithFailure = 4025,
    DsmStateCompletingD0EntryInConfigured = 4026,
    DsmStateCompletingD0EntryInConfiguredWithSpecialFile = 4027,
    DsmStateCompletingD0EntryInConfiguredWithSpecialFileOnEnumFailure = 4028,
    DsmStateCompletingD0EntryInConfiguredWithSpecialFileOnFailure = 4029,
    DsmStateCompletingD0EntryInUnconfigured = 4030,
    DsmStateCompletingD0ExitAfterHubSuspend = 4031,
    DsmStateCompletingD0ExitOnSuspendFailure = 4032,
    DsmStateCompletingDeviceCleanup = 4033,
    DsmStateCompletingHubStopWithPortOff = 4034,
    DsmStateCompletingPDOCleanupForUnknownDevice = 4035,
    DsmStateCompletingPdoExitFinalOnDetach = 4036,
    DsmStateCompletingPdoExitFinalOnDetachOnDeviceReportedMissing = 4037,
    DsmStateCompletingPnpEventOnDetachInConfigured = 4038,
    DsmStateCompletingPnpEventOnDetachInDisabled = 4039,
    DsmStateCompletingPnpEventOnDetachInUnConfigured = 4040,
    DsmStateCompletingPnpEventOnFailureInDisabledWithPortOff = 4041,
    DsmStateCompletingPnpEventOnFailureInUnconfigured = 4042,
    DsmStateCompletingPnpEventOnFailureWithEndpointsToBeDeleted = 4043,
    DsmStateConfiguredInD0 = 4044,
    DsmStateConfiguredResumingOnHubResume = 4045,
    DsmStateConfiguredSuspended = 4046,
    DsmStateConfiguredSuspendedOnHubSuspend = 4047,
    DsmStateConfiguredSuspendedWithSpecialFile = 4048,
    DsmStateConfiguredSuspending = 4049,
    DsmStateConfiguredSuspendingOnHubSuspend = 4050,
    DsmStateConfiguredSuspendingWithSpecialFile = 4051,
    DsmStateConfiguringDeviceFromCachedInformation = 4052,
    DsmStateConfiguringDeviceFromCachedInformationOnHubResume = 4053,
    DsmStateConfiguringDeviceFromCachedInformationOnResume = 4054,
    DsmStateConfiguringDeviceFromCachedInformationOnResumeWithSpecialFile = 4055,
    DsmStateConfiguringDeviceFromCachedInformationWithSpecialFile = 4056,
    DsmStateConfiguringOnSelectConfiguration = 4057,
    DsmStateDeConfiguringDeviceOnClientRequest = 4058,
    DsmStateDeConfiguringDeviceOnClientRequestFromUnconfigured = 4059,
    DsmStateDeletingDefaultEndpointAndDeviceOnDetachDuringEnum = 4060,
    DsmStateDeletingDeviceAndDefaultEndpointOnCleanup = 4061,
    DsmStateDeletingDeviceAndDefaultEndpointOnCleanupAfterDetach = 4062,
    DsmStateDeletingDeviceAndDefaultEndpointOnCleanupWithPortOff = 4063,
    DsmStateDeletingEndpoinstAndDeviceOnDetachOnCleanup = 4064,
    DsmStateDeletingEndpointsAndDeviceOnOnCleanup = 4065,
    DsmStateDetachedWhileWaitingForBootTimerToFlush = 4066,
    DsmStateDetachedWithResetPending = 4067,
    DsmStateDeviceDetachedWithSpecialFile = 4068,
    DsmStateDisablingBackPortInEnumeratedUnknown = 4069,
    DsmStateDisablingDefaultEndpointAndDeviceOnDetachInBootTimerFlush = 4070,
    DsmStateDisablingDefaultEndpointAndDeviceOnDetachWithSpecialFile = 4071,
    DsmStateDisablingDefaultEndpointAndDeviceOnFailureWithSpecialFile = 4072,
    DsmStateDisablingDeviceAndDefaultEndpointInControllerOnDetachDuringEnum = 4073,
    DsmStateDisablingDeviceAndDefaultEndpointOnResetFailure = 4074,
    DsmStateDisablingDeviceAndDefaultEpInControllerOFailureWithPortOff = 4075,
    DsmStateDisablingDeviceAndDefaultEpInControllerOnCleanupWithPortOff = 4076,
    DsmStateDisablingDeviceAndDefaultEpInControllerOnD0ExitOnDetachWithPDOMissing = 4077,
    DsmStateDisablingDeviceAndDefaultEpInControllerOnDetach = 4078,
    DsmStateDisablingDeviceAndDefaultEpInControllerOnDetachOnHubStopWithPDOMissing = 4079,
    DsmStateDisablingDeviceAndDefaultEpInControllerOnDetachOnPDOCleaupWithPDOMissing = 4080,
    DsmStateDisablingDeviceAndDefaultEpInControllerOnHubStopAfterSuspend = 4081,
    DsmStateDisablingDeviceAndDefaultEpInControllerOnHubStopOnDetach = 4082,
    DsmStateDisablingDeviceInControllerOnCleanup = 4083,
    DsmStateDisablingDeviceInControllerOnDetachOnCleanup = 4084,
    DsmStateDisablingDeviceInControllerOnHubStopFromStoppedEnabled = 4085,
    DsmStateDisablingDeviceInControllerOnHubStopInStopped = 4086,
    DsmStateDisablingDeviceInControllerOnHubStopInSuspended = 4087,
    DsmStateDisablingDeviceInControllerOnPDOStop = 4088,
    DsmStateDisablingEndpointsInControllerOHubStopOnDetach = 4089,
    DsmStateDisablingEndpointsInControllerOnCleanupWithPortOff = 4090,
    DsmStateDisablingEndpointsInControllerOnClientRequest = 4091,
    DsmStateDisablingEndpointsInControllerOnD0ExitOnDetach = 4092,
    DsmStateDisablingEndpointsInControllerOnD0ExitOnDetachWithPDOMissing = 4093,
    DsmStateDisablingEndpointsInControllerOnDetachOnHubStopWithPDOMissing = 4094,
    DsmStateDisablingEndpointsInControllerOnDetachOnPDOCleanupWithPDOMissing = 4095,
    DsmStateDisablingEndpointsInControllerOnFailureWithPortOff = 4096,
    DsmStateDisablingEndpointsInControllerOnHubStopAfterSuspend = 4097,
    DsmStateDisablingEndpointsInControllerOnStop = 4098,
    DsmStateDisablingEndpointsOnDetachInBootTimerFlush = 4099,
    DsmStateDisablingEndpointsOnDetachWithSpecialFile = 4100,
    DsmStateDisablingEndpointsOnFailureWithSpecialFile = 4101,
    DsmStateDisablingPortOnFailureInUnConfigured = 4102,
    DsmStateDisablingPortOnHubStop = 4103,
    DsmStateDisablingPortOnHubStopFromStoppedEnabled = 4104,
    DsmStateDisablingPortOnPdoCleanup = 4105,
    DsmStateDisablingPortOnPDOStop = 4106,
    DsmStateEnumeratedAsFailedUnknown = 4107,
    DsmStateEnumerating = 4108,
    DsmStateFlushingPD0D0ExitFinalInConfigured = 4109,
    DsmStateFlushingPD0D0ExitFinalInUnConfigured = 4110,
    DsmStateGettingMatchingPipeHandleOnClientClearStall = 4111,
    DsmStateGettingMatchingPipeHandleOnClientResetPipe = 4112,
    DsmStateGettingMatchingPipeHandleOnClientSyncResetPipe = 4113,
    DsmStateGettingMsOsExtendedPropertyDescriptors = 4114,
    DsmStateIssuingDeviceDetachedToPSMOnDetach = 4115,
    DsmStateIssuingPortCycleOnFailueWithEndpointsToBeDeleted = 4116,
    DsmStateNotifyingDeviceDisconnectedOnDetach = 4117,
    DsmStateNotifyingDeviceDisconnectedOnDetachWithSpecialFile = 4118,
    DsmStatePreparingEndpointAndInterfaceListsOnClientReset = 4119,
    DsmStatePreparingEndpointAndInterfaceListsOnClientResetWithSpecialFile = 4120,
    DsmStatePreparingEndpointAndInterfaceListsOnResetAfterHubResume = 4121,
    DsmStatePreparingEndpointAndInterfaceListsOnResetAfterResume = 4122,
    DsmStatePreparingEndpointAndInterfaceListsOnResetAfterResumeWithSpecialFile = 4123,
    DsmStatePreparingEndpointAndInterfaceListsOnSelectConfiguration = 4124,
    DsmStatePreparingEndpointAndInterfaceListsOnSelectConfigurationFromConfigured = 4125,
    DsmStatePurgingDeviceIoOnClientResetWithSpecialFile = 4126,
    DsmStatePurgingDeviceIoOnDetachInConfigured = 4127,
    DsmStatePurgingDeviceIoOnHubSuspend = 4128,
    DsmStatePurgingDeviceIoOnHubSuspendFromSuspending = 4129,
    DsmStatePurgingDeviceIoOnPrepareForHibernate = 4130,
    DsmStateQueryingDescriptorForFdoRequestFromConfigured = 4131,
    DsmStateQueryingDescriptorForFdoRequestFromStoppedEnumerated = 4132,
    DsmStateQueryingDescriptorForFdoRequestFromUnConfigured = 4133,
    DsmStateQueryingDeviceTextStringFromConfigured = 4134,
    DsmStateQueryingDeviceTextStringFromStoppedEnumerated = 4135,
    DsmStateQueryingDeviceTextStringFromUnConfigured = 4136,
    DsmStateQueueingAttachFailureToPort = 4137,
    DsmStateQueueingAttachSuccessToPort = 4138,
    DsmStateQueueingDeviceDetachedToPsmForBootDeviceInUnconfigured = 4139,
    DsmStateQueueingDeviceDetachedToPsmForBootDeviceWithResetPending = 4140,
    DsmStateQueueingPrepareForHiberToPSM = 4141,
    DsmStateReAttachedWhileWaitingForBootTimerToFlush = 4142,
    DsmStateReDisablingPortAfterHubResume = 4143,
    DsmStateReEnumeratingOnClientRequestInConfigured = 4144,
    DsmStateReEnumeratingOnClientRequestInConfiguredWithSpecialFile = 4145,
    DsmStateReEnumeratingOnClientRequestInUnconfigured = 4146,
    DsmStateReEnumeratingOnClientRequestOnReattach = 4147,
    DsmStateReEnumeratingOnHubResumeInConfigured = 4148,
    DsmStateReEnumeratingOnHubResumeInUnConfigured = 4149,
    DsmStateReEnumeratingOnHubStart = 4150,
    DsmStateReEnumeratingOnPdoStart = 4151,
    DsmStateReEnumeratingOnPdoStartWhileEnabled = 4152,
    DsmStateReEnumeratingOnResumeInConfigured = 4153,
    DsmStateReEnumeratingOnResumeInConfiguredWithSpecialFile = 4154,
    DsmStateReEnumeratingOnResumeInUnConfigured = 4155,
    DsmStateRegisteringWithHSM = 4156,
    DsmStateReleasingPowerReferenceOnHubOnDetach = 4157,
    DsmStateReleasingPowerReferenceOnHubOnDetachOnEnumSuccess = 4158,
    DsmStateReleasingPowerReferenceOnHubOnEnumerationFailure = 4159,
    DsmStateReleasingPowerReferenceOnHubStopSuspend = 4160,
    DsmStateReleasingPowerReferenceOnPortFailureInHubStopSuspend = 4161,
    DsmStateReleasingPowerReferenceOnSuspendFailureInConfigured = 4162,
    DsmStateReleasingPowerReferenceOnSuspendFailureInUnConfigured = 4163,
    DsmStateRemovingDeviceInfoFromGlobalListOnCleanup = 4164,
    DsmStateRemovingDeviceInfoFromGlobalListOnCleanupOnDetachInConfigured = 4165,
    DsmStateRemovingDeviceInfoFromGlobalListOnCleanupOnDetachInUnConfigured = 4166,
    DsmStateRemovingDeviceInfoFromGlobalListOnCleanUpOnHubStopOnDetach = 4167,
    DsmStateRemovingDeviceInfoFromGlobalListOnDeviceReportedMissing = 4168,
    DsmStateRemovingDeviceInfoFromGlobalListOnReportedMissingOnHubStopOnDetach = 4169,
    DsmStateReportingDeviceMissing = 4170,
    DsmStateReportingDeviceToPnp = 4171,
    DsmStateReportingFailedDeviceAsMissing = 4172,
    DsmStateReportingFailedUnknownDeviceToPnp = 4173,
    DsmStateResettingPipeInUCXOnClientReset = 4174,
    DsmStateResettingPipeInUCXOnClientSyncResetPipe = 4175,
    DsmStateResumingOnHubResumeInStopped = 4176,
    DsmStateSettingConfigurationInformationInClientRequest = 4177,
    DsmStateSettingDeviceInterface = 4178,
    DsmStateSettingInterfaceInformationInClientRequest = 4179,
    DsmStateSettingLPMValuesInConfiguredOnSettingChange = 4180,
    DsmStateSettingLPMValuesInStoppedEnabled = 4181,
    DsmStateSettingLPMValuesInUnConfiguredOnSettingChange = 4182,
    DsmStateShuttingDownSystemOnFailureToRecover = 4183,
    DsmStateSignalingPnpPowerEventOnStop = 4184,
    DsmStateSignalingPnpPowerEventOnStopEnable = 4185,
    DsmStateSignallingPnpEventOnHubSuspendFromUnconfiguredSuspending = 4186,
    DsmStateSignallingPnpEventOnSuspendFailureFromUnconfigured = 4187,
    DsmStateStartBootDeviceResetTimer = 4188,
    DsmStateStartBootDeviceResetTimerInDetached = 4189,
    DsmStateStartBootDeviceResetTimerOnReAttach = 4190,
    DsmStateStartingDeviceIoBeforeRenumeratingOnHubResume = 4191,
    DsmStateStartingDeviceIoOnDeviceResume = 4192,
    DsmStateStartingDeviceIoOnDeviceResumeInUnconfigured = 4193,
    DsmStateStartingDeviceIoOnDeviceResumeWithSpecialFile = 4194,
    DsmStateStartingDeviceIoOnHubResume = 4195,
    DsmStateStopped = 4196,
    DsmStateStoppedEnabled = 4197,
    DsmStateStoppedEnumerated = 4198,
    DsmStateStoppedEnumeratedWithHubSuspended = 4199,
    DsmStateStoppedWithHubSuspended = 4200,
    DsmStateStoppingBootTimer = 4201,
    DsmStateSuspendingOnHubSuspendInStopped = 4202,
    DsmStateUnConfiguredInD0 = 4203,
    DsmStateUnConfiguredResumingOnHubResume = 4204,
    DsmStateUnconfiguredSuspended = 4205,
    DsmStateUnConfiguredSuspendedOnHubSuspend = 4206,
    DsmStateUnconfiguredSuspending = 4207,
    DsmStateUnConfiguredSuspendingOnHubSuspend = 4208,
    DsmStateUnregisteringWithHSMOnDetachAfterCleanup = 4209,
    DsmStateUnregisteringWithHsmOnDetachOnDeviceReportedMissing = 4210,
    DsmStateUnregsiteringWithHsmOnDetach = 4211,
    DsmStateUnregsiteringWithHSMOnDetachOnPDOCleaupWithPDOMissing = 4212,
    DsmStateValidatingSelectConfigUrbFromConfigured = 4213,
    DsmStateValidatingSelectConfigUrbFromUnConfigured = 4214,
    DsmStateValidatingSelectInterfaceUrbFromConfigured = 4215,
    DsmStateWaitingForBootTimerToFlush = 4216,
    DsmStateWaitingForDetachOrRemove = 4217,
    DsmStateWaitingForDetachOrRemoveInConfigured = 4218,
    DsmStateWaitingForDetachOrRemoveInDisabledWithPortOff = 4219,
    DsmStateWaitingForDetachOrRemoveInUnConfigured = 4220,
    DsmStateWaitingForDetachOrRemoveWithPortOff = 4221,
    DsmStateWaitingForDetachOrResetWithDeviceUnPorgrammed = 4222,
    DsmStateWaitingForDetachOrToBeDeleted = 4223,
    DsmStateWaitingForDetachOrToBeDeletedWithPortOff = 4224,
    DsmStateWaitingForDetachWithResetPending = 4225,
    DsmStateWaitingForDisableCompleteOnHubStopFromStoppedEnabled = 4226,
    DsmStateWaitingForPDOD0ExitOnDetachInConfigured = 4227,
    DsmStateWaitingForPDOD0ExitOnDetachInUnConfigured = 4228,
    DsmStateWaitingForPDOReportedMissing = 4229,
    DsmStateWaitingForPortResumeResponseOnStop = 4230,
    DsmStateWaitingForPortResumeResponseOnSuspend = 4231,
    DsmStateWaitingForRemoveOnDetach = 4232,
    DsmStateWaitingForRemoveOrReprotedMissingOnHubStopOnDetach = 4233,
    DsmStateWaitingForReportedMissingOnDetachInConfigured = 4234,
    DsmStateWaitingForReportedMissingOnDetachInUnConfigured = 4235,
    DsmStateWaitingToBeDeleted = 4236,
    DsmStateQueryingLanguageSpecificProductIdString = 4237,
    DsmStateReturningOperationSuccessInQueryingProductId = 4238,
    DsmStateSignalingDeviceQueryTextEvent = 4239,
    DsmStateValidatingLanguageSpecificProductIdString = 4240,
    DsmStateAcquiringAddressZeroOwnershipInEnum = 4241,
    DsmStateAcquiringPowerReferenceOnStartInEnum = 4242,
    DsmStateCancellingAcquiringAddress0OnDetachInEnum = 4243,
    DsmStateCancellingRetryTimerOnDetachInEnum = 4244,
    DsmStateCancellingRetryTimerOnStopSuspendInEnum = 4245,
    DsmStateCheckingIfEnumRetryReachedMaximumInEnum = 4246,
    DsmStateDeletingDefaultEndpointAndDeviceFromUCXOnDetachInEnumeratingAfterAddr = 4247,
    DsmStateDeletingDefaultEndpointAndDeviceFromUCXOnFailureInEnum = 4248,
    DsmStateDeletingDefaultEndpointAndDeviceOnPostAddressFailureInEnum = 4249,
    DsmStateDeletingDefaultEndpointAndDeviceOnStopSuspendAfterAddressInEnum = 4250,
    DsmStateDeletingDeviceAndDefaultEndpointOnDetachWithAddress0OwnershipInEnum = 4251,
    DsmStateDeletingDeviceAndDefaultEndpointOnStopSuspendWithAddress0OwnershipInEnum = 4252,
    DsmStateDisablingDeviceInControllerOnDetachInEnumeratingAfterAddr = 4253,
    DsmStateDisablingDeviceInControllerOnDetachWithAddress0OwnershipInEnum = 4254,
    DsmStateDisablingDeviceInControllerOnPostAddressEnumFailureInEnum = 4255,
    DsmStateDisablingDeviceInControllerOnSetAddressFailureInEnum = 4256,
    DsmStateDisablingDeviceInControllerOnStopSuspendAfterAddressInEnum = 4257,
    DsmStateDisablingDeviceInControllerOnStopSuspendWithAddress0OwnershipInEnum = 4258,
    DsmStateDisablingOnEnumAfterAddressFailure = 4259,
    DsmStateDisablingOnFailureInEnum = 4260,
    DsmStateDisablingOnStopSuspendInEnum = 4261,
    DsmStateDisablingOnStopSuspendInEnumWithAddress0Ownership = 4262,
    DsmStateDisablingOnStopSuspendOnIoctlFailureInEnum = 4263,
    DsmStateEnumeratingAfterAddressInEnum = 4264,
    DsmStateEnumeratingAtAddressZeroInEnum = 4265,
    DsmStateInitializingEnumRetryCountInEnum = 4266,
    DsmStateReleasingAddressZeroOwnershipInEnum = 4267,
    DsmStateReleasingAddressZeroOwnershipOnDetachInEnum = 4268,
    DsmStateReleasingAddressZeroOwnershipOnFailureInEnum = 4269,
    DsmStateReleasingAddressZeroOwnershipOnStopSuspendInEnum = 4270,
    DsmStateReleasingPowerReferenceInEnum = 4271,
    DsmStateReturningOperationFailureInEnum = 4272,
    DsmStateReturningOperationSuccessInEnum = 4273,
    DsmStateReturningPortDetachDeviceInEnum = 4274,
    DsmStateSettingLPMValues = 4275,
    DsmStateSettingNonZeroAddressInEnum = 4276,
    DsmStateStartingTimerForEnumRetryInEnum = 4277,
    DsmStateStoppedSuspendedInEnum = 4278,
    DsmStateUpdatingDeviceInformationInEnum = 4279,
    DsmStateWaitingForDisableCompleteOnStopSuspendInEnum = 4280,
    DsmStateWaitingForDisableCompleteOnStopSuspendInEnumWithAddress0Ownership = 4281,
    DsmStateWaitingForTimerToFlushOnDetachInEnum = 4282,
    DsmStateWaitingForTimerToFlushOnStopSuspendInEnum = 4283,
    DsmStateWaitingForUCXIoctlOnDetachInEnum = 4284,
    DsmStateWaitingForUCXIoctlOnStopSuspendInEnum = 4285,
    DsmStateCheckIfDeviceVersionIs2X = 4286,
    DsmStateCheckingIfFirstEnumTry = 4287,
    DsmStateCreatingUCXDefaultEndpoint = 4288,
    DsmStateCreatingUCXDevice = 4289,
    DsmStateDeletingUCXDefaultEndpointAndDeviceOnDetach = 4290,
    DsmStateDeletingUCXDefaultEndpointAndDeviceOnStop = 4291,
    DsmStateDeletingUCXDefaultEndpointAndDeviceOnSuspend = 4292,
    DsmStateDeletingUCXDefaultEndpointOnOperationFailure = 4293,
    DsmStateDeletingUCXDeviceOnOperationFailure = 4294,
    DsmStateDisablingDeviceInUCXOnDetach = 4295,
    DsmStateDisablingDeviceInUCXOnOperationFailure = 4296,
    DsmStateDisablingDeviceInUCXOnStop = 4297,
    DsmStateDisablingDeviceInUCXOnSuspend = 4298,
    DsmStateDisablingPortOnFailureInEnumAtAddr0 = 4299,
    DsmStateDisablingPortOnHubStopInEnumAtAddr0 = 4300,
    DsmStateDisablingPortOnHubSuspendInEnumAtAddr0 = 4301,
    DsmStateEnablingDeviceInUCX = 4302,
    DsmStateGettingDeviceDescriptorInEnumAtZero = 4303,
    DsmStateNotifyingDeviceResetToUCXAfterReset2 = 4304,
    DsmStateResetting1 = 4305,
    DsmStateResetting2 = 4306,
    DsmStateReturningDeviceOperationFailureInEnumAtZero = 4307,
    DsmStateReturningDeviceOperationSuccessInEnumAtZero = 4308,
    DsmStateReturningHubStopInEnumAtZero = 4309,
    DsmStateReturningHubSuspendInEnumAtZero = 4310,
    DsmStateReturningPortDetachDeviceInEnumAtZero = 4311,
    DsmStateStoppingTimerOnHubStopInEnumAtZero = 4312,
    DsmStateStoppingTimerOnHubSuspendInEnumAtZero = 4313,
    DsmStateStoppingTimerOnPortDetachInEnumAtZero = 4314,
    DsmStateUpdatingDefaultEndpointMaxPacketSizeInEnum = 4315,
    DsmStateValidatingDeviceDescriptorInEnumAtZero = 4316,
    DsmStateWaitingForPortReset1OrDisableOnHubStopInEnumAtZero = 4317,
    DsmStateWaitingForPortReset1OrDisableOnHubSuspendInEnumAtZero = 4318,
    DsmStateWaitingForPortReset2OnHubStopInEnumAtZero = 4319,
    DsmStateWaitingForPortReset2OnHubSuspendInEnumAtZero = 4320,
    DsmStateWaitingForPostReset1Timer = 4321,
    DsmStateWaitingForPostReset2ExtendedTimer = 4322,
    DsmStateWaitingForPostReset2Timer = 4323,
    DsmStateWaitingForStopSuspendOnReset1InEnumAtZero = 4324,
    DsmStateWaitingForStopSuspendOnReset2InEnumAtZero = 4325,
    DsmStateWaitingForTimerOnHubStopInEnumAtZero = 4326,
    DsmStateWaitingForTimerOnHubSuspendInEnumAtZero = 4327,
    DsmStateWaitingForTimerOnPortDetachInEnumAtZero = 4328,
    DsmStateCreatingUCXDefaultEndpointFor30 = 4329,
    DsmStateCreatingUCXDevice30 = 4330,
    DsmStateDeletingUCXDefaultEndpointOnOperationFailureFor30 = 4331,
    DsmStateDeletingUCXDefaultEndpointOnOperationFailureFor30OnDetach = 4332,
    DsmStateDeletingUCXDefaultEndpointOnOperationFailureFor30OnHubStop = 4333,
    DsmStateDeletingUCXDefaultEndpointOnOperationFailureFor30OnHubSuspend = 4334,
    DsmStateDeletingUCXDeviceOnOperationFailureFor30 = 4335,
    DsmStateDeletingUCXDeviceOnOperationFailureFor30OnDetach = 4336,
    DsmStateDeletingUCXDeviceOnOperationFailureFor30OnHubStop = 4337,
    DsmStateDeletingUCXDeviceOnOperationFailureFor30OnHubSuspend = 4338,
    DsmStateDisablingDeviceInUCXFor30 = 4339,
    DsmStateDisablingDeviceInUCXFor30OnDetach = 4340,
    DsmStateDisablingDeviceInUCXFor30OnHubStop = 4341,
    DsmStateDisablingDeviceInUCXFor30OnHubSuspend = 4342,
    DsmStateEnablingDeviceInUCXFor30 = 4343,
    DsmStateResettingDeviceInEnumeration = 4344,
    DsmStateReturningDetachInPreAddressEnumFor30 = 4345,
    DsmStateReturningDeviceOperationFailureInPreAddressEnumFor30 = 4346,
    DsmStateReturningDeviceOperationSuccessInPreAddressEnumFor30 = 4347,
    DsmStateReturningHubStopInPreAddressEnumFor30 = 4348,
    DsmStateReturningHubSuspendInPreAddressEnumFor30 = 4349,
    DsmStateCancellingControlTransferOnDetachInEnumAfterAddr = 4350,
    DsmStateCancellingControlTransferOnHubStopInEnumAfterAddr = 4351,
    DsmStateCancellingControlTransferOnHubSuspendInEnumAfterAddr = 4352,
    DsmStateCheckingBytesReturnedInConfigDescriptor = 4353,
    DsmStateGettingConfigurationDescriptorWithDefaultLength = 4354,
    DsmStateGettingConfigurationDescriptorWithReturnedLength = 4355,
    DsmStateGettingDeviceDescriptorAfterAddressing = 4356,
    DsmStateGettingRemainingDescriptorsAfterConfigDescriptor = 4357,
    DsmStateQueryingRegistryValuesForDevice = 4358,
    DsmStateReturningHubStopInEnumAfterAddr = 4359,
    DsmStateReturningHubSuspendInEnumAfterAddr = 4360,
    DsmStateReturningOperationFailureInEnumAfterAddr = 4361,
    DsmStateReturningOperationSuccessInEnumAfterAddr = 4362,
    DsmStateReturningPortDeviceDetachInEnumAfterAddr = 4363,
    DsmStateSettingVersionFlagInEnumerating = 4364,
    DsmStateValidatingConfigurationDescriptor = 4365,
    DsmStateValidatingDeviceDescriptorAfterAddressing = 4366,
    DsmStateCancellingControlTransferOnDetachInRemainingDescriptors = 4367,
    DsmStateCancellingControlTransferOnHubStopInRemainingDescriptors = 4368,
    DsmStateCancellingControlTransferOnHubSuspendInRemainingDescriptors = 4369,
    DsmStateCheckingIfIProductIsZero = 4370,
    DsmStateGettingBosDescriptorsAndCheckingForSpeedMismatch = 4371,
    DsmStateGettingLanguageIdStringDescriptor = 4372,
    DsmStateGettingMSOSAndSerialNumberDescriptor = 4373,
    DsmStateGettingProductIdStringDescriptor = 4374,
    DsmStateReturningErrorResponseOnLanguageIdQuery = 4375,
    DsmStateReturningErrorResponseOnProductStringQuery = 4376,
    DsmStateReturningHubStopInRemainingDescriptors = 4377,
    DsmStateReturningHubSuspendInRemainingDescriptors = 4378,
    DsmStateReturningOperationFailureInRemainingDescriptors = 4379,
    DsmStateReturningOperationSuccessInRemainingDescriptors = 4380,
    DsmStateReturningPortDeviceDetachInRemainingDescriptors = 4381,
    DsmStateValidatingLanguageIdStringDescriptor = 4382,
    DsmStateValidatingProductIdStringDescriptor = 4383,
    DsmStateCheckingIfDeviceSupportsContainerId = 4384,
    DsmStateCheckingIfIgnoreHWSerNumIsSet = 4385,
    DsmStateCheckingIfMSOSContainerIdDescriptorIsSupported = 4386,
    DsmStateCheckingIfMSOSDescriptorShouldBeQueried = 4387,
    DsmStateCheckingIfMSOSExtendedConfigDescriptorIsSupported = 4388,
    DsmStateCheckingIfSerialNumberStringIndexIsZero = 4389,
    DsmStateGettingMSOSContainerIdDescriptor = 4390,
    DsmStateGettingMSOSContainerIdHeaderDescriptor = 4391,
    DsmStateGettingMSOSDescriptor = 4392,
    DsmStateGettingMSOSExtendedDescriptor = 4393,
    DsmStateGettingMSOSExtendedDescriptorHeader = 4394,
    DsmStateGettingSerialNumberStringDescriptor = 4395,
    DsmStateMarkDeviceAsNotSupportingMSOSDescriptor = 4396,
    DsmStateMarkDeviceAsSupportingMSOSDescriptor = 4397,
    DsmStateMarkingDeviceAsNotSupportingContainerId = 4398,
    DsmStateMarkingDeviceAsNotSupportingContainerIdBasedOnMSOSDescriptor = 4399,
    DsmStateReturningErrorResponseOnContainerIdHeaderQuery = 4400,
    DsmStateReturningErrorResponseOnContainerIdQuery = 4401,
    DsmStateReturningErrorResponseOnMSOSExtendedHeaderQuery = 4402,
    DsmStateReturningErrorResponseOnMSOSExtendedQuery = 4403,
    DsmStateReturningErrorResponseOnMSOSQuery = 4404,
    DsmStateReturningErrorResponseOnSerialNumberQuery = 4405,
    DsmStateReturningOperationFailureInGettingDescriptorsForGreaterThan1x = 4406,
    DsmStateReturningOperationSuccessInGettingDescriptorsForGreaterThan1x = 4407,
    DsmStateValidatingMSOSContainerIdDescriptor = 4408,
    DsmStateValidatingMSOSContainerIdHeaderDescriptor = 4409,
    DsmStateValidatingMSOSDescriptor = 4410,
    DsmStateValidatingMSOSExtendedConfigDescriptor = 4411,
    DsmStateValidatingMSOSExtendedConfigDescriptorHeader = 4412,
    DsmStateValidatingSerialNumberStringDescriptor = 4413,
    DsmStateCheckingIfIgnoreHWSerNumIsSetFor1xDevice = 4414,
    DsmStateCheckingIfSerialNumberStringIndexIsZeroFor1xDevice = 4415,
    DsmStateGettingSerialNumberStringDescriptorFor1xDevice = 4416,
    DsmStateReturningErrorResponseOnSerialNumberQueryFor1xDevice = 4417,
    DsmStateReturningOperationFailureInGettingSerialNumberFor1x = 4418,
    DsmStateReturningOperationSuccessInGettingSerialNumberFor1x = 4419,
    DsmStateValidatingSerialNumberStringDescriptorFor1xDevice = 4420,
    DsmStateReturningHubStopInSettingAddressFor20 = 4421,
    DsmStateReturningHubSuspendInSettingAddressFor20 = 4422,
    DsmStateReturningOperationFailureInSettingAddressFor20 = 4423,
    DsmStateReturningOperationSuccessInSettingAddressFor20 = 4424,
    DsmStateReturningPortDetachDeviceInSettingAddressFor20 = 4425,
    DsmStateSettingNonZeroAddressFor20 = 4426,
    DsmStateStoppingTimerOnHubStopInSettingAddressFor20 = 4427,
    DsmStateStoppingTimerOnHubSuspendInSettingAddressFor20 = 4428,
    DsmStateStoppingTimerOnPortDetachInSettingAddressFor20 = 4429,
    DsmStateWaitingForTimerAfterSetAddress = 4430,
    DsmStateWaitingForTimerOnHubStopInSettingAddressFor20 = 4431,
    DsmStateWaitingForTimerOnHubSuspendInSettingAddressFor20 = 4432,
    DsmStateWaitingForTimerOnPortDetachInSettingAddressFor20 = 4433,
    DsmStateReturningOperationFailureInSettingAddressFor30 = 4434,
    DsmStateReturningOperationSuccessInSettingAddressFor30 = 4435,
    DsmStateSettingNonZeroAddressFor30 = 4436,
    DsmStateCheckingForSuperSpeedRunningAtLowerSpeed = 4437,
    DsmStateCheckingIf2XDeviceRunningAtFullSpeed = 4438,
    DsmStateCheckingIfCompleteBOSDescriptorWasRetrieved = 4439,
    DsmStateCheckingIfDeviceIsSuperSpeedCapable = 4440,
    DsmStateGettingBOSDescriptor = 4441,
    DsmStateGettingBOSDescriptorHeader = 4442,
    DsmStateReturningErrorResponseOnBOSDescriptorHeaderQuery = 4443,
    DsmStateReturningErrorResponseOnBOSDescriptorQuery = 4444,
    DsmStateReturningOperationFailureInGettingBOSDescriptor = 4445,
    DsmStateReturningOperationSuccessInGettingBOSDescriptor = 4446,
    DsmStateValidatingBOSDescriptor = 4447,
    DsmStateValidatingBOSDescriptorHeader = 4448,
    DsmStateGeneratingSpeedNotificationFor30DeviceOn20Port = 4449,
    DsmStateReturningOperationSuccessInCheckingFor30HighSpeed = 4450,
    DsmStateGeneratingSpeedNotificationFor20HighSpeedDevice = 4451,
    DsmStateGettingDeviceQualifierDescriptor = 4452,
    DsmStateReturningErrorResponseOnDeviceQualifierQuery = 4453,
    DsmStateReturningOperationSuccessInCheckingFor20FullSpeed = 4454,
    DsmStateValidatingDeviceQualifierDescriptor = 4455,
    DsmStateAddingDeviceToGlobalChildList = 4456,
    DsmStateAddingDeviceToGlobalChildListAfterDelay = 4457,
    DsmStateCreatingChildPDOAndReportingToPnp = 4458,
    DsmStateDiscardSerialNumber = 4459,
    DsmStateRequestingDeviceCycleInReportingToPnp = 4460,
    DsmStateReturningOperationSuccessInReportingToPnp = 4461,
    DsmStateReturningPortDetachDevice = 4462,
    DsmStateStoppingTimerAndRequestingCycleOnStopSuspend = 4463,
    DsmStateStoppingTimerOnDetachInReportingToPnp = 4464,
    DsmStateWaitingForDetachInReportingToPnp = 4465,
    DsmStateWaitingForDetachOrTimerInReportingToPnp = 4466,
    DsmStateWaitingForDuplicateDeviceToGoAway = 4467,
    DsmStateWaitingForTimerToFlushOnDetachInReportingToPnp = 4468,
    DsmStateCreatingUnknownChildPDOAndReportingToPnp = 4469,
    DsmStateMarkingUnknownDeviceAsFailed = 4470,
    DsmStateRequestingDeviceCycleForUnknownDevice = 4471,
    DsmStateReturningOperationSuccessInReportingUnknownDevice = 4472,
    DsmStateReturningPortDetachDeviceInReportingUnknownDevice = 4473,
    DsmStateAckingResumed = 4474,
    DsmStateAcquiringPowerReferenceInEnabled = 4475,
    DsmStateAcquiringPowerReferenceInSuspended = 4476,
    DsmStateAcquiringPowerReferenceInSuspendedOnResumeWithReset = 4477,
    DsmStateAcquiringPowerReferenceOnHubResume = 4478,
    DsmStateAcquiringPowerReferenceOnHubResumeWithReenumRequired = 4479,
    DsmStateAcquiringPowerReferenceOnHubResumeWtihReset = 4480,
    DsmStateAcquiringPowerReferenceOnResumeInS0 = 4481,
    DsmStateCheckingIfDeviceNeedsResetOnResumeInSxOnEnabled = 4482,
    DsmStateCheckingIfDeviceNeedsResetOnResumeInSxOnSuspended = 4483,
    DsmStateCompletingUnexpectedD0ExitInHubSuspended = 4484,
    DsmStateDisabledOrFailedInHubSuspend = 4485,
    DsmStateDisablingPortOnPortEnabledInPendingHubStop = 4486,
    DsmStateReleasingReferenceOnHubSuspendAfterPSMSyncUp = 4487,
    DsmStateReleasingReferenceOnHubSuspendAfterPSMSyncUpInDisabledOrFailed = 4488,
    DsmStateResumingBeforeResetting = 4489,
    DsmStateReturningDeviceRenumerationOnHubResume = 4490,
    DsmStateReturningDeviceResumedOnHubResume = 4491,
    DsmStateReturningDeviceSuspendedOnHubResume = 4492,
    DsmStateReturningHubStopWithReferenceAcquiredInHubSuspended = 4493,
    DsmStateReturningPortDetach = 4494,
    DsmStateSuspendedInHubSuspend = 4495,
    DsmStateSuspendingPortOnPortEnabledInPendingHubSuspend = 4496,
    DsmStateWaitingForHubResumeInEnabled = 4497,
    DsmStateWaitingForHubResumeInSuspended = 4498,
    DsmStateWaitingForHubResumeWithRenumRequired = 4499,
    DsmStateWaitingForPSMSyncUp = 4500,
    DsmStateWaitingForPSMSyncUpOnPendingStop = 4501,
    DsmStateWaitingForPSMSyncUpOnPendingSuspend = 4502,
    DsmStateWaitingForPSMSyncUpOnResumeWithReset = 4503,
    DsmStateWaitingForResumeResponseFromPortOnHubStop = 4504,
    DsmStateWaitingForResumeResponseFromPortOnHubSuspend = 4505,
    DsmStateAcquiringAddressZeroOwnershipOnRenum = 4506,
    DsmStateAcquiringAddressZeroOwnershipOnRenumDuringResetInConfigured = 4507,
    DsmStateAcquiringAddressZeroOwnershipOnRenumDuringResetInUnConfigured = 4508,
    DsmStateAcquiringPowerReferenceOnStartInReEnum = 4509,
    DsmStateCancellingAcquiringAddress0OnDetachOnRenum = 4510,
    DsmStateCancellingRetryTimerOnDetachOnRenum = 4511,
    DsmStateCancellingRetryTimerOnStopSuspendOnRenum = 4512,
    DsmStateCheckingIfDevicePorgrammingWasLosttInConfigured = 4513,
    DsmStateCheckingIfDevicePorgrammingWasLosttInUnconfigured = 4514,
    DsmStateCheckingIfEnumRetryReachedMaximumOnRenum = 4515,
    DsmStateCheckingIfRequestConfigDescOnResetIsSet = 4516,
    DsmStateComparingDeviceOnReEnumeration = 4517,
    DsmStateDeconfiguringEndpointsInControllerOnAddressOOwnershipFailure = 4518,
    DsmStateDeconfiguringEndpointsInControllerOnDetachForResetRenumOnFailure = 4519,
    DsmStateDeconfiguringEndpointsInControllerOnDetachOnForResetRenum = 4520,
    DsmStateDeconfiguringEndpointsInControllerOnStopSuspendForResetRenum = 4521,
    DsmStateDeconfiguringEndpointsInControllerOnStopSuspendOnRenumWithAddress0Ownership = 4522,
    DsmStateDisablingAllEndpointsOnLostProgramming = 4523,
    DsmStateDisablingDeviceAndDefaultEndpointOnLostProgramming = 4524,
    DsmStateDisablingDeviceInControllerOnDetachForResetRenumOnFailure = 4525,
    DsmStateDisablingDeviceInControllerOnDetachOnForResetRenum = 4526,
    DsmStateDisablingDeviceInControllerOnDetachOnRenum = 4527,
    DsmStateDisablingDeviceInControllerOnFailureAfterAddressOnRenum = 4528,
    DsmStateDisablingDeviceInControllerOnSetAddressFailureOnRenum = 4529,
    DsmStateDisablingDeviceInControllerOnStopSuspendOnRenum = 4530,
    DsmStateDisablingDeviceInControllerOnStopSuspendOnRenumWithAddress0Ownership = 4531,
    DsmStateDisablingOnFailureOnRenumWithAddress0Ownership = 4532,
    DsmStateDisablingOnStopSuspendOnRenum = 4533,
    DsmStateDisablingOnStopSuspendOnRenumWithAddress0Ownership = 4534,
    DsmStateDisablingPortOnFailureInRenum = 4535,
    DsmStateEnablingDeviceInControllerInRenum = 4536,
    DsmStateEnumeratingAtAddressZeroOnRenum = 4537,
    DsmStateGettingConfigDescriptorWhileRenuemrating = 4538,
    DsmStateGettingDeviceDescriptorOnRenum = 4539,
    DsmStateInitializingEnumRetryCountInReEnumDuringResetInConfigured = 4540,
    DsmStateInitializingEnumRetryCountInReEnumDuringResetInUnConfigured = 4541,
    DsmStateInitializingEnumRetryCountInReEnumDuringRestart = 4542,
    DsmStateReleasingAddressZeroOwnershipOnDetachOnRenum = 4543,
    DsmStateReleasingAddressZeroOwnershipOnFailureOnRenum = 4544,
    DsmStateReleasingAddressZeroOwnershipOnRenum = 4545,
    DsmStateReleasingAddressZeroOwnershipOnStopSuspendOnRenum = 4546,
    DsmStateReleasingPowerReferenceOnRenum = 4547,
    DsmStateReturningOperationFailureOnRenum = 4548,
    DsmStateReturningOperationSuccessOnRenum = 4549,
    DsmStateReturningPortDetachDeviceOnRenum = 4550,
    DsmStateSettingLPMValuesInReEnum = 4551,
    DsmStateSettingNonZeroAddressOnRenum = 4552,
    DsmStateStartingTimerForEnumRetryOnRenum = 4553,
    DsmStateStoppedSuspendedOnRenum = 4554,
    DsmStateWaitingForDisableCompleteOnStopSuspendOnRenumWithAddress0Ownership = 4555,
    DsmStateWaitingForPortResponseOnStopSuspend = 4556,
    DsmStateWaitingForTimerToFlushOnDetachOnRenum = 4557,
    DsmStateWaitingForTimerToFlushOnStopSuspendOnRenum = 4558,
    DsmStateWaitingForUCXIoctlOnDetachForResetInConfiguredRenum = 4559,
    DsmStateWaitingForUCXIoctlOnDetachForResetInUnconfiguredRenum = 4560,
    DsmStateWaitingForUCXIoctlOnDetachOnRenum = 4561,
    DsmStateWaitingForUCXIoctlOnStopSuspend = 4562,
    DsmStateWaitingForUCXIoctlOnStopSuspendForResetRenumInConfigured = 4563,
    DsmStateWaitingForUCXIoctlOnStopSuspendForResetRenumInUnconfigured = 4564,
    DsmStateCheckingIfAnyAlternateInterfaceLeft = 4565,
    DsmStateConfiguringDevice = 4566,
    DsmStateCreatingNewEndpoints = 4567,
    DsmStateDeconfiguringEndpointsInControllerForDeviceConfigurationOnFailure = 4568,
    DsmStateDeletingEndpointsForOldConfigurationOnFailure = 4569,
    DsmStateDeletingEndpointsForOldConfigurationOnSuccess = 4570,
    DsmStateGettingDeviceStatusForRemoteWake = 4571,
    DsmStateProgrammingEndpointsInControllerForDeviceConfiguration = 4572,
    DsmStateReturningOperationFailureInReConfiguring = 4573,
    DsmStateReturningOperationSuccessInReConfiguring = 4574,
    DsmStateSettingDeviceInterfaceInConfiguring = 4575,
    DsmStateSettingLPMTimeoutsInConfiguring = 4576,
    DsmStateDisablingPortOnHubSuspendInCleanup = 4577,
    DsmStateFlushingHubPowerDownEvents = 4578,
    DsmStateFlushingHubPowerUpEvents = 4579,
    DsmStateFlushingPnpEvents = 4580,
    DsmStateReleasingPowerReferenceOnHubSuspendInCleanup = 4581,
    DsmStateReturningPortDisabledOnHubSuspendInCleanup = 4582,
    DsmStateWaitingForDevicePortEvents = 4583,
    DsmStateFlushingHubPowerDownEventsWithPortOff = 4584,
    DsmStateFlushingHubPowerUpEventsWithPortOff = 4585,
    DsmStateFlushingPnpEventsWithPortOff = 4586,
    DsmStateWaitingForDevicePortEventsWithPortOff = 4587,
    DsmStateFlushingHubStartResumeEvent = 4588,
    DsmStateFlushingHubSuspendEvent = 4589,
    DsmStateFlushingPnpEventExceptStop = 4590,
    DsmStateWaitingForDevicePortEventsExceptStop = 4591,
    DsmStateFlushingHubResumeEventForBootDevice = 4592,
    DsmStateFlushingHubSuspendEventForBootDevice = 4593,
    DsmStateFlushingPnpEventsForBootDevice = 4594,
    DsmStateWaitingForDeviceHubEventsForBootDevice = 4595,
    DsmStateAckingPortResumed = 4596,
    DsmStateCheckingIfDeviceArmedForWakeOnResume = 4597,
    DsmStateCheckingIfDeviceNeedsResetOnResumeInS0 = 4598,
    DsmStateClearingResetOnLastResumeFlagOnPDO = 4599,
    DsmStateCompletingD0EntryOnDetach = 4600,
    DsmStateCompletingD0EntryOnPortFailure = 4601,
    DsmStateDisablingPortOnStopFromSuspended = 4602,
    DsmStateDisarmingDeviceForWakeOnD0Entry = 4603,
    DsmStateDisarmingDeviceForWakeOnPortResumed = 4604,
    DsmStateResumingFromSelectiveSuspend = 4605,
    DsmStateReturningDetachDevice = 4606,
    DsmStateReturningDeviceResumed = 4607,
    DsmStateReturningHubStopFromSuspended = 4608,
    DsmStateReturningPortFailureOnResume = 4609,
    DsmStateReturningRenumerateDeviceOnResume = 4610,
    DsmStateSettingResetOnLastResumeFlagForPDO = 4611,
    DsmStateSuspended = 4612,
    DsmStateSuspendedWithHubSuspended = 4613,
    DsmStateSuspendingBackUnarmedDevice = 4614,
    DsmStateSuspendingWakeArmedDeviceOnHubSuspend = 4615,
    DsmStateWaitingForD0EntryOnHwWake = 4616,
    DsmStateWaitingForD0EntryOnPendingRenumerate = 4617,
    DsmStateWaitingForSuspendCompleteOnHubSuspend = 4618,
    DsmStateArmingDeviceForWake = 4619,
    DsmStateCheckingIfDeviceArmedForWakeOnSuspending = 4620,
    DsmStateCompletingWaitWakeOnDetachDuringSuspending = 4621,
    DsmStateCompletingWaitWakeOnSuspendFailure = 4622,
    DsmStatePurgingDeviceIoInSuspending = 4623,
    DsmStatePurgingDeviceIoInSuspendingAfterArmingForWake = 4624,
    DsmStatePurgingDeviceIoInSuspendingAfterArmingForWakeFailure = 4625,
    DsmStateReturningOperationFailureInSuspending = 4626,
    DsmStateReturningOperationSuccessInSuspending = 4627,
    DsmStateReturningPortDetachDeviceInSuspending = 4628,
    DsmStateReturningUnexpectedHubSuspendInSuspending = 4629,
    DsmStateSuspending = 4630,
    DsmStateSuspendingPortOnFailureInSuspending = 4631,
    DsmStateSuspendingWithArmedForWake = 4632,
    DsmStateWaitingForPortResponseOnHubSuspend = 4633,
    DsmStateCreatingNewEndpointsInSettingInterface = 4634,
    DsmStateDeletingEndpointsForNewInterfaceOnFailure = 4635,
    DsmStateDeletingEndpointsForOldInterfaceOnFailure = 4636,
    DsmStateDeletingEndpointsForOldInterfaceOnSuccess = 4637,
    DsmStateDisablingEndpointsForTheCurrentInterface = 4638,
    DsmStatePreparingEndpointAndInterfaceListsOnSelectInterface = 4639,
    DsmStateProgrammingEndpointsInControllerInSettingInterface = 4640,
    DsmStateReturningOperationFailureInSettingInterface = 4641,
    DsmStateReturningOperationSuccessInSettingInterface = 4642,
    DsmStateSettingDeviceInterfaceInSettingInterface = 4643,
    DsmStateSettingLPMTimeoutsInSettingInterface = 4644,
    DsmStateCheckingIfDeviceSpeedChanged = 4645,
    DsmStateCheckingIfFirstEnumTryInRenum = 4646,
    DsmStateGettingDeviceDescriptorInReEnumAtZero = 4647,
    DsmStateNotifyingDeviceResetToUCXAfterReset1InRenum = 4648,
    DsmStateNotifyingDeviceResetToUCXAfterReset2InRenum = 4649,
    DsmStateResetting1InRenum = 4650,
    DsmStateResetting2InRenum = 4651,
    DsmStateReturningDeviceOperationFailureInReEnumAtZero = 4652,
    DsmStateReturningDeviceOperationSuccessInReEnumAtZero = 4653,
    DsmStateReturningHubStopInReEnumAtZero = 4654,
    DsmStateReturningHubSuspendInReEnumAtZero = 4655,
    DsmStateReturningPortDetachDeviceInReEnumAtZero = 4656,
    DsmStateStoppingTimerOnHubStopInReEnumAtZero = 4657,
    DsmStateStoppingTimerOnHubSuspendInReEnumAtZero = 4658,
    DsmStateStoppingTimerOnPortDetachInReEnumAtZero = 4659,
    DsmStateValidatingDeviceDescriptorInReEnumAtZero = 4660,
    DsmStateWaitingForPortResetOnHubStopInReEnumAtZero = 4661,
    DsmStateWaitingForPortResetOnHubSuspendInReEnumAtZero = 4662,
    DsmStateWaitingForPostReset1TimerInRenum = 4663,
    DsmStateWaitingForPostReset2ExtendedTimerInRenum = 4664,
    DsmStateWaitingForPostReset2TimerInRenum = 4665,
    DsmStateWaitingForStopSuspendOnReset1InReEnumAtZero = 4666,
    DsmStateWaitingForTimerOnHubStopInReEnumAtZero = 4667,
    DsmStateWaitingForTimerOnHubSuspendInReEnumAtZero = 4668,
    DsmStateWaitingForTimerOnPortDetachInReEnumAtZero = 4669,
    DsmStateCheckingIfFirstReEnumTryFor30Device = 4670,
    DsmStateCheckingIfForceResetOnReEnumerationFlagIsSet = 4671,
    DsmStateNotifyingDeviceResetToUCXInResettingFor30 = 4672,
    DsmStateNotifyingDeviceResetToUCXInResettingFor30WithNoPortReset = 4673,
    DsmStateResettingInResettingFor30 = 4674,
    DsmStateReturningDeviceOperationFailureInResettingFor30 = 4675,
    DsmStateReturningDeviceOperationSuccessInInResettingFor30 = 4676,
    DsmStateReturningHubStopInResettingFor30 = 4677,
    DsmStateReturningHubSuspendInResettingFor30 = 4678,
    DsmStateReturningPortDetachDeviceInResettingFor30 = 4679,
    DsmStateWaitingForPortResetOnHubStopInResettingFor30 = 4680,
    DsmStateWaitingForPortResetOnHubSuspendInResettingFor30 = 4681,
    DsmStateWaitingForStopSuspendOnReset1InResettingFor30 = 4682,
    DsmStateAllocatingBufferForMsOsExtendedPropertyDescriptor = 4683,
    DsmStateCheckingIfMSOSExtendedPropertyDescriptorShouldBeQueried = 4684,
    DsmStateFreeingBufferAllocatedForMSOSExtendedProperty = 4685,
    DsmStateFreeingBufferAllocatedForMSOSExtendedPropertyOnFailure = 4686,
    DsmStateGettingMSOSExtendedPropertyDescriptor = 4687,
    DsmStateGettingMSOSExtendedPropertyDescriptorHeader = 4688,
    DsmStateReturningDeviceOperationFailureInGettingMsOsExtendedProperty = 4689,
    DsmStateReturningDeviceOperationSuccessInGettingMsOsExtendedProperty = 4690,
    DsmStateSettingExtPropDescSemaphoreRegistryFlag = 4691,
    DsmStateValidatingMSOSExtendedPropertyDescriptor = 4692,
    DsmStateValidatingMSOSExtendedPropertyDescriptorHeader = 4693,
    DsmStateWritingCustomPropertiesInRegistry = 4694,
    DsmStateCheckingIfSetSelFailureShouldBeIgnored = 4695,
    DsmStateReturningOperationFailureInSettingLPMValues = 4696,
    DsmStateReturningOperationSuccessInSettingLPMValues = 4697,
    DsmStateSettingSEL = 4698,
    DsmStateSetttingIsochDelay = 4699,
    DsmStateComputingAndUpdatingU1TimeoutValue = 4700,
    DsmStateComputingAndUpdatingU2TimeoutValue = 4701,
    DsmStateDisablingU1 = 4702,
    DsmStateDisablingU2 = 4703,
    DsmStateEnablingU1 = 4704,
    DsmStateEnablingU2 = 4705,
    DsmStateReturningOperationSuccessInUpdatingLPMValues = 4706,
    DsmStateUpdatingDeviceStatusToU1Disabled = 4707,
    DsmStateUpdatingDeviceStatusToU1Enabled = 4708,
    DsmStateUpdatingDeviceStatusToU2Disabled = 4709,
    DsmStateUpdatingDeviceStatusToU2Enabled = 4710,
    DsmStateComputingLPMTimeoutValuesInUnconfigured = 4711,
    DsmStateReturningOperationSuccessInUpdatingLPMValuesInUnconfigured = 4712,
    DsmStateGettingRemoteWakeCapability = 4713,
    DsmStateReturningOperationFailureInGettingRemoteWakeCap = 4714,
    DsmStateReturningOperationSuccessInGettingRemoteWakeCap = 4715,
    DsmStateValidatingInterfaceStatusForRemoteWake = 4716
};

struct _STATE {
    unsigned long  StateAsUlong; /*  +0x0000  */
    /* unsigned char GenericState[0];  +0x0000 f1 1a 00 00  */
    /* unsigned char HsmState[0];  +0x0000 f3 1a 00 00  */
    /* unsigned char Psm20State[0];  +0x0000 f5 1a 00 00  */
    /* unsigned char Psm30State[0];  +0x0000 f7 1a 00 00  */
    unsigned char DsmState[4]; /*  +0x0000 f9 1a 00 00  */
};

struct _USBHUB3_TRIAGE_INFO {
    unsigned long  Version; /*  +0x0000  */
    unsigned long  ConfigurationDescriptorOffset; /*  +0x0004  */
    unsigned long  HubControlRequestWdfRequestOffset; /*  +0x0008  */
    unsigned long  ControlRequestIrpOffset; /*  +0x000c  */
    unsigned long  HubFdoDeviceOffset; /*  +0x0010  */
    unsigned long  ControlWdfRequestOffset; /*  +0x0014  */
    unsigned long  StatusChangeInterruptWdfRequestOffset; /*  +0x0018  */
    unsigned long  HubContextSize; /*  +0x001c  */
    unsigned long  ConfigurationDescriptorSize; /*  +0x0020  */
    unsigned long  HubControlRequestSize; /*  +0x0024  */
    unsigned long  RootHub30PortInfoArrayOffset; /*  +0x0028  */
    unsigned long  RootHub30PortInfoCountOffset; /*  +0x002c  */
    unsigned long  RootHub30PortInfoCountSize; /*  +0x0030  */
    unsigned long  RootHub30PortInfoSize; /*  +0x0034  */
    unsigned long  RootHub20PortInfoArrayOffset; /*  +0x0038  */
    unsigned long  RootHub20PortInfoCountOffset; /*  +0x003c  */
    unsigned long  RootHub20PortInfoCountSize; /*  +0x0040  */
    unsigned long  RootHub20PortInfoSize; /*  +0x0044  */
    unsigned long  PSMListHeadOffset; /*  +0x0048  */
    unsigned long  PortContextSize; /*  +0x004c  */
    unsigned long  PortContextOffset; /*  +0x0050  */
    unsigned long  PortContextIfrLogOffset; /*  +0x0054  */
    unsigned long  DSMListHeadOffset; /*  +0x0058  */
    unsigned long  DeviceContextOffset; /*  +0x005c  */
    unsigned long  DevicePdoContextOffset; /*  +0x0060  */
    unsigned long  DeviceCurrentConfigurationOffset; /*  +0x0064  */
    unsigned long  DeviceOldDeviceConfigurationOffset; /*  +0x0068  */
    unsigned long  DeviceNextInterfaceToSetOffset; /*  +0x006c  */
    unsigned long  DeviceOldInterfaceOffset; /*  +0x0070  */
    unsigned long  DeviceNewInterfaceOffset; /*  +0x0074  */
    unsigned long  DeviceEndPointsToBeEnabledOffset; /*  +0x0078  */
    unsigned long  DeviceEndPointsToBeDisabledOffset; /*  +0x007c  */
    unsigned long  DeviceEndPointsToRemainUnchangedOffset; /*  +0x0080  */
    unsigned long  DeviceUcxEndPointArrayCountOffset; /*  +0x0084  */
    unsigned long  DeviceControlRequestOffset; /*  +0x0088  */
    unsigned long  DeviceWdfUcxRequestOffset; /*  +0x008c  */
    unsigned long  DeviceUcxRequestIrpOffset; /*  +0x0090  */
    unsigned long  DeviceWdfUcxIoctlRequestMemoryOffset; /*  +0x0094  */
    unsigned long  DeviceWdfCurrentClientRequestOffset; /*  +0x0098  */
    unsigned long  DeviceWdfDeviceInitOffset; /*  +0x009c  */
    unsigned long  DeviceCurrentTargetPipeOffset; /*  +0x00a0  */
    unsigned long  DeviceDescriptorOffset; /*  +0x00a4  */
    unsigned long  DeviceCompatIdInterfaceDescriptorOffset; /*  +0x00a8  */
    unsigned long  DeviceConfigurationDescriptorOffset; /*  +0x00ac  */
    unsigned long  DeviceLanguageIdDescriptorOffset; /*  +0x00b0  */
    unsigned long  DeviceProductIdStringDescriptorOffset; /*  +0x00b4  */
    unsigned long  DeviceDeviceQualifierDescriptorOffset; /*  +0x00b8  */
    unsigned long  DeviceBOSDescriptorOffset; /*  +0x00bc  */
    unsigned long  DeviceMsExtConfigDescOffset; /*  +0x00c0  */
    unsigned long  DeviceMsExtPropertyDescOffset; /*  +0x00c4  */
    unsigned long  DevicePdoAssociatedContextOffset; /*  +0x00c8  */
    unsigned long  DevicePdoIdleIrpOffset; /*  +0x00cc  */
    unsigned long  DevicePdoWakeNotificationOffset; /*  +0x00d0  */
    unsigned long  DeviceContextSize; /*  +0x00d4  */
    unsigned long  DevicePdoContextSize; /*  +0x00d8  */
    unsigned long  DeviceEndPointSizeOfCountFieldOffset; /*  +0x00dc  */
    unsigned long  DeviceControlRequestSize; /*  +0x00e0  */
    unsigned long  IrpSize; /*  +0x00e4  */
    unsigned long  PipeHandleSize; /*  +0x00e8  */
    unsigned long  UsbInterfaceDescriptorSize; /*  +0x00ec  */
    unsigned long  UsbStringDescriptorSize; /*  +0x00f0  */
    unsigned long  UsbDeviceQualifierDescriptorSize; /*  +0x00f4  */
    unsigned long  BOSDescriptorSize; /*  +0x00f8  */
    unsigned long  MsExtConfigDescSize; /*  +0x00fc  */
    unsigned long  MsExtPropDescSize; /*  +0x0100  */
    unsigned long  DeviceConfigurationSize; /*  +0x0104  */
    unsigned long  UsbEndpointDescriptorSize; /*  +0x0108  */
    unsigned long  DeviceUsbConfigurationDescriptorSize; /*  +0x010c  */
    unsigned long  ConInterfaceListOffset; /*  +0x0110  */
    unsigned long  ConDeviceConfigurationDescriptorOffset; /*  +0x0114  */
    unsigned long  InterfaceHandleSize; /*  +0x0118  */
    unsigned long  DeviceConfigurationInterfaceListOffset; /*  +0x011c  */
    unsigned long  IfHNumOfEndpointsOffset; /*  +0x0120  */
    unsigned long  IfHPipeHandleOffset; /*  +0x0124  */
    unsigned long  IfHNumOfEndpointsSize; /*  +0x0128  */
    unsigned long  IfHInterfaceLinkOffset; /*  +0x012c  */
    unsigned long  IfHInterfaceDescriptorOffset; /*  +0x0130  */
    unsigned long  PiHEndpointDescriptorOffset; /*  +0x0134  */
    unsigned long  PipeHandleUcxEndpointOffset; /*  +0x0138  */
    unsigned long  IfrLogHeaderOffset; /*  +0x013c  */
    unsigned long  IfrLogHeaderSize; /*  +0x0140  */
    unsigned long  IfrLogSizeOffset; /*  +0x0144  */
    unsigned long  IfrSizeOfLogSizeField; /*  +0x0148  */
    unsigned long  IfrDriverContextOffset; /*  +0x014c  */
    unsigned long  IfrDriverContextSize; /*  +0x0150  */
    void *GlobalDriverObjectPtr; /*  +0x0154  */
    void *WppGlobalControlPtr; /*  +0x0158  */
    unsigned long  WppGlobalControlSize; /*  +0x015c  */
};

struct _USB_BUS_INTERFACE_USBDI_V3 {
    unsigned short  Size; /*  +0x0000  */
    unsigned short  Version; /*  +0x0002  */
    void *BusContext; /*  +0x0004  */
    unsigned char InterfaceReference[4]; /*  +0x0008 7e 10 00 00  */
    unsigned char InterfaceDereference[4]; /*  +0x000c 7e 10 00 00  */
    unsigned char GetUSBDIVersion[4]; /*  +0x0010 02 1b 00 00  */
    unsigned char QueryBusTime[4]; /*  +0x0014 05 1b 00 00  */
    unsigned char SubmitIsoOutUrb[4]; /*  +0x0018 08 1b 00 00  */
    unsigned char QueryBusInformation[4]; /*  +0x001c 0b 1b 00 00  */
    unsigned char IsDeviceHighSpeed[4]; /*  +0x0020 0d 1b 00 00  */
    unsigned char EnumLogEntry[4]; /*  +0x0024 10 1b 00 00  */
    unsigned char QueryBusTimeEx[4]; /*  +0x0028 05 1b 00 00  */
    unsigned char QueryControllerType[4]; /*  +0x002c 13 1b 00 00  */
};

struct _WHEA_ERROR_PACKET_FLAGS {
    /* unsigned char PreviousError[0];  +0x0000 96 18 00 00  */
    /* unsigned char Reserved1[0];  +0x0000 16 1b 00 00  */
    /* unsigned char HypervisorError[0];  +0x0000 17 1b 00 00  */
    /* unsigned char Simulated[0];  +0x0000 18 1b 00 00  */
    /* unsigned char PlatformPfaControl[0];  +0x0000 19 1b 00 00  */
    /* unsigned char PlatformDirectedOffline[0];  +0x0000 1a 1b 00 00  */
    /* unsigned char Reserved2[0];  +0x0000 1b 1b 00 00  */
    unsigned long  AsULONG; /*  +0x0000  */
};

struct _URB_SELECT_INTERFACE {
    unsigned char Hdr[16]; /*  +0x0000 79 18 00 00  */
    void *ConfigurationHandle; /*  +0x0010  */
    unsigned char Interface[36]; /*  +0x0014 1e 1b 00 00  */
};

struct _WHEA_REVISION {
    unsigned char  MinorRevision; /*  +0x0000  */
    unsigned char  MajorRevision; /*  +0x0001  */
    unsigned short  AsUSHORT; /*  +0x0000  */
};

enum _DSM_EVENT {
    DsmEventNull = 1000,
    DsmEventContinueIfNoSubState = 1001,
    DsmEventBootResetTimerFired = 4007,
    DsmEventClientRequestCycle = 4011,
    DsmEventClientRequestIdle = 4015,
    DsmEventClientRequestReset = 4019,
    DsmEventClientRequestResetPipe = 4023,
    DsmEventClientRequestSelectConfiguration = 4027,
    DsmEventClientRequestSelectNullConfiguration = 4031,
    DsmEventClientRequestSetInterface = 4035,
    DsmEventClientRequestSyncClearStall = 4039,
    DsmEventClientRequestSyncResetPipe = 4043,
    DsmEventDeviceDisableUState = 4009,
    DsmEventDeviceEnableUState = 4013,
    DsmEventDeviceFailEnumeration = 4017,
    DsmEventDeviceIgnoreError = 4021,
    DsmEventDeviceRenumerateOnHubResume = 4025,
    DsmEventDeviceResumed = 4029,
    DsmEventDeviceResumedOnHubResume = 4033,
    DsmEventDeviceRetryEnum = 4037,
    DsmEventDeviceSuspendedOnHubResume = 4041,
    DsmEventFDORequestGetDescriptor = 4047,
    DsmEventHubResume = 4006,
    DsmEventHubResumeInS0 = 4010,
    DsmEventHubResumeWithReset = 4014,
    DsmEventHubStart = 4018,
    DsmEventHubStop = 4022,
    DsmEventHubStopAfterSuspend = 4026,
    DsmEventHubStopWithReferenceAcquired = 4045,
    DsmEventHubSuspend = 4030,
    DsmEventLPMPowerSettingChange = 4051,
    DsmEventNo = 4049,
    DsmEventOperationFailure = 4053,
    DsmEventOperationPending = 4057,
    DsmEventOperationSuccess = 4061,
    DsmEventPDOCleanup = 4055,
    DsmEventPDOD0Entry = 4059,
    DsmEventPDOD0Exit = 4063,
    DsmEventPDOD0ExitFinal = 4067,
    DsmEventPDOPrepareForHibernation = 4071,
    DsmEventPDOReportedMissing = 4075,
    DsmEventPortAttachDevice = 4034,
    DsmEventPortDetachDevice = 4038,
    DsmEventPortDisabled = 4042,
    DsmEventPortDisabledOnHubSuspend = 4065,
    DsmEventPortFailed = 4046,
    DsmEventPortReAttachDevice = 4050,
    DsmEventPortResetComplete = 4054,
    DsmEventPortResetFailedDueToPendingSuspend = 4058,
    DsmEventPortResetTimedOut = 4062,
    DsmEventPortResumed = 4066,
    DsmEventPortResumeFailedDueToPendingSuspend = 4070,
    DsmEventPortResumeTimedOut = 4074,
    DsmEventPortStateDisabled = 4078,
    DsmEventPortStateEnabled = 4082,
    DsmEventPortStateEnabledOnReconnect = 4086,
    DsmEventPortStateSuspended = 4090,
    DsmEventPortSuspended = 4094,
    DsmEventQueryDeviceText = 4079,
    DsmEventTimerFired = 4098,
    DsmEventTransferFailure = 4004,
    DsmEventTransferSuccess = 4008,
    DsmEventUCXIoctlFailure = 4012,
    DsmEventUCXIoctlSuccess = 4016,
    DsmEventYes = 4069
};

struct _WHEA_ERROR_RECORD_HEADER {
    unsigned long  Signature; /*  +0x0000  */
    unsigned char Revision[2]; /*  +0x0004 bb 11 00 00  */
    unsigned long  SignatureEnd; /*  +0x0006  */
    unsigned short  SectionCount; /*  +0x000a  */
    unsigned char Severity[4]; /*  +0x000c ab 11 00 00  */
    unsigned char ValidBits[4]; /*  +0x0010 28 1b 00 00  */
    unsigned long  Length; /*  +0x0014  */
    unsigned char Timestamp[8]; /*  +0x0018 29 1b 00 00  */
    unsigned char PlatformId[16]; /*  +0x0020 fe 10 00 00  */
    unsigned char PartitionId[16]; /*  +0x0030 fe 10 00 00  */
    unsigned char CreatorId[16]; /*  +0x0040 fe 10 00 00  */
    unsigned char NotifyType[16]; /*  +0x0050 fe 10 00 00  */
    unsigned long long  RecordId; /*  +0x0060  */
    unsigned char Flags[4]; /*  +0x0068 2a 1b 00 00  */
    unsigned char PersistenceInfo[8]; /*  +0x006c 2b 1b 00 00  */
    unsigned char Reserved[12]; /*  +0x0074 2c 1b 00 00  */
};

enum _EVENT_PRIORITY {
    EventPriorityCritical = 0,
    EventPrioritySync = 1,
    EventPriorityNormal = 2,
    EventPriorityLow = 3
};

struct _DRIVER_EXTENSION {
    unsigned char DriverObject[4]; /*  +0x0000 49 11 00 00  */
    unsigned char AddDevice[4]; /*  +0x0004 34 1b 00 00  */
    unsigned long  Count; /*  +0x0008  */
    unsigned char ServiceKeyName[8]; /*  +0x000c 2e 10 00 00  */
};

enum _WDF_STATE_NOTIFICATION_TYPE {
    StateNotificationInvalid = 0,
    StateNotificationEnterState = 1,
    StateNotificationPostProcessState = 2,
    StateNotificationLeaveState = 4,
    StateNotificationAllStates = 7
};

/* struct <unnamed-tag> {
    unsigned char CurrentState[4];  +0x0000 bc 13 00 00 
    unsigned char NewState[4];  +0x0004 bc 13 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned char CurrentState[4];  +0x0000 bc 13 00 00 
}; */

/* struct <unnamed-tag> {
    /* unsigned char EnterState[0];  +0x0000 3a 1b 00 00 
    /* unsigned char PostProcessState[0];  +0x0000 3c 1b 00 00 
    unsigned char LeaveState[8];  +0x0000 3a 1b 00 00 
}; */

struct _WDF_DEVICE_POWER_NOTIFICATION_DATA {
    unsigned char Type[4]; /*  +0x0000 38 1b 00 00  */
    unsigned char Data[8]; /*  +0x0004 3e 1b 00 00  */
};

struct _SID {
    unsigned char  Revision; /*  +0x0000  */
    unsigned char  SubAuthorityCount; /*  +0x0001  */
    unsigned char IdentifierAuthority[6]; /*  +0x0002 41 1b 00 00  */
    unsigned char SubAuthority[4]; /*  +0x0008 42 1b 00 00  */
};

enum _USER_ACTIVITY_PRESENCE {
    PowerUserPresent = 0,
    PowerUserNotPresent = 1,
    PowerUserInactive = 2,
    PowerUserMaximum = 3,
    PowerUserInvalid = 3
};

struct _USB_DEVICE_QUALIFIER_DESCRIPTOR {
    unsigned char  bLength; /*  +0x0000  */
    unsigned char  bDescriptorType; /*  +0x0001  */
    unsigned short  bcdUSB; /*  +0x0002  */
    unsigned char  bDeviceClass; /*  +0x0004  */
    unsigned char  bDeviceSubClass; /*  +0x0005  */
    unsigned char  bDeviceProtocol; /*  +0x0006  */
    unsigned char  bMaxPacketSize0; /*  +0x0007  */
    unsigned char  bNumConfigurations; /*  +0x0008  */
    unsigned char  bReserved; /*  +0x0009  */
};

struct _USB_DEVICE_CAPABILITY_CONTAINER_ID_DESCRIPTOR {
    unsigned char  bLength; /*  +0x0000  */
    unsigned char  bDescriptorType; /*  +0x0001  */
    unsigned char  bDevCapabilityType; /*  +0x0002  */
    unsigned char  bReserved; /*  +0x0003  */
    unsigned char ContainerID[16]; /*  +0x0004 49 1b 00 00  */
};

struct _GENERAL_LOOKASIDE {
    /* unsigned char ListHead[0];  +0x0000 5c 10 00 00  */
    unsigned char SingleListHead[8]; /*  +0x0000 29 10 00 00  */
    unsigned short  Depth; /*  +0x0008  */
    unsigned short  MaximumDepth; /*  +0x000a  */
    unsigned long  TotalAllocates; /*  +0x000c  */
    unsigned long  AllocateMisses; /*  +0x0010  */
    unsigned long  AllocateHits; /*  +0x0010  */
    unsigned long  TotalFrees; /*  +0x0014  */
    unsigned long  FreeMisses; /*  +0x0018  */
    unsigned long  FreeHits; /*  +0x0018  */
    unsigned char Type[4]; /*  +0x001c 6a 10 00 00  */
    unsigned long  Tag; /*  +0x0020  */
    unsigned long  Size; /*  +0x0024  */
    /* unsigned char AllocateEx[0];  +0x0028 6d 10 00 00  */
    unsigned char Allocate[4]; /*  +0x0028 7b 10 00 00  */
    /* unsigned char FreeEx[0];  +0x002c 72 10 00 00  */
    unsigned char Free[4]; /*  +0x002c 7e 10 00 00  */
    unsigned char ListEntry[8]; /*  +0x0030 17 10 00 00  */
    unsigned long  LastTotalAllocates; /*  +0x0038  */
    unsigned long  LastAllocateMisses; /*  +0x003c  */
    unsigned long  LastAllocateHits; /*  +0x003c  */
    unsigned char Future[8]; /*  +0x0040 4c 1b 00 00  */
};

struct _IO_COMPLETION_CONTEXT {
    void *Port; /*  +0x0000  */
    void *Key; /*  +0x0004  */
};

struct _PSM_MUX_CONTEXT {
    unsigned char ListEntry[8]; /*  +0x0000 17 10 00 00  */
    unsigned char PortFlags[4]; /*  +0x0008 51 1b 00 00  */
};

struct _DSM_MUX_CONTEXT {
    unsigned char ListEntry[8]; /*  +0x0000 17 10 00 00  */
    unsigned char TempListEntry[8]; /*  +0x0008 17 10 00 00  */
    unsigned char SurpriseRemoveListEntry[8]; /*  +0x0010 17 10 00 00  */
    unsigned char DeviceFlags[4]; /*  +0x0018 54 1b 00 00  */
};

struct _SID_IDENTIFIER_AUTHORITY {
    unsigned char Value[6]; /*  +0x0000 57 1b 00 00  */
};

struct _HUB_PARENT_INTERFACE {
    unsigned short  Size; /*  +0x0000  */
    unsigned short  Version; /*  +0x0002  */
    void *Context; /*  +0x0004  */
    unsigned char InterfaceReference[4]; /*  +0x0008 7e 10 00 00  */
    unsigned char InterfaceDereference[4]; /*  +0x000c 7e 10 00 00  */
    unsigned char  HubDepth; /*  +0x0010  */
    unsigned char Hub[4]; /*  +0x0014 c5 18 00 00  */
    unsigned char HubSpeed[4]; /*  +0x0018 62 1a 00 00  */
    unsigned char WasHubResetOnResume[4]; /*  +0x001c 0d 1b 00 00  */
    unsigned char WasDeviceProgrammingLostOnResume[4]; /*  +0x0020 0d 1b 00 00  */
    void *ConnectorId; /*  +0x0024  */
    unsigned short  First30PortToMap; /*  +0x0028  */
    unsigned short  Last30PortToMap; /*  +0x002a  */
    unsigned char GetHubSymbolicLinkName[4]; /*  +0x002c 5c 1b 00 00  */
    unsigned char HubTopologyAddress[32]; /*  +0x0030 5d 1b 00 00  */
    void *HubFdoContext; /*  +0x0050  */
};

struct _URB_CONTROL_VENDOR_OR_CLASS_REQUEST {
    unsigned char Hdr[16]; /*  +0x0000 79 18 00 00  */
    void *Reserved; /*  +0x0010  */
    unsigned long  TransferFlags; /*  +0x0014  */
    unsigned long  TransferBufferLength; /*  +0x0018  */
    void *TransferBuffer; /*  +0x001c  */
    unsigned char TransferBufferMDL[4]; /*  +0x0020 90 10 00 00  */
    unsigned char UrbLink[4]; /*  +0x0024 78 18 00 00  */
    unsigned char hca[32]; /*  +0x0028 ae 1a 00 00  */
    unsigned char  RequestTypeReservedBits; /*  +0x0048  */
    unsigned char  Request; /*  +0x0049  */
    unsigned short  Value; /*  +0x004a  */
    unsigned short  Index; /*  +0x004c  */
    unsigned short  Reserved1; /*  +0x004e  */
};

struct _USBD_VERSION_INFORMATION {
    unsigned long  USBDI_Version; /*  +0x0000  */
    unsigned long  Supported_USB_Version; /*  +0x0004  */
};

enum _ISM_STATE {
    IsmStateIgnored = 1000,
    IsmStateNull = 1001,
    IsmStateCompleteWithStatusDeviceBusy = 1002,
    IsmStateCompleteWithStatusNoSuchDevice = 1003,
    IsmStateStartState = 6000,
    IsmStateCallbackCompleted = 6001,
    IsmStateCheckingIfSSIsEnabled = 6002,
    IsmStateCompletingIdleIrpWithStatusCancelled = 6003,
    IsmStateCompletingIdleIrpWithStatusCancelledInSSDisabled = 6004,
    IsmStateCompletingIdleIrpWithStatusInvalidDeviceState = 6005,
    IsmStateCompletingIdleIrpWithStatusSuccess = 6006,
    IsmStateCompletingRequestWithStatusDeviceGone = 6007,
    IsmStateIdleRequestPendingWithSSDisabled = 6008,
    IsmStateInvokingClientCallback = 6009,
    IsmStateMarkingRequestCancellable = 6010,
    IsmStateMarkingRequestCancellableInSSDisabled = 6011,
    IsmStateNoIdleRequest = 6012,
    IsmStateNoIdleRequestWithSelectiveSuspendDisabled = 6013,
    IsmStatePDORemoved = 6014,
    IsmStateQueuingWorkerItem = 6015,
    IsmStateStoringRequestInSSDisabled = 6016,
    IsmStateStoringRequestInSSEnabled = 6017,
    IsmStateUnMarkingRequestAsCancelable = 6018,
    IsmStateUnMarkingRequestCancellable = 6019,
    IsmStateUnMarkingRequestCancellableOnD0 = 6020,
    IsmStateWaitingForCallbackComplete = 6021,
    IsmStateWaitingForCallbackOnCancellation = 6022,
    IsmStateWaitingForCallbackOnD0 = 6023,
    IsmStateWaitingForCallbackOnD3 = 6024,
    IsmStateWaitingForCallbackOnRemove = 6025,
    IsmStateWaitingForCancellation = 6026,
    IsmStateWaitingForCancellationOnRemove = 6027,
    IsmStateWaitingForWorkerItem = 6028
};

enum _HSM_EVENT {
    HsmEventNull = 1000,
    HsmEventContinueIfNoSubState = 1001,
    HsmEventConfigurationFailure = 2006,
    HsmEventConfigurationSuccess = 2010,
    HsmEventDevicePowerReferencesAcquired = 2014,
    HsmEventDevicePowerReferencesReleased = 2018,
    HsmEventFDOD0Entry = 2007,
    HsmEventFDOD0EntryFromSx = 2011,
    HsmEventFDOD0Exit = 2015,
    HsmEventFDOD0ExitFinal = 2019,
    HsmEventFDODeviceAdd = 2023,
    HsmEventFDODeviceCleanup = 2027,
    HsmEventFDOPrepareHardware = 2031,
    HsmEventFDOReleaseHardware = 2035,
    HsmEventHubConfigurationFailure = 2009,
    HsmEventHubConfigurationSuccess = 2013,
    HsmEventHubError = 2022,
    HsmEventHubFatalError = 2017,
    HsmEventHubIgnoreError = 2021,
    HsmEventHubLocalPowerGood = 2025,
    HsmEventHubLocalPowerLost = 2029,
    HsmEventHubOverCurrent = 2033,
    HsmEventHubOverCurrentCleared = 2037,
    HsmEventInterruptTransferFailure = 2026,
    HsmEventInterruptTransferSuccess = 2030,
    HsmEventIoctlFailure = 2034,
    HsmEventIoctlSuccess = 2038,
    HsmEventNo = 2041,
    HsmEventOperationFailure = 2045,
    HsmEventOperationPending = 2049,
    HsmEventOperationSuccess = 2053,
    HsmEventPDORequestGetPortStatus = 2039,
    HsmEventPortEnableInterruptTransfer = 2042,
    HsmEventPortInterruptReferencesReleased = 2046,
    HsmEventPortPowerReferencesAcquired = 2050,
    HsmEventPortPowerReferencesReleased = 2054,
    HsmEventPortResetReferencesReleased = 2058,
    HsmEventPrepareForUpStreamReset = 2043,
    HsmEventResetHub = 2047,
    HsmEventResetHubComplete = 2062,
    HsmEventResetHubFailed = 2066,
    HsmEventResetHubFailedOnRemoval = 2070,
    HsmEventResetRegistrationComplete = 2074,
    HsmEventResetUnregistrationComplete = 2078,
    HsmEventTimerFired = 2082,
    HsmEventTransferFailure = 2004,
    HsmEventTransferSuccess = 2008,
    HsmEventUpstreamResetComplete = 2086,
    HsmEventYes = 2057
};

struct _ACPI_PLD_BUFFER {
    /* unsigned char Revision[0];  +0x0000 68 1b 00 00  */
    /* unsigned char IgnoreColor[0];  +0x0000 69 1b 00 00  */
    unsigned char Color[4]; /*  +0x0000 6a 1b 00 00  */
    /* unsigned char Width[0];  +0x0004 6b 1b 00 00  */
    unsigned char Height[4]; /*  +0x0004 6c 1b 00 00  */
    /* unsigned char UserVisible[0];  +0x0008 96 18 00 00  */
    /* unsigned char Dock[0];  +0x0008 16 1b 00 00  */
    /* unsigned char Lid[0];  +0x0008 17 1b 00 00  */
    /* unsigned char Panel[0];  +0x0008 6d 1b 00 00  */
    /* unsigned char VerticalPosition[0];  +0x0008 6e 1b 00 00  */
    /* unsigned char HorizontalPosition[0];  +0x0008 6f 1b 00 00  */
    /* unsigned char Shape[0];  +0x0008 70 1b 00 00  */
    /* unsigned char GroupOrientation[0];  +0x0008 71 1b 00 00  */
    /* unsigned char GroupToken[0];  +0x0008 72 1b 00 00  */
    /* unsigned char GroupPosition[0];  +0x0008 73 1b 00 00  */
    unsigned char Bay[4]; /*  +0x0008 74 1b 00 00  */
    /* unsigned char Ejectable[0];  +0x000c 96 18 00 00  */
    /* unsigned char EjectionRequired[0];  +0x000c 16 1b 00 00  */
    /* unsigned char CabinetNumber[0];  +0x000c 75 1b 00 00  */
    /* unsigned char CardCageNumber[0];  +0x000c 76 1b 00 00  */
    unsigned char Reserved[4]; /*  +0x000c 77 1b 00 00  */
};

struct _OS_STRING {
    unsigned char  bLength; /*  +0x0000  */
    unsigned char  bDescriptorType; /*  +0x0001  */
    unsigned char MicrosoftString[14]; /*  +0x0002 7a 1b 00 00  */
    unsigned char  bVendorCode; /*  +0x0010  */
    unsigned char  bPad; /*  +0x0011  */
    unsigned char  bFlags; /*  +0x0011  */
};

enum _ISM_POSTLOCK_ACTION {
    IsmPostLockActionNone = 0,
    IsmPostLockActionCompleteIrpWithStatusCancelled = 1,
    IsmPostLockActionCompleteIrpWithStatusDeviceBusy = 2,
    IsmPostLockActionCompleteIrpWithStatusNoSuchDevice = 3,
    IsmPostLockActionCompleteIrpWithStatusInvalidDeviceState = 4,
    IsmPostLockActionCompleteIrpWithStatusSuccess = 5,
    IsmPostLockActionInvokeClientCallback = 6,
    IsmPostLockActionQueueWorkItem = 7
};

struct _ISM_CONTEXT {
    unsigned char StateHistory[128]; /*  +0x0000 7e 1b 00 00  */
    unsigned char  StateHistoryIndex; /*  +0x0080  */
    unsigned long  StateMachineLock; /*  +0x0084  */
    unsigned char CurrentState[4]; /*  +0x0088 65 1b 00 00  */
    unsigned char StateTable[4]; /*  +0x008c 80 1b 00 00  */
    unsigned long  StartIndex; /*  +0x0090  */
    unsigned char IdleIrp[4]; /*  +0x0094 a4 10 00 00  */
    unsigned char PostLockAction[4]; /*  +0x0098 82 1b 00 00  */
    unsigned char IdleWorker[4]; /*  +0x009c b4 14 00 00  */
};

struct _URB_CONTROL_TRANSFER {
    unsigned char Hdr[16]; /*  +0x0000 79 18 00 00  */
    void *PipeHandle; /*  +0x0010  */
    unsigned long  TransferFlags; /*  +0x0014  */
    unsigned long  TransferBufferLength; /*  +0x0018  */
    void *TransferBuffer; /*  +0x001c  */
    unsigned char TransferBufferMDL[4]; /*  +0x0020 90 10 00 00  */
    unsigned char UrbLink[4]; /*  +0x0024 78 18 00 00  */
    unsigned char hca[32]; /*  +0x0028 ae 1a 00 00  */
    unsigned char SetupPacket[8]; /*  +0x0048 c6 11 00 00  */
};

enum _DRIVER_RUNTIME_INIT_FLAGS {
    DrvRtPoolNxOptIn = 1,
    LastDrvRtFlag = 2
};

enum _PSM_EVENT {
    PsmEventNull = 1000,
    PsmEventContinueIfNoSubState = 1001,
    PsmEventDeviceDetached = 3006,
    PsmEventDevicePrepareForHibernation = 3007,
    PsmEventDeviceRequestCycle = 3011,
    PsmEventDeviceRequestDisable = 3015,
    PsmEventDeviceRequestReset = 3019,
    PsmEventDeviceRequestResume = 3023,
    PsmEventDeviceRequestSuspend = 3027,
    PsmEventDeviceSetU1Timeout = 3031,
    PsmEventDeviceSetU2Timeout = 3035,
    PsmEventHubReset = 3010,
    PsmEventHubResume = 3014,
    PsmEventHubResumeInS0 = 3018,
    PsmEventHubResumeWithReset = 3022,
    PsmEventHubStart = 3026,
    PsmEventHubStatusChange = 3030,
    PsmEventHubStop = 3034,
    PsmEventHubSurpriseRemove = 3038,
    PsmEventHubSuspend = 3042,
    PsmEventNo = 3005,
    PsmEventObjectCleanup = 3046,
    PsmEventOperationFailure = 3009,
    PsmEventOperationSuccess = 3013,
    PsmEventPortConnectChange = 3017,
    PsmEventPortCycleOnError = 3021,
    PsmEventPortDisableAndCycleOnError = 3025,
    PsmEventPortDisabled = 3029,
    PsmEventPortEnabledOnConnectError = 3033,
    PsmEventPortEnabledWhileResetError = 3037,
    PsmEventPortError = 3041,
    PsmEventPortErrorWithChange = 3045,
    PsmEventPortIgnoreError = 3049,
    PsmEventPortLinkStateError = 3053,
    PsmEventPortNeedsReset = 3057,
    PsmEventPortNoChange = 3061,
    PsmEventPortOverCurrent = 3065,
    PsmEventPortOverCurrentCleared = 3069,
    PsmEventPortResetComplete = 3073,
    PsmEventPortResetHubOnError = 3077,
    PsmEventPortResetInProgress = 3081,
    PsmEventPortResetPollingTimerFired = 3004,
    PsmEventPortResumed = 3085,
    PsmEventTimerFired = 3050,
    PsmEventTransferFailure = 3008,
    PsmEventTransferSuccess = 3012,
    PsmEventUserInitiatedResetOnOverCurrent = 3054,
    PsmEventYes = 3089
};

struct _ISM_STATE_LOG {
    unsigned char Event[4]; /*  +0x0000 d3 1a 00 00  */
    unsigned char State[4]; /*  +0x0004 65 1b 00 00  */
};

struct _USBD_ISO_PACKET_DESCRIPTOR {
    unsigned long  Offset; /*  +0x0000  */
    unsigned long  Length; /*  +0x0004  */
    long  Status; /*  +0x0008  */
};

struct _USB_DEVICE_PROPERTIES {
    /* unsigned char DeviceReservedUXD[0];  +0x0000 96 18 00 00  */
    /* unsigned char DeviceIsHub[0];  +0x0000 16 1b 00 00  */
    /* unsigned char DeviceIsKnown[0];  +0x0000 17 1b 00 00  */
    /* unsigned char DeviceIsComposite[0];  +0x0000 18 1b 00 00  */
    /* unsigned char DeviceAttachSuccessful[0];  +0x0000 19 1b 00 00  */
    /* unsigned char DeviceResetOnEnumRequired[0];  +0x0000 1a 1b 00 00  */
    /* unsigned char ContainerIdValid[0];  +0x0000 8f 1b 00 00  */
    /* unsigned char BOSContainerIdValid[0];  +0x0000 69 1b 00 00  */
    /* unsigned char DeviceNotRemovable[0];  +0x0000 90 1b 00 00  */
    /* unsigned char SerialNumber[0];  +0x0000 91 1b 00 00  */
    /* unsigned char MsOsDescriptorNotSupported[0];  +0x0000 92 1b 00 00  */
    /* unsigned char UsbWakeupSupport[0];  +0x0000 93 1b 00 00  */
    /* unsigned char ConfigurationIsValid[0];  +0x0000 94 1b 00 00  */
    /* unsigned char ExtPropertyInstalled[0];  +0x0000 95 1b 00 00  */
    /* unsigned char DeviceSupportsSelectiveSuspend[0];  +0x0000 71 1b 00 00  */
    /* unsigned char DeviceIsSuperSpeedCapable[0];  +0x0000 96 1b 00 00  */
    /* unsigned char DeviceReprogrammingPending[0];  +0x0000 97 1b 00 00  */
    /* unsigned char ActivityIdSetForDsmRequests[0];  +0x0000 98 1b 00 00  */
    /* unsigned char WdfActivityIdValid[0];  +0x0000 99 1b 00 00  */
    /* unsigned char WdfPowerReferenceHeldOnFdo[0];  +0x0000 9a 1b 00 00  */
    /* unsigned char SlowestLinkForU1Exit[0];  +0x0000 9b 1b 00 00  */
    /* unsigned char SlowestLinkForU2Exit[0];  +0x0000 9c 1b 00 00  */
    /* unsigned char U1Enabled[0];  +0x0000 9d 1b 00 00  */
    unsigned char U2Enabled[4]; /*  +0x0000 9e 1b 00 00  */
};

struct _CM_RESOURCE_LIST {
    unsigned long  Count; /*  +0x0000  */
    unsigned char List[32]; /*  +0x0004 a2 1b 00 00  */
};

struct _PORT_MUX_FLAGS {
    /* unsigned char PortChangePending[0];  +0x0000 96 18 00 00  */
    /* unsigned char InterruptReferenceHeld[0];  +0x0000 16 1b 00 00  */
    /* unsigned char PnpOperationPending[0];  +0x0000 17 1b 00 00  */
    /* unsigned char PowerReferenceHeld[0];  +0x0000 18 1b 00 00  */
    /* unsigned char ResetPending[0];  +0x0000 19 1b 00 00  */
    unsigned char WdfPowerReferenceHeld[4]; /*  +0x0000 1a 1b 00 00  */
};

struct _CM_FULL_RESOURCE_DESCRIPTOR {
    unsigned char InterfaceType[4]; /*  +0x0000 45 14 00 00  */
    unsigned long  BusNumber; /*  +0x0004  */
    unsigned char PartialResourceList[24]; /*  +0x0008 a7 1b 00 00  */
};

struct _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS {
    /* unsigned char Primary[0];  +0x0000 96 18 00 00  */
    /* unsigned char ContainmentWarning[0];  +0x0000 16 1b 00 00  */
    /* unsigned char Reset[0];  +0x0000 17 1b 00 00  */
    /* unsigned char ThresholdExceeded[0];  +0x0000 18 1b 00 00  */
    /* unsigned char ResourceNotAvailable[0];  +0x0000 19 1b 00 00  */
    /* unsigned char LatentError[0];  +0x0000 1a 1b 00 00  */
    /* unsigned char Reserved[0];  +0x0000 1b 1b 00 00  */
    unsigned long  AsULONG; /*  +0x0000  */
};

struct _POWER_SEQUENCE {
    unsigned long  SequenceD1; /*  +0x0000  */
    unsigned long  SequenceD2; /*  +0x0004  */
    unsigned long  SequenceD3; /*  +0x0008  */
};

struct _USB_HUB_DEVICE_UXD_SETTINGS {
    unsigned long  Version; /*  +0x0000  */
    unsigned char PnpGuid[16]; /*  +0x0004 fe 10 00 00  */
    unsigned char OwnerGuid[16]; /*  +0x0014 fe 10 00 00  */
    unsigned long  DeleteOnShutdown; /*  +0x0024  */
    unsigned long  DeleteOnReload; /*  +0x0028  */
    unsigned long  DeleteOnDisconnect; /*  +0x002c  */
    unsigned char Reserved[20]; /*  +0x0030 ae 1b 00 00  */
};

struct _USB_DEVICE_STATUS {
    unsigned short  AsUshort16; /*  +0x0000  */
    /* unsigned char SelfPowered[0];  +0x0000 b1 1b 00 00  */
    /* unsigned char RemoteWakeup[0];  +0x0000 b2 1b 00 00  */
    /* unsigned char U1Enable[0];  +0x0000 b3 1b 00 00  */
    /* unsigned char U2Enable[0];  +0x0000 b4 1b 00 00  */
    /* unsigned char LtmEnable[0];  +0x0000 b5 1b 00 00  */
    unsigned char Reserved[2]; /*  +0x0000 b6 1b 00 00  */
};

struct _URB_CONTROL_GET_INTERFACE_REQUEST {
    unsigned char Hdr[16]; /*  +0x0000 79 18 00 00  */
    void *Reserved; /*  +0x0010  */
    unsigned long  Reserved0; /*  +0x0014  */
    unsigned long  TransferBufferLength; /*  +0x0018  */
    void *TransferBuffer; /*  +0x001c  */
    unsigned char TransferBufferMDL[4]; /*  +0x0020 90 10 00 00  */
    unsigned char UrbLink[4]; /*  +0x0024 78 18 00 00  */
    unsigned char hca[32]; /*  +0x0028 ae 1a 00 00  */
    unsigned char Reserved1[4]; /*  +0x0048 c0 1a 00 00  */
    unsigned short  Interface; /*  +0x004c  */
    unsigned short  Reserved2; /*  +0x004e  */
};

struct _KSEMAPHORE {
    unsigned char Header[16]; /*  +0x0000 56 10 00 00  */
    long  Limit; /*  +0x0010  */
};

/* struct <unnamed-tag> {
    unsigned char EvtIoWdmIrpForForwardProgress[4];  +0x0000 83 16 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned char ExaminePolicy[4];  +0x0000 be 1b 00 00 
}; */

struct _WDF_IO_FORWARD_PROGRESS_RESERVED_POLICY_SETTINGS {
    unsigned char Policy[4]; /*  +0x0000 c0 1b 00 00  */
};

struct _USB_DEVICE_DESCRIPTOR {
    unsigned char  bLength; /*  +0x0000  */
    unsigned char  bDescriptorType; /*  +0x0001  */
    unsigned short  bcdUSB; /*  +0x0002  */
    unsigned char  bDeviceClass; /*  +0x0004  */
    unsigned char  bDeviceSubClass; /*  +0x0005  */
    unsigned char  bDeviceProtocol; /*  +0x0006  */
    unsigned char  bMaxPacketSize0; /*  +0x0007  */
    unsigned short  idVendor; /*  +0x0008  */
    unsigned short  idProduct; /*  +0x000a  */
    unsigned short  bcdDevice; /*  +0x000c  */
    unsigned char  iManufacturer; /*  +0x000e  */
    unsigned char  iProduct; /*  +0x000f  */
    unsigned char  iSerialNumber; /*  +0x0010  */
    unsigned char  bNumConfigurations; /*  +0x0011  */
};

struct _USB_DUMP_DEVICE_INFO {
    unsigned long  EndpointCount; /*  +0x0000  */
    unsigned char EndpointInfo[4]; /*  +0x0004 c6 1b 00 00  */
    unsigned char  ConfigurationId; /*  +0x0008  */
    unsigned char  InterfaceId; /*  +0x0009  */
    unsigned char  AlternateSettingId; /*  +0x000a  */
    void *DeviceHandle; /*  +0x000c  */
};

/* struct <unnamed-tag> {
    unsigned char CurrentState[4];  +0x0000 c0 13 00 00 
    unsigned char NewState[4];  +0x0004 c0 13 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned char CurrentState[4];  +0x0000 c0 13 00 00 
}; */

/* struct <unnamed-tag> {
    /* unsigned char EnterState[0];  +0x0000 ca 1b 00 00 
    /* unsigned char PostProcessState[0];  +0x0000 cc 1b 00 00 
    unsigned char LeaveState[8];  +0x0000 ca 1b 00 00 
}; */

struct _WDF_DEVICE_POWER_POLICY_NOTIFICATION_DATA {
    unsigned char Type[4]; /*  +0x0000 38 1b 00 00  */
    unsigned char Data[8]; /*  +0x0004 ce 1b 00 00  */
};

struct _URB_SELECT_CONFIGURATION {
    unsigned char Hdr[16]; /*  +0x0000 79 18 00 00  */
    unsigned char ConfigurationDescriptor[4]; /*  +0x0010 8d 19 00 00  */
    void *ConfigurationHandle; /*  +0x0014  */
    unsigned char Interface[36]; /*  +0x0018 1e 1b 00 00  */
};

struct _IO_STATUS_BLOCK {
    long  Status; /*  +0x0000  */
    void *Pointer; /*  +0x0000  */
    unsigned long  Information; /*  +0x0004  */
};

struct _SM_CONTEXT {
    unsigned char StateHistory[768]; /*  +0x0000 d6 1b 00 00  */
    unsigned char EventHistory[64]; /*  +0x0300 d8 1b 00 00  */
    unsigned char  StateHistoryIndex; /*  +0x0340  */
    unsigned char  EventHistoryIndex; /*  +0x0341  */
    unsigned long  StateMachineLock; /*  +0x0344  */
    unsigned char  StateMachineRunning; /*  +0x0348  */
    unsigned char CurrentState[28]; /*  +0x034c d9 1b 00 00  */
    unsigned long  CurrentStateDepth; /*  +0x0368  */
    unsigned char EventQueue[68]; /*  +0x036c da 1b 00 00  */
    unsigned long  SubSmFlags; /*  +0x03b0  */
    void *ParentContext; /*  +0x03b4  */
    unsigned char AddEvent[4]; /*  +0x03b8 85 13 00 00  */
    unsigned char StateTable[4]; /*  +0x03bc db 1b 00 00  */
    unsigned long  StartIndex; /*  +0x03c0  */
    unsigned char SmWorker[4]; /*  +0x03c4 e5 19 00 00  */
    unsigned char HubFdoContext[4]; /*  +0x03c8 75 19 00 00  */
    unsigned char  NeedsForwardProgress; /*  +0x03cc  */
    unsigned char CurrentActivityId[16]; /*  +0x03d0 fe 10 00 00  */
    unsigned char ParentHandle[4]; /*  +0x03e0 c5 18 00 00  */
    unsigned char  DebugBreakOnStateTransition; /*  +0x03e4  */
};

struct _OWNER_ENTRY {
    unsigned long  OwnerThread; /*  +0x0000  */
    /* unsigned char IoPriorityBoosted[0];  +0x0004 96 18 00 00  */
    /* unsigned char OwnerReferenced[0];  +0x0004 16 1b 00 00  */
    /* unsigned char OwnerCount[0];  +0x0004 de 1b 00 00  */
    unsigned long  TableSize; /*  +0x0004  */
};

struct _USBD_INTERFACE_INFORMATION {
    unsigned short  Length; /*  +0x0000  */
    unsigned char  InterfaceNumber; /*  +0x0002  */
    unsigned char  AlternateSetting; /*  +0x0003  */
    unsigned char  Class; /*  +0x0004  */
    unsigned char  SubClass; /*  +0x0005  */
    unsigned char  Protocol; /*  +0x0006  */
    unsigned char  Reserved; /*  +0x0007  */
    void *InterfaceHandle; /*  +0x0008  */
    unsigned long  NumberOfPipes; /*  +0x000c  */
    unsigned char Pipes[20]; /*  +0x0010 e4 1b 00 00  */
};

struct _USBDEVICE_INFO {
    unsigned long  Size; /*  +0x0000  */
    unsigned char DeviceSpeed[4]; /*  +0x0004 62 1a 00 00  */
    unsigned long  PortNumber; /*  +0x0008  */
    unsigned char Context[4]; /*  +0x000c cb 19 00 00  */
};

struct _USB_ENDPOINT_DESCRIPTOR {
    unsigned char  bLength; /*  +0x0000  */
    unsigned char  bDescriptorType; /*  +0x0001  */
    unsigned char  bEndpointAddress; /*  +0x0002  */
    unsigned char  bmAttributes; /*  +0x0003  */
    unsigned short  wMaxPacketSize; /*  +0x0004  */
    unsigned char  bInterval; /*  +0x0006  */
};

struct _USB_PORT_STATUS_AND_CHANGE {
    unsigned long  AsUlong32; /*  +0x0000  */
    unsigned char PortStatus[2]; /*  +0x0000 a1 19 00 00  */
    unsigned char PortChange[2]; /*  +0x0002 a2 19 00 00  */
};

struct _KDEVICE_QUEUE_ENTRY {
    unsigned char DeviceListEntry[8]; /*  +0x0000 17 10 00 00  */
    unsigned long  SortKey; /*  +0x0008  */
    unsigned char  Inserted; /*  +0x000c  */
};

struct _URB_HCD_AREA {
    unsigned char Reserved8[32]; /*  +0x0000 3e 1a 00 00  */
};

struct _HUB_INFO_FROM_PARENT {
    unsigned char IoTarget[4]; /*  +0x0000 b1 10 00 00  */
    unsigned char DeviceDescriptor[18]; /*  +0x0004 89 19 00 00  */
    unsigned short  U1ExitLatency; /*  +0x0016  */
    unsigned short  U2ExitLatency; /*  +0x0018  */
    unsigned short  ExitLatencyOfSlowestLinkForU1; /*  +0x001a  */
    unsigned char  DepthOfSlowestLinkForU1; /*  +0x001c  */
    unsigned short  ExitLatencyOfSlowestLinkForU2; /*  +0x001e  */
    unsigned char  DepthOfSlowestLinkForU2; /*  +0x0020  */
    unsigned short  HostInitiatedU1ExitLatency; /*  +0x0022  */
    unsigned short  HostInitiatedU2ExitLatency; /*  +0x0024  */
};

enum _UCX_CLASS_FUNCTIONS {
    UcxIoDeviceControlIndex = 0,
    UcxControllerCreateIndex = 1,
    UcxControllerNeedsResetIndex = 2,
    UcxControllerResetCompleteIndex = 3,
    UcxRootHubCreateIndex = 4,
    UcxRootHubPortChangedIndex = 5,
    UcxUsbDeviceCreateIndex = 6,
    UcxUsbDeviceInitSetEventCallbacksIndex = 7,
    UcxUsbDeviceRemoteWakeNotificationIndex = 8,
    UcxEndpointCreateIndex = 9,
    UcxEndpointNeedToCancelTransfersIndex = 10,
    UcxEndpointInitSetEventCallbacksIndex = 11,
    UcxDefaultEndpointInitSetEventCallbacksIndex = 12,
    UcxEndpointInitSetWdfIoQueueIndex = 13,
    UcxEndpointPurgeCompleteIndex = 14,
    UcxEndpointStartCompleteIndex = 15,
    UcxEndpointAbortCompleteIndex = 16,
    UcxStaticStreamsInitSetStreamInfoIndex = 17,
    UcxStaticStreamsCreateIndex = 18,
    UcxFunctionsMax = 19
};

struct _DEVICE_CAPABILITIES {
    unsigned short  Size; /*  +0x0000  */
    unsigned short  Version; /*  +0x0002  */
    /* unsigned char DeviceD1[0];  +0x0004 96 18 00 00  */
    /* unsigned char DeviceD2[0];  +0x0004 16 1b 00 00  */
    /* unsigned char LockSupported[0];  +0x0004 17 1b 00 00  */
    /* unsigned char EjectSupported[0];  +0x0004 18 1b 00 00  */
    /* unsigned char Removable[0];  +0x0004 19 1b 00 00  */
    /* unsigned char DockDevice[0];  +0x0004 1a 1b 00 00  */
    /* unsigned char UniqueID[0];  +0x0004 8f 1b 00 00  */
    /* unsigned char SilentInstall[0];  +0x0004 69 1b 00 00  */
    /* unsigned char RawDeviceOK[0];  +0x0004 90 1b 00 00  */
    /* unsigned char SurpriseRemovalOK[0];  +0x0004 91 1b 00 00  */
    /* unsigned char WakeFromD0[0];  +0x0004 92 1b 00 00  */
    /* unsigned char WakeFromD1[0];  +0x0004 93 1b 00 00  */
    /* unsigned char WakeFromD2[0];  +0x0004 94 1b 00 00  */
    /* unsigned char WakeFromD3[0];  +0x0004 95 1b 00 00  */
    /* unsigned char HardwareDisabled[0];  +0x0004 71 1b 00 00  */
    /* unsigned char NonDynamic[0];  +0x0004 96 1b 00 00  */
    /* unsigned char WarmEjectSupported[0];  +0x0004 97 1b 00 00  */
    /* unsigned char NoDisplayInUI[0];  +0x0004 98 1b 00 00  */
    /* unsigned char Reserved1[0];  +0x0004 99 1b 00 00  */
    unsigned char Reserved[4]; /*  +0x0004 f5 1b 00 00  */
    unsigned long  Address; /*  +0x0008  */
    unsigned long  UINumber; /*  +0x000c  */
    unsigned char DeviceState[28]; /*  +0x0010 6f 13 00 00  */
    unsigned char SystemWake[4]; /*  +0x002c 1f 11 00 00  */
    unsigned char DeviceWake[4]; /*  +0x0030 78 11 00 00  */
    unsigned long  D1Latency; /*  +0x0034  */
    unsigned long  D2Latency; /*  +0x0038  */
    unsigned long  D3Latency; /*  +0x003c  */
};

struct _STATE_LOG {
    unsigned char Event[4]; /*  +0x0000 d7 1b 00 00  */
    unsigned char State[4]; /*  +0x0004 b3 1a 00 00  */
    unsigned long  Depth; /*  +0x0008  */
};

struct _USB_PORT_STATUS {
    unsigned short  AsUshort16; /*  +0x0000  */
    /* unsigned char Usb20PortStatus[0];  +0x0000 fa 1b 00 00  */
    unsigned char Usb30PortStatus[2]; /*  +0x0000 fb 1b 00 00  */
};

struct _USB_DUMP_DEVICE_ENDPOINT_INFO {
    unsigned char  Address; /*  +0x0000  */
    unsigned long  MaximumTransferSize; /*  +0x0004  */
};

struct _STATE_TRANSITION {
    unsigned char Event[4]; /*  +0x0000 d7 1b 00 00  */
    unsigned char TargetState[4]; /*  +0x0004 b3 1a 00 00  */
};

struct _EVENT {
    unsigned long  EventAsUlong; /*  +0x0000  */
    /* unsigned char HsmEvent[0];  +0x0000 bd 19 00 00  */
    /* unsigned char PsmEvent[0];  +0x0000 9d 19 00 00  */
    unsigned char DsmEvent[4]; /*  +0x0000 27 1b 00 00  */
};

struct _WHEA_ERROR_RECORD_HEADER_VALIDBITS {
    /* unsigned char PlatformId[0];  +0x0000 96 18 00 00  */
    /* unsigned char Timestamp[0];  +0x0000 16 1b 00 00  */
    /* unsigned char PartitionId[0];  +0x0000 17 1b 00 00  */
    /* unsigned char Reserved[0];  +0x0000 04 1c 00 00  */
    unsigned long  AsULONG; /*  +0x0000  */
};

struct _CM_PARTIAL_RESOURCE_LIST {
    unsigned short  Version; /*  +0x0000  */
    unsigned short  Revision; /*  +0x0002  */
    unsigned long  Count; /*  +0x0004  */
    unsigned char PartialDescriptors[16]; /*  +0x0008 07 1c 00 00  */
};

struct _UCXUSBDEVICE_INFO {
    unsigned long  Size; /*  +0x0000  */
    unsigned char DeviceSpeed[4]; /*  +0x0004 62 1a 00 00  */
    unsigned char TtHub[4]; /*  +0x0008 c5 18 00 00  */
    unsigned char PortPath[36]; /*  +0x000c 0a 1c 00 00  */
};

struct _USB_PORT_FLAGS {
    /* unsigned char DeviceConnected[0];  +0x0000 96 18 00 00  */
    /* unsigned char ConnectedDeviceSupportsReAttach[0];  +0x0000 16 1b 00 00  */
    /* unsigned char CanQueueOverCurrentReset[0];  +0x0000 17 1b 00 00  */
    unsigned char SSInactiveForBootDevice[4]; /*  +0x0000 18 1b 00 00  */
};

struct _SECTION_OBJECT_POINTERS {
    void *DataSectionObject; /*  +0x0000  */
    void *SharedCacheMap; /*  +0x0004  */
    void *ImageSectionObject; /*  +0x0008  */
};

struct _CONTROL_REQUEST {
    unsigned char WdfRequest[4]; /*  +0x0000 1b 13 00 00  */
    unsigned long  NumberOfBytes; /*  +0x0004  */
    unsigned char Irp[4]; /*  +0x0008 a4 10 00 00  */
    unsigned char Urb[80]; /*  +0x000c 82 18 00 00  */
};

struct _RTL_BITMAP {
    unsigned long  SizeOfBitMap; /*  +0x0000  */
    unsigned long *Buffer; /*  +0x0004  */
};

struct _PDO_FLAGS {
    unsigned char InD0[4]; /*  +0x0000 96 18 00 00  */
    unsigned long  ArmedForWake; /*  +0x0004  */
    /* unsigned char RequiresArmingForWake[0];  +0x0008 96 18 00 00  */
    /* unsigned char SupportsFunctionSuspend[0];  +0x0008 16 1b 00 00  */
    /* unsigned char InBootPath[0];  +0x0008 17 1b 00 00  */
    /* unsigned char ResetOnLastResume[0];  +0x0008 18 1b 00 00  */
    /* unsigned char ProgrammingLostOnLastReset[0];  +0x0008 19 1b 00 00  */
    /* unsigned char PowerLostOnLastReset[0];  +0x0008 1a 1b 00 00  */
    /* unsigned char DeviceGone[0];  +0x0008 8f 1b 00 00  */
    /* unsigned char QueryStopped[0];  +0x0008 69 1b 00 00  */
    unsigned char QueryRemoved[4]; /*  +0x0008 90 1b 00 00  */
};

struct _USB_START_FAILDATA {
    unsigned long  LengthInBytes; /*  +0x0000  */
    long  NtStatus; /*  +0x0004  */
    long  UsbdStatus; /*  +0x0008  */
    unsigned long  ConnectStatus; /*  +0x000c  */
    unsigned char DriverData[4]; /*  +0x0010 c0 1a 00 00  */
};

struct _DEVICE_MUX_FLAGS {
    /* unsigned char Stopped[0];  +0x0000 96 18 00 00  */
    /* unsigned char PowerReferenceHeld[0];  +0x0000 16 1b 00 00  */
    unsigned char PnpOperationPending[4]; /*  +0x0000 17 1b 00 00  */
};

struct _HUB_DESCRIPTOR {
    /* unsigned char Hub20Descriptor[0];  +0x0000 1b 1c 00 00  */
    unsigned char Hub30Descriptor[71]; /*  +0x0000 1c 1c 00 00  */
};

struct _MS_EXT_PROP_DESC {
    unsigned char Header[10]; /*  +0x0000 1f 1c 00 00  */
    unsigned char CustomSection[12]; /*  +0x000a 21 1c 00 00  */
};

struct _HSM_MUX_CONTEXT {
    unsigned long  MuxLock; /*  +0x0000  */
    unsigned long  OutstandingPortChanges; /*  +0x0004  */
    unsigned long  OutstandingPnPOperations; /*  +0x0008  */
    unsigned long  OutstandingResetOperations; /*  +0x000c  */
    unsigned long  NumberOfInterruptReferencesHeld; /*  +0x0010  */
    unsigned long  NumberOfPowerReferencesHeld; /*  +0x0014  */
    unsigned long  NumberOfDevicePowerReferencesHeld; /*  +0x0018  */
    unsigned char HubMuxFlags[8]; /*  +0x001c 24 1c 00 00  */
    unsigned long  NumberOfPSMs; /*  +0x0024  */
    unsigned char PSMListHead[8]; /*  +0x0028 17 10 00 00  */
    unsigned long  NumberOfDSMs; /*  +0x0030  */
    unsigned char DSMListHead[8]; /*  +0x0034 17 10 00 00  */
};

struct _KDEVICE_QUEUE {
    short  Type; /*  +0x0000  */
    short  Size; /*  +0x0002  */
    unsigned char DeviceListHead[8]; /*  +0x0004 17 10 00 00  */
    unsigned long  Lock; /*  +0x000c  */
    unsigned char  Busy; /*  +0x0010  */
};

struct _SYSTEM_POWER_STATE_CONTEXT {
    /* unsigned char Reserved1[0];  +0x0000 29 1c 00 00  */
    /* unsigned char TargetSystemState[0];  +0x0000 2a 1c 00 00  */
    /* unsigned char EffectiveSystemState[0];  +0x0000 2b 1c 00 00  */
    /* unsigned char CurrentSystemState[0];  +0x0000 2c 1c 00 00  */
    /* unsigned char IgnoreHibernationPath[0];  +0x0000 9b 1b 00 00  */
    /* unsigned char PseudoTransition[0];  +0x0000 9c 1b 00 00  */
    /* unsigned char Reserved2[0];  +0x0000 2d 1c 00 00  */
    unsigned long  ContextAsUlong; /*  +0x0000  */
};

/* struct <unnamed-tag> {
    /* unsigned char MaxStreams[0];  +0x0000 30 1c 00 00 
    unsigned char Reserved1[1];  +0x0000 31 1c 00 00 
}; */

/* struct <unnamed-tag> {
    /* unsigned char Mult[0];  +0x0000 34 1c 00 00 
    unsigned char Reserved2[1];  +0x0000 35 1c 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned char  AsUchar;  +0x0000 
    /* unsigned char Bulk[0];  +0x0000 33 1c 00 00 
    unsigned char Isochronous[1];  +0x0000 37 1c 00 00 
}; */

struct _USB_SUPERSPEED_ENDPOINT_COMPANION_DESCRIPTOR {
    unsigned char  bLength; /*  +0x0000  */
    unsigned char  bDescriptorType; /*  +0x0001  */
    unsigned char  bMaxBurst; /*  +0x0002  */
    unsigned char bmAttributes[1]; /*  +0x0003 39 1c 00 00  */
    unsigned short  wBytesPerInterval; /*  +0x0004  */
};

struct _SCATTER_GATHER_LIST {
    unsigned long  NumberOfElements; /*  +0x0000  */
    unsigned long  Reserved; /*  +0x0004  */
    /* unsigned char Elements[0];  +0x0008 3d 1c 00 00  */
};

enum _WDF_RETRIEVE_CHILD_FLAGS {
    WdfRetrieveUnspecified = 0,
    WdfRetrievePresentChildren = 1,
    WdfRetrieveMissingChildren = 2,
    WdfRetrievePendingChildren = 4,
    WdfRetrieveAddedChildren = 5,
    WdfRetrieveAllChildren = 7
};

struct _WHEA_TIMESTAMP {
    /* unsigned char Seconds[0];  +0x0000 42 1c 00 00  */
    /* unsigned char Minutes[0];  +0x0000 43 1c 00 00  */
    /* unsigned char Hours[0];  +0x0000 44 1c 00 00  */
    /* unsigned char Precise[0];  +0x0000 45 1c 00 00  */
    /* unsigned char Reserved[0];  +0x0000 46 1c 00 00  */
    /* unsigned char Day[0];  +0x0000 47 1c 00 00  */
    /* unsigned char Month[0];  +0x0000 48 1c 00 00  */
    /* unsigned char Year[0];  +0x0000 49 1c 00 00  */
    /* unsigned char Century[0];  +0x0000 4a 1c 00 00  */
    unsigned char AsLARGE_INTEGER[8]; /*  +0x0000 3a 10 00 00  */
};

struct _VPB {
    short  Type; /*  +0x0000  */
    short  Size; /*  +0x0002  */
    unsigned short  Flags; /*  +0x0004  */
    unsigned short  VolumeLabelLength; /*  +0x0006  */
    unsigned char DeviceObject[4]; /*  +0x0008 b1 10 00 00  */
    unsigned char RealDevice[4]; /*  +0x000c b1 10 00 00  */
    unsigned long  SerialNumber; /*  +0x0010  */
    unsigned long  ReferenceCount; /*  +0x0014  */
    unsigned char VolumeLabel[64]; /*  +0x0018 50 1c 00 00  */
};

struct _MS_EXT_CONFIG_DESC {
    unsigned char Header[16]; /*  +0x0000 53 1c 00 00  */
    unsigned char Function[24]; /*  +0x0010 55 1c 00 00  */
};

struct _ACPI_UPC_PACKAGE {
    unsigned char  PortIsConnectable; /*  +0x0000  */
    unsigned char  PortConnectorType; /*  +0x0001  */
    unsigned long  Reserved0; /*  +0x0004  */
    unsigned long  Reserved1; /*  +0x0008  */
};

struct _USB_DEVICE_HACKS {
    /* unsigned char DisableSerialNumber[0];  +0x0000 96 18 00 00  */
    /* unsigned char DontSkipMsOsDescriptor[0];  +0x0000 16 1b 00 00  */
    /* unsigned char ResetOnResumeSx[0];  +0x0000 17 1b 00 00  */
    /* unsigned char DisableOnSoftRemove[0];  +0x0000 18 1b 00 00  */
    /* unsigned char RequestConfigDescOnReset[0];  +0x0000 19 1b 00 00  */
    /* unsigned char SkipContainerIdQuery[0];  +0x0000 1a 1b 00 00  */
    /* unsigned char IgnoreBOSDescriptorValidationFailure[0];  +0x0000 8f 1b 00 00  */
    /* unsigned char DisableLpm[0];  +0x0000 69 1b 00 00  */
    /* unsigned char IgnoreSetSelFailure[0];  +0x0000 90 1b 00 00  */
    /* unsigned char ResetOnResumeInSuperSpeed[0];  +0x0000 91 1b 00 00  */
    /* unsigned char AllowInvalidPipeHandles[0];  +0x0000 92 1b 00 00  */
    unsigned char DisableUASP[4]; /*  +0x0000 93 1b 00 00  */
};

enum _MEMORY_CACHING_TYPE_ORIG {
    MmFrameBufferCached = 2
};

struct _MS_EXT_PROP_DESC_CUSTOM_PROP {
    unsigned long  dwSize; /*  +0x0000  */
    unsigned long  dwPropertyDataType; /*  +0x0004  */
    unsigned short  wPropertyNameLength; /*  +0x0008  */
    unsigned char PropertyName[2]; /*  +0x000a 9c 1a 00 00  */
};

struct _PO_FX_COMPONENT {
    unsigned char Id[16]; /*  +0x0000 fe 10 00 00  */
    unsigned long  IdleStateCount; /*  +0x0010  */
    unsigned long  DeepestWakeableIdleState; /*  +0x0014  */
    unsigned char IdleStates[4]; /*  +0x0018 61 1c 00 00  */
};

struct _USB_DEVICE_CAPABILITY_USB20_EXTENSION_DESCRIPTOR {
    unsigned char  bLength; /*  +0x0000  */
    unsigned char  bDescriptorType; /*  +0x0001  */
    unsigned char  bDevCapabilityType; /*  +0x0002  */
    unsigned long  bmAttributes; /*  +0x0003  */
};

enum _KSPIN_LOCK_QUEUE_NUMBER {
    LockQueueUnusedSpare0 = 0,
    LockQueueExpansionLock = 1,
    LockQueueUnusedSpare2 = 2,
    LockQueueSystemSpaceLock = 3,
    LockQueueVacbLock = 4,
    LockQueueMasterLock = 5,
    LockQueueNonPagedPoolLock = 6,
    LockQueueIoCancelLock = 7,
    LockQueueWorkQueueLock = 8,
    LockQueueIoVpbLock = 9,
    LockQueueIoDatabaseLock = 10,
    LockQueueIoCompletionLock = 11,
    LockQueueNtfsStructLock = 12,
    LockQueueAfdWorkQueueLock = 13,
    LockQueueBcbLock = 14,
    LockQueueMmNonPagedPoolLock = 15,
    LockQueueUnusedSpare16 = 16,
    LockQueueMaximumLock = 17
};

struct _POWER_STATE {
    /* unsigned char SystemState[0];  +0x0000 1f 11 00 00  */
    unsigned char DeviceState[4]; /*  +0x0000 78 11 00 00  */
};

enum _MAX_PORT_POWER {
    MaxPortPowerInvalid = 0,
    MaxPortPower100Milliamps = 100,
    MaxPortPower500Milliamps = 500
};

struct _HUB_INFORMATION {
    unsigned char HubFlags[4]; /*  +0x0000 6a 1c 00 00  */
    unsigned short  NumberOfPorts; /*  +0x0004  */
    unsigned short  HubAddress; /*  +0x0006  */
    unsigned short  HubResetCount; /*  +0x0008  */
    unsigned short  HubTimedResetRecoveryCount; /*  +0x000a  */
    unsigned long  HubResetRecoveryCount; /*  +0x000c  */
    unsigned char FirstHubResetRecoveryTimeStamp[8]; /*  +0x0010 3a 10 00 00  */
    unsigned char LastHubResetPortStatus[4]; /*  +0x0018 a0 19 00 00  */
    unsigned short  HubGetDescriptorCount; /*  +0x001c  */
    void *HubConfigurationHandle; /*  +0x0020  */
    unsigned short  InterruptPipeMaxPacketSize; /*  +0x0024  */
    unsigned char MaxPortPower[4]; /*  +0x0028 6c 1c 00 00  */
    unsigned long  HubNumber; /*  +0x002c  */
    unsigned char RootHubInfo[20]; /*  +0x0030 6d 1c 00 00  */
    unsigned char RootHub20PortInfoPointerArray[4]; /*  +0x0044 70 1c 00 00  */
    unsigned char RootHub30PortInfoPointerArray[4]; /*  +0x0048 73 1c 00 00  */
    unsigned short  NumberOf20Ports; /*  +0x004c  */
    unsigned short  First20PortNumber; /*  +0x004e  */
    unsigned short  Last20PortNumber; /*  +0x0050  */
    unsigned short  NumberOf30Ports; /*  +0x0052  */
    unsigned short  First30PortNumber; /*  +0x0054  */
    unsigned short  Last30PortNumber; /*  +0x0056  */
};

struct _USB_INTERFACE_DESCRIPTOR {
    unsigned char  bLength; /*  +0x0000  */
    unsigned char  bDescriptorType; /*  +0x0001  */
    unsigned char  bInterfaceNumber; /*  +0x0002  */
    unsigned char  bAlternateSetting; /*  +0x0003  */
    unsigned char  bNumEndpoints; /*  +0x0004  */
    unsigned char  bInterfaceClass; /*  +0x0005  */
    unsigned char  bInterfaceSubClass; /*  +0x0006  */
    unsigned char  bInterfaceProtocol; /*  +0x0007  */
    unsigned char  iInterface; /*  +0x0008  */
};

struct _DEVICE_CONFIGURATION {
    unsigned char WdfMemory[4]; /*  +0x0000 8d 12 00 00  */
    unsigned long  NumberOfEndpoints; /*  +0x0004  */
    unsigned char InterfaceList[8]; /*  +0x0008 17 10 00 00  */
    unsigned char ConfigurationDescriptor[4]; /*  +0x0010 78 1c 00 00  */
};

struct _USB_DEVICE_SQM_PROPERTIES {
    unsigned long  AsUlong; /*  +0x0000  */
    /* unsigned char Reserved1[0];  +0x0000 96 18 00 00  */
    /* unsigned char Reserved2[0];  +0x0000 16 1b 00 00  */
    /* unsigned char Virtualized[0];  +0x0000 17 1b 00 00  */
    /* unsigned char IsOnXhci[0];  +0x0000 18 1b 00 00  */
    /* unsigned char HostSpecialFiles[0];  +0x0000 19 1b 00 00  */
    /* unsigned char ValidBOSDescriptor[0];  +0x0000 1a 1b 00 00  */
    /* unsigned char SupportsStreams[0];  +0x0000 8f 1b 00 00  */
    /* unsigned char SupportsMultipleConfigurations[0];  +0x0000 69 1b 00 00  */
    unsigned char Reserved3[4]; /*  +0x0000 90 1b 00 00  */
};

enum CHAR {
    TriStateUnknown = 117,
    TriStateFalse = 102,
    TriStateTrue = 116
};

struct _ROOTHUB_30PORT_INFO {
    unsigned short  PortNumber; /*  +0x0000  */
    unsigned char Removable[4]; /*  +0x0004 7e 1c 00 00  */
    unsigned char DebugCapable[4]; /*  +0x0008 7e 1c 00 00  */
};

struct _URB_HEADER {
    unsigned short  Length; /*  +0x0000  */
    unsigned short  Function; /*  +0x0002  */
    long  Status; /*  +0x0004  */
    void *UsbdDeviceHandle; /*  +0x0008  */
    unsigned long  UsbdFlags; /*  +0x000c  */
};

struct _URB_GET_CURRENT_FRAME_NUMBER {
    unsigned char Hdr[16]; /*  +0x0000 79 18 00 00  */
    unsigned long  FrameNumber; /*  +0x0010  */
};

struct _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS {
    /* unsigned char FRUId[0];  +0x0000 c3 1a 00 00  */
    /* unsigned char FRUText[0];  +0x0000 c4 1a 00 00  */
    /* unsigned char Reserved[0];  +0x0000 35 1c 00 00  */
    unsigned char  AsUCHAR; /*  +0x0000  */
};

enum _HSM_SUBSM_FLAGS {
    HsmSubSmFlagNone = 0,
    HsmSubSmFlagHub20 = 1,
    HsmSubSmFlagHub30 = 2,
    HsmSubSmFlagHubRoot = 4,
    HsmSubSmFlagAny = 255
};

enum _PSM20_SUBSM_FLAGS {
    Psm20SubSmFlagNone = 0,
    Psm20SubSmFlagAny = 1
};

enum _PSM30_SUBSM_FLAGS {
    Psm30SubSmFlagNone = 0,
    Psm30SubSmFlagAny = 1
};

struct _SUBSM_FLAGS {
    unsigned long  SubSmFlagsAsUlong; /*  +0x0000  */
    /* unsigned char HsmSubSmFlags[0];  +0x0000 88 1c 00 00  */
    /* unsigned char Psm20SubSmFlags[0];  +0x0000 8a 1c 00 00  */
    /* unsigned char Psm30SubSmFlags[0];  +0x0000 8c 1c 00 00  */
    unsigned char DsmSubSmFlags[4]; /*  +0x0000 cf 1a 00 00  */
};

enum _MODE {
    KernelMode = 0,
    UserMode = 1,
    MaximumMode = 2
};

enum _USBD_PIPE_TYPE {
    UsbdPipeTypeControl = 0,
    UsbdPipeTypeIsochronous = 1,
    UsbdPipeTypeBulk = 2,
    UsbdPipeTypeInterrupt = 3
};

struct _USBD_PIPE_INFORMATION {
    unsigned short  MaximumPacketSize; /*  +0x0000  */
    unsigned char  EndpointAddress; /*  +0x0002  */
    unsigned char  Interval; /*  +0x0003  */
    unsigned char PipeType[4]; /*  +0x0004 92 1c 00 00  */
    void *PipeHandle; /*  +0x0008  */
    unsigned long  MaximumTransferSize; /*  +0x000c  */
    unsigned long  PipeFlags; /*  +0x0010  */
};

struct _USB_RESET_FLAGS {
    /* unsigned char ControllerProgrammingLost[0];  +0x0000 96 18 00 00  */
    unsigned char DevicePowerCycled[4]; /*  +0x0000 16 1b 00 00  */
};

struct _USB_DEVICE_CAPABILITY_SUPERSPEED_USB_DESCRIPTOR {
    unsigned char  bLength; /*  +0x0000  */
    unsigned char  bDescriptorType; /*  +0x0001  */
    unsigned char  bDevCapabilityType; /*  +0x0002  */
    unsigned char  bmAttributes; /*  +0x0003  */
    unsigned short  wSpeedsSupported; /*  +0x0004  */
    unsigned char  bFunctionalitySupport; /*  +0x0006  */
    unsigned char  bU1DevExitLat; /*  +0x0007  */
    unsigned short  wU2DevExitLat; /*  +0x0008  */
};

struct _IO_RESOURCE_LIST {
    unsigned short  Version; /*  +0x0000  */
    unsigned short  Revision; /*  +0x0002  */
    unsigned long  Count; /*  +0x0004  */
    unsigned char Descriptors[32]; /*  +0x0008 99 1c 00 00  */
};

struct _PO_FX_COMPONENT_IDLE_STATE {
    unsigned long long  TransitionLatency; /*  +0x0000  */
    unsigned long long  ResidencyRequirement; /*  +0x0008  */
    unsigned long  NominalPower; /*  +0x0010  */
};

struct _WHEA_ERROR_RECORD_HEADER_FLAGS {
    /* unsigned char Recovered[0];  +0x0000 96 18 00 00  */
    /* unsigned char PreviousError[0];  +0x0000 16 1b 00 00  */
    /* unsigned char Simulated[0];  +0x0000 17 1b 00 00  */
    /* unsigned char Reserved[0];  +0x0000 04 1c 00 00  */
    unsigned long  AsULONG; /*  +0x0000  */
};

enum _ROOT_CONNECTOR_TYPE {
    RootConnectorTypeInvalid = 0,
    RootConnectorTypeNonAcpi = 1,
    RootConnectorTypeAcpi = 2
};

struct _CONNECTOR_ID {
    unsigned char Type[4]; /*  +0x0000 a1 1c 00 00  */
    /* unsigned char AcpiPldBuffer[0];  +0x0004 a7 19 00 00  */
    unsigned long  HubNumber; /*  +0x0004  */
    unsigned short  Depth; /*  +0x0014  */
    unsigned char ConnectorPath[24]; /*  +0x0018 a2 1c 00 00  */
};

struct _USB_PORT_CHANGE {
    unsigned short  AsUshort16; /*  +0x0000  */
    /* unsigned char Usb20PortChange[0];  +0x0000 a5 1c 00 00  */
    unsigned char Usb30PortChange[2]; /*  +0x0000 a6 1c 00 00  */
};

enum _UCXENDPOINT_STATE {
    UcxEndpointStateInvalid = 0,
    UcxEndpointStateNotCreated = 1,
    UcxEndpointStatePendingCreate = 2,
    UcxEndpointStatePendingEnable = 3,
    UcxEndpointStateEnabled = 4,
    UcxEndpointStatePendingDisable = 5,
    UcxEndpointStateDisabled = 6,
    UcxEndpointStateDeleted = 7
};

struct _PIPE_HANDLE {
    unsigned char UcxEndpoint[4]; /*  +0x0000 2a 19 00 00  */
    unsigned char UcxEndpointState[4]; /*  +0x0004 aa 1c 00 00  */
    unsigned char EndpointFlags[4]; /*  +0x0008 ab 1c 00 00  */
    void *UsbdPipeHandle; /*  +0x000c  */
    unsigned long  UsbdPipeFlags; /*  +0x0010  */
    unsigned char EndpointDescriptor[4]; /*  +0x0014 10 19 00 00  */
    unsigned long  EndpointDescriptorBufferLength; /*  +0x0018  */
    unsigned char SSEndpointCompanionDescriptor[4]; /*  +0x001c 12 19 00 00  */
};

struct _INTERFACE_HANDLE {
    unsigned char MemoryObject[4]; /*  +0x0000 8d 12 00 00  */
    unsigned char InterfaceLink[8]; /*  +0x0004 17 10 00 00  */
    unsigned long  NumberOfEndpoints; /*  +0x000c  */
    unsigned char InterfaceFlags[4]; /*  +0x0010 ae 1c 00 00  */
    unsigned char InterfaceDescriptor[4]; /*  +0x0014 8b 19 00 00  */
    unsigned char PipeHandle[32]; /*  +0x0018 af 1c 00 00  */
};

enum _WDF_POWER_POLICY_IDLE_TIMEOUT_CONSTANTS {
    IdleTimeoutDefaultConstant = 0
};

struct _USB_DUMP_CONTROLLER_INFO {
    unsigned long  MajorVersion; /*  +0x0000  */
    unsigned long  MinorVersion; /*  +0x0004  */
    void *ControllerContext; /*  +0x0008  */
    unsigned char ControllerInitialize[4]; /*  +0x000c b5 1c 00 00  */
    unsigned char ControllerSendURB[4]; /*  +0x0010 b8 1c 00 00  */
    unsigned char ControllerSendURBAsync[4]; /*  +0x0014 b8 1c 00 00  */
    unsigned char ControllerPollForCompletion[4]; /*  +0x0018 bc 1c 00 00  */
    unsigned char ControllerResetDevice[4]; /*  +0x001c b5 1c 00 00  */
    unsigned char ControllerCleanUp[4]; /*  +0x0020 b5 1c 00 00  */
    void *ControllerCommonBufferVA; /*  +0x0024  */
    unsigned char ControllerCommonBufferPA[8]; /*  +0x0028 3a 10 00 00  */
    unsigned long  ControllerCommonBufferSize; /*  +0x0030  */
    unsigned char  ControllerSupportsMultistageResume; /*  +0x0034  */
};

struct _USB_ID_STRING {
    unsigned short  LanguageId; /*  +0x0000  */
    unsigned short  Pad; /*  +0x0002  */
    unsigned long  LengthInBytes; /*  +0x0004  */
    unsigned short *Buffer; /*  +0x0008  */
};

struct _USB_TOPOLOGY_ADDRESS {
    unsigned long  PciBusNumber; /*  +0x0000  */
    unsigned long  PciDeviceNumber; /*  +0x0004  */
    unsigned long  PciFunctionNumber; /*  +0x0008  */
    unsigned long  Reserved; /*  +0x000c  */
    unsigned short  RootHubPortNumber; /*  +0x0010  */
    unsigned char HubPortNumber[10]; /*  +0x0012 35 1a 00 00  */
    unsigned short  Reserved2; /*  +0x001c  */
};

enum _WDF_DEVICE_STATE_FLAGS {
     = 32770
};

enum _IO_ALLOCATION_ACTION {
    KeepObject = 1,
    DeallocateObject = 2,
    DeallocateObjectKeepRegisters = 3
};

struct _WAIT_CONTEXT_BLOCK {
    /* unsigned char WaitQueueEntry[0];  +0x0000 b5 10 00 00  */
    unsigned char DmaWaitEntry[8]; /*  +0x0000 17 10 00 00  */
    unsigned long  NumberOfChannels; /*  +0x0008  */
    /* unsigned char SyncCallback[0];  +0x000c 96 18 00 00  */
    /* unsigned char DmaContext[0];  +0x000c 16 1b 00 00  */
    unsigned char Reserved[4]; /*  +0x000c de 1b 00 00  */
    unsigned char DeviceRoutine[4]; /*  +0x0010 c9 1c 00 00  */
    void *DeviceContext; /*  +0x0014  */
    unsigned long  NumberOfMapRegisters; /*  +0x0018  */
    void *DeviceObject; /*  +0x001c  */
    void *CurrentIrp; /*  +0x0020  */
    unsigned char BufferChainingDpc[4]; /*  +0x0024 41 11 00 00  */
};

struct _RTL_DYNAMIC_HASH_TABLE_ENTRY {
    unsigned char Linkage[8]; /*  +0x0000 17 10 00 00  */
    unsigned long  Signature; /*  +0x0008  */
};

enum _PORT_PROTOCOL {
    PortProtocolInvalid = 0,
    PortProtocolUsb20 = 512,
    PortProtocolUsb30 = 768
};

struct _PORT_INFORMATION {
    unsigned short  PortNumber; /*  +0x0000  */
    unsigned char PortFlags[4]; /*  +0x0004 cf 1c 00 00  */
    unsigned char PortProtocol[4]; /*  +0x0008 d1 1c 00 00  */
    unsigned short  FirstMapped30PortNumber; /*  +0x000c  */
    unsigned short  LastMapped30PortNumber; /*  +0x000e  */
};

struct _USB_30_PORT_STATUS {
    unsigned short  AsUshort16; /*  +0x0000  */
    /* unsigned char CurrentConnectStatus[0];  +0x0000 b1 1b 00 00  */
    /* unsigned char PortEnabledDisabled[0];  +0x0000 b2 1b 00 00  */
    /* unsigned char Reserved0[0];  +0x0000 b3 1b 00 00  */
    /* unsigned char OverCurrent[0];  +0x0000 b4 1b 00 00  */
    /* unsigned char Reset[0];  +0x0000 b5 1b 00 00  */
    /* unsigned char PortLinkState[0];  +0x0000 d4 1c 00 00  */
    /* unsigned char PortPower[0];  +0x0000 d5 1c 00 00  */
    /* unsigned char NegotiatedDeviceSpeed[0];  +0x0000 d6 1c 00 00  */
    unsigned char Reserved1[2]; /*  +0x0000 d7 1c 00 00  */
};

struct _HUB_GLOBAL_FLAGS {
    /* unsigned char HubGlobalKeyName[0];  +0x0000 96 18 00 00  */
    /* unsigned char DisableSelectiveSuspendUI[0];  +0x0000 16 1b 00 00  */
    /* unsigned char DisableSelectiveSuspend[0];  +0x0000 17 1b 00 00  */
    /* unsigned char MsOsDescriptorMode[0];  +0x0000 18 1b 00 00  */
    /* unsigned char EnableDiagnosticMode[0];  +0x0000 19 1b 00 00  */
    /* unsigned char DisableUxdSupport[0];  +0x0000 1a 1b 00 00  */
    /* unsigned char EnableExtendedValidation[0];  +0x0000 8f 1b 00 00  */
    /* unsigned char WakeOnConnectUI[0];  +0x0000 69 1b 00 00  */
    /* unsigned char DisableOnSoftRemove[0];  +0x0000 90 1b 00 00  */
    /* unsigned char UxdGlobalDeleteShutdown[0];  +0x0000 91 1b 00 00  */
    /* unsigned char UxdGlobalDeleteOnReload[0];  +0x0000 92 1b 00 00  */
    /* unsigned char UxdGlobalDeleteDisconnect[0];  +0x0000 93 1b 00 00  */
    /* unsigned char UxdGlobalEnable[0];  +0x0000 94 1b 00 00  */
    /* unsigned char EtwEnabled[0];  +0x0000 95 1b 00 00  */
    unsigned char BreakOnRootHubFailure[4]; /*  +0x0000 71 1b 00 00  */
};

struct _INTERFACE_FLAGS {
    /* unsigned char HasAlternateSettings[0];  +0x0000 96 18 00 00  */
    unsigned char NeedsSetInterface[4]; /*  +0x0000 16 1b 00 00  */
};

enum _WDFFUNCENUM {
    WdfChildListCreateTableIndex = 0,
    WdfChildListGetDeviceTableIndex = 1,
    WdfChildListRetrievePdoTableIndex = 2,
    WdfChildListRetrieveAddressDescriptionTableIndex = 3,
    WdfChildListBeginScanTableIndex = 4,
    WdfChildListEndScanTableIndex = 5,
    WdfChildListBeginIterationTableIndex = 6,
    WdfChildListRetrieveNextDeviceTableIndex = 7,
    WdfChildListEndIterationTableIndex = 8,
    WdfChildListAddOrUpdateChildDescriptionAsPresentTableIndex = 9,
    WdfChildListUpdateChildDescriptionAsMissingTableIndex = 10,
    WdfChildListUpdateAllChildDescriptionsAsPresentTableIndex = 11,
    WdfChildListRequestChildEjectTableIndex = 12,
    WdfCollectionCreateTableIndex = 13,
    WdfCollectionGetCountTableIndex = 14,
    WdfCollectionAddTableIndex = 15,
    WdfCollectionRemoveTableIndex = 16,
    WdfCollectionRemoveItemTableIndex = 17,
    WdfCollectionGetItemTableIndex = 18,
    WdfCollectionGetFirstItemTableIndex = 19,
    WdfCollectionGetLastItemTableIndex = 20,
    WdfCommonBufferCreateTableIndex = 21,
    WdfCommonBufferGetAlignedVirtualAddressTableIndex = 22,
    WdfCommonBufferGetAlignedLogicalAddressTableIndex = 23,
    WdfCommonBufferGetLengthTableIndex = 24,
    WdfControlDeviceInitAllocateTableIndex = 25,
    WdfControlDeviceInitSetShutdownNotificationTableIndex = 26,
    WdfControlFinishInitializingTableIndex = 27,
    WdfDeviceGetDeviceStateTableIndex = 28,
    WdfDeviceSetDeviceStateTableIndex = 29,
    WdfWdmDeviceGetWdfDeviceHandleTableIndex = 30,
    WdfDeviceWdmGetDeviceObjectTableIndex = 31,
    WdfDeviceWdmGetAttachedDeviceTableIndex = 32,
    WdfDeviceWdmGetPhysicalDeviceTableIndex = 33,
    WdfDeviceWdmDispatchPreprocessedIrpTableIndex = 34,
    WdfDeviceAddDependentUsageDeviceObjectTableIndex = 35,
    WdfDeviceAddRemovalRelationsPhysicalDeviceTableIndex = 36,
    WdfDeviceRemoveRemovalRelationsPhysicalDeviceTableIndex = 37,
    WdfDeviceClearRemovalRelationsDevicesTableIndex = 38,
    WdfDeviceGetDriverTableIndex = 39,
    WdfDeviceRetrieveDeviceNameTableIndex = 40,
    WdfDeviceAssignMofResourceNameTableIndex = 41,
    WdfDeviceGetIoTargetTableIndex = 42,
    WdfDeviceGetDevicePnpStateTableIndex = 43,
    WdfDeviceGetDevicePowerStateTableIndex = 44,
    WdfDeviceGetDevicePowerPolicyStateTableIndex = 45,
    WdfDeviceAssignS0IdleSettingsTableIndex = 46,
    WdfDeviceAssignSxWakeSettingsTableIndex = 47,
    WdfDeviceOpenRegistryKeyTableIndex = 48,
    WdfDeviceSetSpecialFileSupportTableIndex = 49,
    WdfDeviceSetCharacteristicsTableIndex = 50,
    WdfDeviceGetCharacteristicsTableIndex = 51,
    WdfDeviceGetAlignmentRequirementTableIndex = 52,
    WdfDeviceSetAlignmentRequirementTableIndex = 53,
    WdfDeviceInitFreeTableIndex = 54,
    WdfDeviceInitSetPnpPowerEventCallbacksTableIndex = 55,
    WdfDeviceInitSetPowerPolicyEventCallbacksTableIndex = 56,
    WdfDeviceInitSetPowerPolicyOwnershipTableIndex = 57,
    WdfDeviceInitRegisterPnpStateChangeCallbackTableIndex = 58,
    WdfDeviceInitRegisterPowerStateChangeCallbackTableIndex = 59,
    WdfDeviceInitRegisterPowerPolicyStateChangeCallbackTableIndex = 60,
    WdfDeviceInitSetIoTypeTableIndex = 61,
    WdfDeviceInitSetExclusiveTableIndex = 62,
    WdfDeviceInitSetPowerNotPageableTableIndex = 63,
    WdfDeviceInitSetPowerPageableTableIndex = 64,
    WdfDeviceInitSetPowerInrushTableIndex = 65,
    WdfDeviceInitSetDeviceTypeTableIndex = 66,
    WdfDeviceInitAssignNameTableIndex = 67,
    WdfDeviceInitAssignSDDLStringTableIndex = 68,
    WdfDeviceInitSetDeviceClassTableIndex = 69,
    WdfDeviceInitSetCharacteristicsTableIndex = 70,
    WdfDeviceInitSetFileObjectConfigTableIndex = 71,
    WdfDeviceInitSetRequestAttributesTableIndex = 72,
    WdfDeviceInitAssignWdmIrpPreprocessCallbackTableIndex = 73,
    WdfDeviceInitSetIoInCallerContextCallbackTableIndex = 74,
    WdfDeviceCreateTableIndex = 75,
    WdfDeviceSetStaticStopRemoveTableIndex = 76,
    WdfDeviceCreateDeviceInterfaceTableIndex = 77,
    WdfDeviceSetDeviceInterfaceStateTableIndex = 78,
    WdfDeviceRetrieveDeviceInterfaceStringTableIndex = 79,
    WdfDeviceCreateSymbolicLinkTableIndex = 80,
    WdfDeviceQueryPropertyTableIndex = 81,
    WdfDeviceAllocAndQueryPropertyTableIndex = 82,
    WdfDeviceSetPnpCapabilitiesTableIndex = 83,
    WdfDeviceSetPowerCapabilitiesTableIndex = 84,
    WdfDeviceSetBusInformationForChildrenTableIndex = 85,
    WdfDeviceIndicateWakeStatusTableIndex = 86,
    WdfDeviceSetFailedTableIndex = 87,
    WdfDeviceStopIdleTableIndex = 88,
    WdfDeviceResumeIdleTableIndex = 89,
    WdfDeviceGetFileObjectTableIndex = 90,
    WdfDeviceEnqueueRequestTableIndex = 91,
    WdfDeviceGetDefaultQueueTableIndex = 92,
    WdfDeviceConfigureRequestDispatchingTableIndex = 93,
    WdfDmaEnablerCreateTableIndex = 94,
    WdfDmaEnablerGetMaximumLengthTableIndex = 95,
    WdfDmaEnablerGetMaximumScatterGatherElementsTableIndex = 96,
    WdfDmaEnablerSetMaximumScatterGatherElementsTableIndex = 97,
    WdfDmaTransactionCreateTableIndex = 98,
    WdfDmaTransactionInitializeTableIndex = 99,
    WdfDmaTransactionInitializeUsingRequestTableIndex = 100,
    WdfDmaTransactionExecuteTableIndex = 101,
    WdfDmaTransactionReleaseTableIndex = 102,
    WdfDmaTransactionDmaCompletedTableIndex = 103,
    WdfDmaTransactionDmaCompletedWithLengthTableIndex = 104,
    WdfDmaTransactionDmaCompletedFinalTableIndex = 105,
    WdfDmaTransactionGetBytesTransferredTableIndex = 106,
    WdfDmaTransactionSetMaximumLengthTableIndex = 107,
    WdfDmaTransactionGetRequestTableIndex = 108,
    WdfDmaTransactionGetCurrentDmaTransferLengthTableIndex = 109,
    WdfDmaTransactionGetDeviceTableIndex = 110,
    WdfDpcCreateTableIndex = 111,
    WdfDpcEnqueueTableIndex = 112,
    WdfDpcCancelTableIndex = 113,
    WdfDpcGetParentObjectTableIndex = 114,
    WdfDpcWdmGetDpcTableIndex = 115,
    WdfDriverCreateTableIndex = 116,
    WdfDriverGetRegistryPathTableIndex = 117,
    WdfDriverWdmGetDriverObjectTableIndex = 118,
    WdfDriverOpenParametersRegistryKeyTableIndex = 119,
    WdfWdmDriverGetWdfDriverHandleTableIndex = 120,
    WdfDriverRegisterTraceInfoTableIndex = 121,
    WdfDriverRetrieveVersionStringTableIndex = 122,
    WdfDriverIsVersionAvailableTableIndex = 123,
    WdfFdoInitWdmGetPhysicalDeviceTableIndex = 124,
    WdfFdoInitOpenRegistryKeyTableIndex = 125,
    WdfFdoInitQueryPropertyTableIndex = 126,
    WdfFdoInitAllocAndQueryPropertyTableIndex = 127,
    WdfFdoInitSetEventCallbacksTableIndex = 128,
    WdfFdoInitSetFilterTableIndex = 129,
    WdfFdoInitSetDefaultChildListConfigTableIndex = 130,
    WdfFdoQueryForInterfaceTableIndex = 131,
    WdfFdoGetDefaultChildListTableIndex = 132,
    WdfFdoAddStaticChildTableIndex = 133,
    WdfFdoLockStaticChildListForIterationTableIndex = 134,
    WdfFdoRetrieveNextStaticChildTableIndex = 135,
    WdfFdoUnlockStaticChildListFromIterationTableIndex = 136,
    WdfFileObjectGetFileNameTableIndex = 137,
    WdfFileObjectGetFlagsTableIndex = 138,
    WdfFileObjectGetDeviceTableIndex = 139,
    WdfFileObjectWdmGetFileObjectTableIndex = 140,
    WdfInterruptCreateTableIndex = 141,
    WdfInterruptQueueDpcForIsrTableIndex = 142,
    WdfInterruptSynchronizeTableIndex = 143,
    WdfInterruptAcquireLockTableIndex = 144,
    WdfInterruptReleaseLockTableIndex = 145,
    WdfInterruptEnableTableIndex = 146,
    WdfInterruptDisableTableIndex = 147,
    WdfInterruptWdmGetInterruptTableIndex = 148,
    WdfInterruptGetInfoTableIndex = 149,
    WdfInterruptSetPolicyTableIndex = 150,
    WdfInterruptGetDeviceTableIndex = 151,
    WdfIoQueueCreateTableIndex = 152,
    WdfIoQueueGetStateTableIndex = 153,
    WdfIoQueueStartTableIndex = 154,
    WdfIoQueueStopTableIndex = 155,
    WdfIoQueueStopSynchronouslyTableIndex = 156,
    WdfIoQueueGetDeviceTableIndex = 157,
    WdfIoQueueRetrieveNextRequestTableIndex = 158,
    WdfIoQueueRetrieveRequestByFileObjectTableIndex = 159,
    WdfIoQueueFindRequestTableIndex = 160,
    WdfIoQueueRetrieveFoundRequestTableIndex = 161,
    WdfIoQueueDrainSynchronouslyTableIndex = 162,
    WdfIoQueueDrainTableIndex = 163,
    WdfIoQueuePurgeSynchronouslyTableIndex = 164,
    WdfIoQueuePurgeTableIndex = 165,
    WdfIoQueueReadyNotifyTableIndex = 166,
    WdfIoTargetCreateTableIndex = 167,
    WdfIoTargetOpenTableIndex = 168,
    WdfIoTargetCloseForQueryRemoveTableIndex = 169,
    WdfIoTargetCloseTableIndex = 170,
    WdfIoTargetStartTableIndex = 171,
    WdfIoTargetStopTableIndex = 172,
    WdfIoTargetGetStateTableIndex = 173,
    WdfIoTargetGetDeviceTableIndex = 174,
    WdfIoTargetQueryTargetPropertyTableIndex = 175,
    WdfIoTargetAllocAndQueryTargetPropertyTableIndex = 176,
    WdfIoTargetQueryForInterfaceTableIndex = 177,
    WdfIoTargetWdmGetTargetDeviceObjectTableIndex = 178,
    WdfIoTargetWdmGetTargetPhysicalDeviceTableIndex = 179,
    WdfIoTargetWdmGetTargetFileObjectTableIndex = 180,
    WdfIoTargetWdmGetTargetFileHandleTableIndex = 181,
    WdfIoTargetSendReadSynchronouslyTableIndex = 182,
    WdfIoTargetFormatRequestForReadTableIndex = 183,
    WdfIoTargetSendWriteSynchronouslyTableIndex = 184,
    WdfIoTargetFormatRequestForWriteTableIndex = 185,
    WdfIoTargetSendIoctlSynchronouslyTableIndex = 186,
    WdfIoTargetFormatRequestForIoctlTableIndex = 187,
    WdfIoTargetSendInternalIoctlSynchronouslyTableIndex = 188,
    WdfIoTargetFormatRequestForInternalIoctlTableIndex = 189,
    WdfIoTargetSendInternalIoctlOthersSynchronouslyTableIndex = 190,
    WdfIoTargetFormatRequestForInternalIoctlOthersTableIndex = 191,
    WdfMemoryCreateTableIndex = 192,
    WdfMemoryCreatePreallocatedTableIndex = 193,
    WdfMemoryGetBufferTableIndex = 194,
    WdfMemoryAssignBufferTableIndex = 195,
    WdfMemoryCopyToBufferTableIndex = 196,
    WdfMemoryCopyFromBufferTableIndex = 197,
    WdfLookasideListCreateTableIndex = 198,
    WdfMemoryCreateFromLookasideTableIndex = 199,
    WdfDeviceMiniportCreateTableIndex = 200,
    WdfDriverMiniportUnloadTableIndex = 201,
    WdfObjectGetTypedContextWorkerTableIndex = 202,
    WdfObjectAllocateContextTableIndex = 203,
    WdfObjectContextGetObjectTableIndex = 204,
    WdfObjectReferenceActualTableIndex = 205,
    WdfObjectDereferenceActualTableIndex = 206,
    WdfObjectCreateTableIndex = 207,
    WdfObjectDeleteTableIndex = 208,
    WdfObjectQueryTableIndex = 209,
    WdfPdoInitAllocateTableIndex = 210,
    WdfPdoInitSetEventCallbacksTableIndex = 211,
    WdfPdoInitAssignDeviceIDTableIndex = 212,
    WdfPdoInitAssignInstanceIDTableIndex = 213,
    WdfPdoInitAddHardwareIDTableIndex = 214,
    WdfPdoInitAddCompatibleIDTableIndex = 215,
    WdfPdoInitAddDeviceTextTableIndex = 216,
    WdfPdoInitSetDefaultLocaleTableIndex = 217,
    WdfPdoInitAssignRawDeviceTableIndex = 218,
    WdfPdoMarkMissingTableIndex = 219,
    WdfPdoRequestEjectTableIndex = 220,
    WdfPdoGetParentTableIndex = 221,
    WdfPdoRetrieveIdentificationDescriptionTableIndex = 222,
    WdfPdoRetrieveAddressDescriptionTableIndex = 223,
    WdfPdoUpdateAddressDescriptionTableIndex = 224,
    WdfPdoAddEjectionRelationsPhysicalDeviceTableIndex = 225,
    WdfPdoRemoveEjectionRelationsPhysicalDeviceTableIndex = 226,
    WdfPdoClearEjectionRelationsDevicesTableIndex = 227,
    WdfDeviceAddQueryInterfaceTableIndex = 228,
    WdfRegistryOpenKeyTableIndex = 229,
    WdfRegistryCreateKeyTableIndex = 230,
    WdfRegistryCloseTableIndex = 231,
    WdfRegistryWdmGetHandleTableIndex = 232,
    WdfRegistryRemoveKeyTableIndex = 233,
    WdfRegistryRemoveValueTableIndex = 234,
    WdfRegistryQueryValueTableIndex = 235,
    WdfRegistryQueryMemoryTableIndex = 236,
    WdfRegistryQueryMultiStringTableIndex = 237,
    WdfRegistryQueryUnicodeStringTableIndex = 238,
    WdfRegistryQueryStringTableIndex = 239,
    WdfRegistryQueryULongTableIndex = 240,
    WdfRegistryAssignValueTableIndex = 241,
    WdfRegistryAssignMemoryTableIndex = 242,
    WdfRegistryAssignMultiStringTableIndex = 243,
    WdfRegistryAssignUnicodeStringTableIndex = 244,
    WdfRegistryAssignStringTableIndex = 245,
    WdfRegistryAssignULongTableIndex = 246,
    WdfRequestCreateTableIndex = 247,
    WdfRequestCreateFromIrpTableIndex = 248,
    WdfRequestReuseTableIndex = 249,
    WdfRequestChangeTargetTableIndex = 250,
    WdfRequestFormatRequestUsingCurrentTypeTableIndex = 251,
    WdfRequestWdmFormatUsingStackLocationTableIndex = 252,
    WdfRequestSendTableIndex = 253,
    WdfRequestGetStatusTableIndex = 254,
    WdfRequestMarkCancelableTableIndex = 255,
    WdfRequestUnmarkCancelableTableIndex = 256,
    WdfRequestIsCanceledTableIndex = 257,
    WdfRequestCancelSentRequestTableIndex = 258,
    WdfRequestIsFrom32BitProcessTableIndex = 259,
    WdfRequestSetCompletionRoutineTableIndex = 260,
    WdfRequestGetCompletionParamsTableIndex = 261,
    WdfRequestAllocateTimerTableIndex = 262,
    WdfRequestCompleteTableIndex = 263,
    WdfRequestCompleteWithPriorityBoostTableIndex = 264,
    WdfRequestCompleteWithInformationTableIndex = 265,
    WdfRequestGetParametersTableIndex = 266,
    WdfRequestRetrieveInputMemoryTableIndex = 267,
    WdfRequestRetrieveOutputMemoryTableIndex = 268,
    WdfRequestRetrieveInputBufferTableIndex = 269,
    WdfRequestRetrieveOutputBufferTableIndex = 270,
    WdfRequestRetrieveInputWdmMdlTableIndex = 271,
    WdfRequestRetrieveOutputWdmMdlTableIndex = 272,
    WdfRequestRetrieveUnsafeUserInputBufferTableIndex = 273,
    WdfRequestRetrieveUnsafeUserOutputBufferTableIndex = 274,
    WdfRequestSetInformationTableIndex = 275,
    WdfRequestGetInformationTableIndex = 276,
    WdfRequestGetFileObjectTableIndex = 277,
    WdfRequestProbeAndLockUserBufferForReadTableIndex = 278,
    WdfRequestProbeAndLockUserBufferForWriteTableIndex = 279,
    WdfRequestGetRequestorModeTableIndex = 280,
    WdfRequestForwardToIoQueueTableIndex = 281,
    WdfRequestGetIoQueueTableIndex = 282,
    WdfRequestRequeueTableIndex = 283,
    WdfRequestStopAcknowledgeTableIndex = 284,
    WdfRequestWdmGetIrpTableIndex = 285,
    WdfIoResourceRequirementsListSetSlotNumberTableIndex = 286,
    WdfIoResourceRequirementsListSetInterfaceTypeTableIndex = 287,
    WdfIoResourceRequirementsListAppendIoResListTableIndex = 288,
    WdfIoResourceRequirementsListInsertIoResListTableIndex = 289,
    WdfIoResourceRequirementsListGetCountTableIndex = 290,
    WdfIoResourceRequirementsListGetIoResListTableIndex = 291,
    WdfIoResourceRequirementsListRemoveTableIndex = 292,
    WdfIoResourceRequirementsListRemoveByIoResListTableIndex = 293,
    WdfIoResourceListCreateTableIndex = 294,
    WdfIoResourceListAppendDescriptorTableIndex = 295,
    WdfIoResourceListInsertDescriptorTableIndex = 296,
    WdfIoResourceListUpdateDescriptorTableIndex = 297,
    WdfIoResourceListGetCountTableIndex = 298,
    WdfIoResourceListGetDescriptorTableIndex = 299,
    WdfIoResourceListRemoveTableIndex = 300,
    WdfIoResourceListRemoveByDescriptorTableIndex = 301,
    WdfCmResourceListAppendDescriptorTableIndex = 302,
    WdfCmResourceListInsertDescriptorTableIndex = 303,
    WdfCmResourceListGetCountTableIndex = 304,
    WdfCmResourceListGetDescriptorTableIndex = 305,
    WdfCmResourceListRemoveTableIndex = 306,
    WdfCmResourceListRemoveByDescriptorTableIndex = 307,
    WdfStringCreateTableIndex = 308,
    WdfStringGetUnicodeStringTableIndex = 309,
    WdfObjectAcquireLockTableIndex = 310,
    WdfObjectReleaseLockTableIndex = 311,
    WdfWaitLockCreateTableIndex = 312,
    WdfWaitLockAcquireTableIndex = 313,
    WdfWaitLockReleaseTableIndex = 314,
    WdfSpinLockCreateTableIndex = 315,
    WdfSpinLockAcquireTableIndex = 316,
    WdfSpinLockReleaseTableIndex = 317,
    WdfTimerCreateTableIndex = 318,
    WdfTimerStartTableIndex = 319,
    WdfTimerStopTableIndex = 320,
    WdfTimerGetParentObjectTableIndex = 321,
    WdfUsbTargetDeviceCreateTableIndex = 322,
    WdfUsbTargetDeviceRetrieveInformationTableIndex = 323,
    WdfUsbTargetDeviceGetDeviceDescriptorTableIndex = 324,
    WdfUsbTargetDeviceRetrieveConfigDescriptorTableIndex = 325,
    WdfUsbTargetDeviceQueryStringTableIndex = 326,
    WdfUsbTargetDeviceAllocAndQueryStringTableIndex = 327,
    WdfUsbTargetDeviceFormatRequestForStringTableIndex = 328,
    WdfUsbTargetDeviceGetNumInterfacesTableIndex = 329,
    WdfUsbTargetDeviceSelectConfigTableIndex = 330,
    WdfUsbTargetDeviceWdmGetConfigurationHandleTableIndex = 331,
    WdfUsbTargetDeviceRetrieveCurrentFrameNumberTableIndex = 332,
    WdfUsbTargetDeviceSendControlTransferSynchronouslyTableIndex = 333,
    WdfUsbTargetDeviceFormatRequestForControlTransferTableIndex = 334,
    WdfUsbTargetDeviceIsConnectedSynchronousTableIndex = 335,
    WdfUsbTargetDeviceResetPortSynchronouslyTableIndex = 336,
    WdfUsbTargetDeviceCyclePortSynchronouslyTableIndex = 337,
    WdfUsbTargetDeviceFormatRequestForCyclePortTableIndex = 338,
    WdfUsbTargetDeviceSendUrbSynchronouslyTableIndex = 339,
    WdfUsbTargetDeviceFormatRequestForUrbTableIndex = 340,
    WdfUsbTargetPipeGetInformationTableIndex = 341,
    WdfUsbTargetPipeIsInEndpointTableIndex = 342,
    WdfUsbTargetPipeIsOutEndpointTableIndex = 343,
    WdfUsbTargetPipeGetTypeTableIndex = 344,
    WdfUsbTargetPipeSetNoMaximumPacketSizeCheckTableIndex = 345,
    WdfUsbTargetPipeWriteSynchronouslyTableIndex = 346,
    WdfUsbTargetPipeFormatRequestForWriteTableIndex = 347,
    WdfUsbTargetPipeReadSynchronouslyTableIndex = 348,
    WdfUsbTargetPipeFormatRequestForReadTableIndex = 349,
    WdfUsbTargetPipeConfigContinuousReaderTableIndex = 350,
    WdfUsbTargetPipeAbortSynchronouslyTableIndex = 351,
    WdfUsbTargetPipeFormatRequestForAbortTableIndex = 352,
    WdfUsbTargetPipeResetSynchronouslyTableIndex = 353,
    WdfUsbTargetPipeFormatRequestForResetTableIndex = 354,
    WdfUsbTargetPipeSendUrbSynchronouslyTableIndex = 355,
    WdfUsbTargetPipeFormatRequestForUrbTableIndex = 356,
    WdfUsbInterfaceGetInterfaceNumberTableIndex = 357,
    WdfUsbInterfaceGetNumEndpointsTableIndex = 358,
    WdfUsbInterfaceGetDescriptorTableIndex = 359,
    WdfUsbInterfaceSelectSettingTableIndex = 360,
    WdfUsbInterfaceGetEndpointInformationTableIndex = 361,
    WdfUsbTargetDeviceGetInterfaceTableIndex = 362,
    WdfUsbInterfaceGetConfiguredSettingIndexTableIndex = 363,
    WdfUsbInterfaceGetNumConfiguredPipesTableIndex = 364,
    WdfUsbInterfaceGetConfiguredPipeTableIndex = 365,
    WdfUsbTargetPipeWdmGetPipeHandleTableIndex = 366,
    WdfVerifierDbgBreakPointTableIndex = 367,
    WdfVerifierKeBugCheckTableIndex = 368,
    WdfWmiProviderCreateTableIndex = 369,
    WdfWmiProviderGetDeviceTableIndex = 370,
    WdfWmiProviderIsEnabledTableIndex = 371,
    WdfWmiProviderGetTracingHandleTableIndex = 372,
    WdfWmiInstanceCreateTableIndex = 373,
    WdfWmiInstanceRegisterTableIndex = 374,
    WdfWmiInstanceDeregisterTableIndex = 375,
    WdfWmiInstanceGetDeviceTableIndex = 376,
    WdfWmiInstanceGetProviderTableIndex = 377,
    WdfWmiInstanceFireEventTableIndex = 378,
    WdfWorkItemCreateTableIndex = 379,
    WdfWorkItemEnqueueTableIndex = 380,
    WdfWorkItemGetParentObjectTableIndex = 381,
    WdfWorkItemFlushTableIndex = 382,
    WdfCommonBufferCreateWithConfigTableIndex = 383,
    WdfDmaEnablerGetFragmentLengthTableIndex = 384,
    WdfDmaEnablerWdmGetDmaAdapterTableIndex = 385,
    WdfUsbInterfaceGetNumSettingsTableIndex = 386,
    WdfDeviceRemoveDependentUsageDeviceObjectTableIndex = 387,
    WdfDeviceGetSystemPowerActionTableIndex = 388,
    WdfInterruptSetExtendedPolicyTableIndex = 389,
    WdfIoQueueAssignForwardProgressPolicyTableIndex = 390,
    WdfPdoInitAssignContainerIDTableIndex = 391,
    WdfPdoInitAllowForwardingRequestToParentTableIndex = 392,
    WdfRequestMarkCancelableExTableIndex = 393,
    WdfRequestIsReservedTableIndex = 394,
    WdfRequestForwardToParentDeviceIoQueueTableIndex = 395,
    WdfCxDeviceInitAllocateTableIndex = 396,
    WdfCxDeviceInitAssignWdmIrpPreprocessCallbackTableIndex = 397,
    WdfCxDeviceInitSetIoInCallerContextCallbackTableIndex = 398,
    WdfCxDeviceInitSetRequestAttributesTableIndex = 399,
    WdfCxDeviceInitSetFileObjectConfigTableIndex = 400,
    WdfDeviceWdmDispatchIrpTableIndex = 401,
    WdfDeviceWdmDispatchIrpToIoQueueTableIndex = 402,
    WdfDeviceInitSetRemoveLockOptionsTableIndex = 403,
    WdfDeviceConfigureWdmIrpDispatchCallbackTableIndex = 404,
    WdfDmaEnablerConfigureSystemProfileTableIndex = 405,
    WdfDmaTransactionInitializeUsingOffsetTableIndex = 406,
    WdfDmaTransactionGetTransferInfoTableIndex = 407,
    WdfDmaTransactionSetChannelConfigurationCallbackTableIndex = 408,
    WdfDmaTransactionSetTransferCompleteCallbackTableIndex = 409,
    WdfDmaTransactionSetImmediateExecutionTableIndex = 410,
    WdfDmaTransactionAllocateResourcesTableIndex = 411,
    WdfDmaTransactionSetDeviceAddressOffsetTableIndex = 412,
    WdfDmaTransactionFreeResourcesTableIndex = 413,
    WdfDmaTransactionCancelTableIndex = 414,
    WdfDmaTransactionWdmGetTransferContextTableIndex = 415,
    WdfInterruptQueueWorkItemForIsrTableIndex = 416,
    WdfInterruptTryToAcquireLockTableIndex = 417,
    WdfIoQueueStopAndPurgeTableIndex = 418,
    WdfIoQueueStopAndPurgeSynchronouslyTableIndex = 419,
    WdfIoTargetPurgeTableIndex = 420,
    WdfUsbTargetDeviceCreateWithConfigTableIndex = 421,
    WdfUsbTargetDeviceQueryUsbCapabilityTableIndex = 422,
    WdfUsbTargetDeviceCreateUrbTableIndex = 423,
    WdfUsbTargetDeviceCreateIsochUrbTableIndex = 424,
    WdfDeviceWdmAssignPowerFrameworkSettingsTableIndex = 425,
    WdfDmaTransactionStopSystemTransferTableIndex = 426,
    WdfCxVerifierKeBugCheckTableIndex = 427,
    WdfInterruptReportActiveTableIndex = 428,
    WdfInterruptReportInactiveTableIndex = 429,
    WdfFunctionTableNumEntries = 430
};

enum _WDF_REQUEST_SEND_OPTIONS_FLAGS {
    WDF_REQUEST_SEND_OPTION_TIMEOUT = 1,
    WDF_REQUEST_SEND_OPTION_SYNCHRONOUS = 2,
    WDF_REQUEST_SEND_OPTION_IGNORE_TARGET_STATE = 4,
    WDF_REQUEST_SEND_OPTION_SEND_AND_FORGET = 8
};

struct _USB_30_PORT_CHANGE {
    unsigned short  AsUshort16; /*  +0x0000  */
    /* unsigned char ConnectStatusChange[0];  +0x0000 b1 1b 00 00  */
    /* unsigned char Reserved2[0];  +0x0000 e3 1c 00 00  */
    /* unsigned char OverCurrentIndicatorChange[0];  +0x0000 b4 1b 00 00  */
    /* unsigned char ResetChange[0];  +0x0000 b5 1b 00 00  */
    /* unsigned char BHResetChange[0];  +0x0000 e4 1c 00 00  */
    /* unsigned char PortLinkStateChange[0];  +0x0000 e5 1c 00 00  */
    /* unsigned char PortConfigErrorChange[0];  +0x0000 e6 1c 00 00  */
    unsigned char Reserved3[2]; /*  +0x0000 e7 1c 00 00  */
};

struct _USB_20_PORT_CHANGE {
    unsigned short  AsUshort16; /*  +0x0000  */
    /* unsigned char ConnectStatusChange[0];  +0x0000 b1 1b 00 00  */
    /* unsigned char PortEnableDisableChange[0];  +0x0000 b2 1b 00 00  */
    /* unsigned char SuspendChange[0];  +0x0000 b3 1b 00 00  */
    /* unsigned char OverCurrentIndicatorChange[0];  +0x0000 b4 1b 00 00  */
    /* unsigned char ResetChange[0];  +0x0000 b5 1b 00 00  */
    unsigned char Reserved2[2]; /*  +0x0000 b6 1b 00 00  */
};

struct _FAST_IO_DISPATCH {
    unsigned long  SizeOfFastIoDispatch; /*  +0x0000  */
    unsigned char FastIoCheckIfPossible[4]; /*  +0x0004 ee 1c 00 00  */
    unsigned char FastIoRead[4]; /*  +0x0008 f1 1c 00 00  */
    unsigned char FastIoWrite[4]; /*  +0x000c f1 1c 00 00  */
    unsigned char FastIoQueryBasicInfo[4]; /*  +0x0010 f6 1c 00 00  */
    unsigned char FastIoQueryStandardInfo[4]; /*  +0x0014 fb 1c 00 00  */
    unsigned char FastIoLock[4]; /*  +0x0018 00 1d 00 00  */
    unsigned char FastIoUnlockSingle[4]; /*  +0x001c 03 1d 00 00  */
    unsigned char FastIoUnlockAll[4]; /*  +0x0020 06 1d 00 00  */
    unsigned char FastIoUnlockAllByKey[4]; /*  +0x0024 09 1d 00 00  */
    unsigned char FastIoDeviceControl[4]; /*  +0x0028 0c 1d 00 00  */
    unsigned char AcquireFileForNtCreateSection[4]; /*  +0x002c 0f 1d 00 00  */
    unsigned char ReleaseFileForNtCreateSection[4]; /*  +0x0030 0f 1d 00 00  */
    unsigned char FastIoDetachDevice[4]; /*  +0x0034 12 1d 00 00  */
    unsigned char FastIoQueryNetworkOpenInfo[4]; /*  +0x0038 17 1d 00 00  */
    unsigned char AcquireForModWrite[4]; /*  +0x003c 1b 1d 00 00  */
    unsigned char MdlRead[4]; /*  +0x0040 1e 1d 00 00  */
    unsigned char MdlReadComplete[4]; /*  +0x0044 21 1d 00 00  */
    unsigned char PrepareMdlWrite[4]; /*  +0x0048 1e 1d 00 00  */
    unsigned char MdlWriteComplete[4]; /*  +0x004c 24 1d 00 00  */
    unsigned char FastIoReadCompressed[4]; /*  +0x0050 29 1d 00 00  */
    unsigned char FastIoWriteCompressed[4]; /*  +0x0054 29 1d 00 00  */
    unsigned char MdlReadCompleteCompressed[4]; /*  +0x0058 21 1d 00 00  */
    unsigned char MdlWriteCompleteCompressed[4]; /*  +0x005c 24 1d 00 00  */
    unsigned char FastIoQueryOpen[4]; /*  +0x0060 2c 1d 00 00  */
    unsigned char ReleaseForModWrite[4]; /*  +0x0064 2f 1d 00 00  */
    unsigned char AcquireForCcFlush[4]; /*  +0x0068 32 1d 00 00  */
    unsigned char ReleaseForCcFlush[4]; /*  +0x006c 32 1d 00 00  */
};

struct _CONFIG_VALIDATION_FLAGS {
    unsigned long  AsUlong; /*  +0x0000  */
    /* unsigned char FirstInterfaceFound[0];  +0x0000 96 18 00 00  */
    /* unsigned char FirstEndpointFound[0];  +0x0000 16 1b 00 00  */
    /* unsigned char ExpectingEndpointCompanion[0];  +0x0000 17 1b 00 00  */
    unsigned char EndpointCompanionFound[4]; /*  +0x0000 18 1b 00 00  */
};

enum _WDF_REQUEST_FORWARD_OPTIONS_FLAGS {
    WDF_REQUEST_FORWARD_OPTION_SEND_AND_FORGET = 1
};

struct _USB_SEL_INFO {
    unsigned char  U1SEL; /*  +0x0000  */
    unsigned char  U1PEL; /*  +0x0001  */
    unsigned short  U2SEL; /*  +0x0002  */
    unsigned short  U2PEL; /*  +0x0004  */
};

struct _HSM_MUX_FLAGS {
    /* unsigned char InterruptReferenceReleasePending[0];  +0x0000 96 18 00 00  */
    /* unsigned char FailInterruptReferenceAcquired[0];  +0x0000 16 1b 00 00  */
    /* unsigned char HubResetEnabled[0];  +0x0000 17 1b 00 00  */
    unsigned char FailDsmRegistration[4]; /*  +0x0000 18 1b 00 00  */
    unsigned long  HubResetInProgress; /*  +0x0004  */
};

struct _URB_CONTROL_GET_CONFIGURATION_REQUEST {
    unsigned char Hdr[16]; /*  +0x0000 79 18 00 00  */
    void *Reserved; /*  +0x0010  */
    unsigned long  Reserved0; /*  +0x0014  */
    unsigned long  TransferBufferLength; /*  +0x0018  */
    void *TransferBuffer; /*  +0x001c  */
    unsigned char TransferBufferMDL[4]; /*  +0x0020 90 10 00 00  */
    unsigned char UrbLink[4]; /*  +0x0024 78 18 00 00  */
    unsigned char hca[32]; /*  +0x0028 ae 1a 00 00  */
    unsigned char Reserved1[8]; /*  +0x0048 c6 11 00 00  */
};

enum _CONTROLLER_TYPE {
    ControllerTypeXhci = 0,
    ControllerTypeSoftXhci = 1
};

struct _ROOTHUB_INFO {
    unsigned long  Size; /*  +0x0000  */
    void *UsbdInterruptPipeHandle; /*  +0x0004  */
    unsigned char ControllerType[4]; /*  +0x0008 40 1d 00 00  */
    unsigned short  NumberOf20Ports; /*  +0x000c  */
    unsigned short  NumberOf30Ports; /*  +0x000e  */
    unsigned short  MaxU1ExitLatency; /*  +0x0010  */
    unsigned short  MaxU2ExitLatency; /*  +0x0012  */
};

struct _FILE_BASIC_INFORMATION {
    unsigned char CreationTime[8]; /*  +0x0000 3a 10 00 00  */
    unsigned char LastAccessTime[8]; /*  +0x0008 3a 10 00 00  */
    unsigned char LastWriteTime[8]; /*  +0x0010 3a 10 00 00  */
    unsigned char ChangeTime[8]; /*  +0x0018 3a 10 00 00  */
    unsigned long  FileAttributes; /*  +0x0020  */
};

/* struct <unnamed-tag> {
    unsigned char CurrentState[4];  +0x0000 b8 13 00 00 
    unsigned char NewState[4];  +0x0004 b8 13 00 00 
}; */

/* struct <unnamed-tag> {
    unsigned char CurrentState[4];  +0x0000 b8 13 00 00 
}; */

/* struct <unnamed-tag> {
    /* unsigned char EnterState[0];  +0x0000 46 1d 00 00 
    /* unsigned char PostProcessState[0];  +0x0000 48 1d 00 00 
    unsigned char LeaveState[8];  +0x0000 46 1d 00 00 
}; */

struct _WDF_DEVICE_PNP_NOTIFICATION_DATA {
    unsigned char Type[4]; /*  +0x0000 38 1b 00 00  */
    unsigned char Data[8]; /*  +0x0004 4a 1d 00 00  */
};

struct _IO_SECURITY_CONTEXT {
    unsigned char SecurityQos[4]; /*  +0x0000 4e 1d 00 00  */
    unsigned char AccessState[4]; /*  +0x0004 50 1d 00 00  */
    unsigned long  DesiredAccess; /*  +0x0008  */
    unsigned long  FullCreateOptions; /*  +0x000c  */
};

struct _URB_GET_FRAME_LENGTH {
    unsigned char Hdr[16]; /*  +0x0000 79 18 00 00  */
    unsigned long  FrameLength; /*  +0x0010  */
    unsigned long  FrameNumber; /*  +0x0014  */
};

struct _REQUEST_REMOTE_WAKE_NOTIFICATION {
    unsigned short  Version; /*  +0x0000  */
    unsigned short  Size; /*  +0x0002  */
    unsigned char UsbdFunctionHandle[4]; /*  +0x0004 56 1d 00 00  */
    unsigned long  Interface; /*  +0x0008  */
};

struct _URB_SET_FRAME_LENGTH {
    unsigned char Hdr[16]; /*  +0x0000 79 18 00 00  */
    long  FrameLengthDelta; /*  +0x0010  */
};

struct _URB_OS_FEATURE_DESCRIPTOR_REQUEST {
    unsigned char Hdr[16]; /*  +0x0000 79 18 00 00  */
    void *Reserved; /*  +0x0010  */
    unsigned long  Reserved0; /*  +0x0014  */
    unsigned long  TransferBufferLength; /*  +0x0018  */
    void *TransferBuffer; /*  +0x001c  */
    unsigned char TransferBufferMDL[4]; /*  +0x0020 90 10 00 00  */
    unsigned char UrbLink[4]; /*  +0x0024 78 18 00 00  */
    unsigned char hca[32]; /*  +0x0028 ae 1a 00 00  */
    /* unsigned char Recipient[0];  +0x0048 30 1c 00 00  */
    unsigned char Reserved1[1]; /*  +0x0048 31 1c 00 00  */
    unsigned char  Reserved2; /*  +0x0049  */
    unsigned char  InterfaceNumber; /*  +0x004a  */
    unsigned char  MS_PageIndex; /*  +0x004b  */
    unsigned short  MS_FeatureDescriptorIndex; /*  +0x004c  */
    unsigned short  Reserved3; /*  +0x004e  */
};

struct _PORT_FLAGS {
    /* unsigned char PortFlagRemovable[0];  +0x0000 96 18 00 00  */
    /* unsigned char PortFlagAcpiUpcValid[0];  +0x0000 16 1b 00 00  */
    /* unsigned char PortFlagAcpiPldValid[0];  +0x0000 17 1b 00 00  */
    /* unsigned char PortFlagDebugCapable[0];  +0x0000 18 1b 00 00  */
    /* unsigned char PortFlagIntegratedHubImplemented[0];  +0x0000 19 1b 00 00  */
    unsigned char PortFlagRegisteredWithConnectorMap[4]; /*  +0x0000 1a 1b 00 00  */
};

struct _MAILSLOT_CREATE_PARAMETERS {
    unsigned long  MailslotQuota; /*  +0x0000  */
    unsigned long  MaximumMessageSize; /*  +0x0004  */
    unsigned char ReadTimeout[8]; /*  +0x0008 3a 10 00 00  */
    unsigned char  TimeoutSpecified; /*  +0x0010  */
};

struct _URB_FRAME_LENGTH_CONTROL {
    unsigned char Hdr[16]; /*  +0x0000 79 18 00 00  */
};

struct _USB_DEVICE_PORT_PATH {
    unsigned long  Size; /*  +0x0000  */
    unsigned long  PortPathDepth; /*  +0x0004  */
    unsigned long  TTHubDepth; /*  +0x0008  */
    unsigned char PortPath[24]; /*  +0x000c a2 1c 00 00  */
};

struct _NAMED_PIPE_CREATE_PARAMETERS {
    unsigned long  NamedPipeType; /*  +0x0000  */
    unsigned long  ReadMode; /*  +0x0004  */
    unsigned long  CompletionMode; /*  +0x0008  */
    unsigned long  MaximumInstances; /*  +0x000c  */
    unsigned long  InboundQuota; /*  +0x0010  */
    unsigned long  OutboundQuota; /*  +0x0014  */
    unsigned char DefaultTimeout[8]; /*  +0x0018 3a 10 00 00  */
    unsigned char  TimeoutSpecified; /*  +0x0020  */
};

enum _WDF_REQUEST_REUSE_FLAGS {
    WDF_REQUEST_REUSE_NO_FLAGS = 0,
    WDF_REQUEST_REUSE_SET_NEW_IRP = 1,
    WDF_REQUEST_REUSE_CX_FLAG1 = 2
};

struct _USB_30_HUB_DESCRIPTOR {
    unsigned char  bLength; /*  +0x0000  */
    unsigned char  bDescriptorType; /*  +0x0001  */
    unsigned char  bNumberOfPorts; /*  +0x0002  */
    unsigned short  wHubCharacteristics; /*  +0x0003  */
    unsigned char  bPowerOnToPowerGood; /*  +0x0005  */
    unsigned char  bHubControlCurrent; /*  +0x0006  */
    unsigned char  bHubHdrDecLat; /*  +0x0007  */
    unsigned short  wHubDelay; /*  +0x0008  */
    unsigned short  DeviceRemovable; /*  +0x000a  */
};

struct _LPM_VALUES {
    unsigned char  U1Enabled; /*  +0x0000  */
    unsigned char  U2Enabled; /*  +0x0001  */
    unsigned char  ControlU1Timeout; /*  +0x0002  */
    unsigned char  ControlU2Timeout; /*  +0x0003  */
    unsigned char  BulkU1Timeout; /*  +0x0004  */
    unsigned char  BulkU2Timeout; /*  +0x0005  */
    unsigned char  InterruptU1Timeout; /*  +0x0006  */
    unsigned char  InterruptU2Timeout; /*  +0x0007  */
};

struct _DEVOBJ_EXTENSION {
    short  Type; /*  +0x0000  */
    unsigned short  Size; /*  +0x0002  */
    unsigned char DeviceObject[4]; /*  +0x0004 b1 10 00 00  */
};

struct _HUB_FLAGS {
    /* unsigned char IsTtHub[0];  +0x0000 96 18 00 00  */
    /* unsigned char IsMultiTtHub[0];  +0x0000 16 1b 00 00  */
    /* unsigned char PerPortPower[0];  +0x0000 17 1b 00 00  */
    /* unsigned char PortPortOverCurrent[0];  +0x0000 18 1b 00 00  */
    /* unsigned char NoOverCurrentProtection[0];  +0x0000 19 1b 00 00  */
    /* unsigned char Initialized[0];  +0x0000 1a 1b 00 00  */
    /* unsigned char Configured[0];  +0x0000 8f 1b 00 00  */
    /* unsigned char SelectiveSuspendNotSupportedByParentStack[0];  +0x0000 69 1b 00 00  */
    /* unsigned char WakeOnConnect[0];  +0x0000 90 1b 00 00  */
    /* unsigned char HighSpeedCapable[0];  +0x0000 91 1b 00 00  */
    /* unsigned char ArmedForWake[0];  +0x0000 92 1b 00 00  */
    /* unsigned char ResetTTOnCancel[0];  +0x0000 93 1b 00 00  */
    /* unsigned char NoClearTTBufferOnCancel[0];  +0x0000 94 1b 00 00  */
    /* unsigned char PowerOnPortsOnStart[0];  +0x0000 95 1b 00 00  */
    /* unsigned char WdfPowerReferencePending[0];  +0x0000 71 1b 00 00  */
    /* unsigned char DisableLpm[0];  +0x0000 96 1b 00 00  */
    /* unsigned char IgnoreResetInDisconnected[0];  +0x0000 97 1b 00 00  */
    /* unsigned char CanAcquirePowerReference[0];  +0x0000 98 1b 00 00  */
    /* unsigned char InAcpiNamespace[0];  +0x0000 99 1b 00 00  */
    /* unsigned char AddDelayAfterResetComplete[0];  +0x0000 9a 1b 00 00  */
    unsigned char IgnoreU0InDisconnected[4]; /*  +0x0000 9b 1b 00 00  */
};

struct _URB_CONTROL_TRANSFER_EX {
    unsigned char Hdr[16]; /*  +0x0000 79 18 00 00  */
    void *PipeHandle; /*  +0x0010  */
    unsigned long  TransferFlags; /*  +0x0014  */
    unsigned long  TransferBufferLength; /*  +0x0018  */
    void *TransferBuffer; /*  +0x001c  */
    unsigned char TransferBufferMDL[4]; /*  +0x0020 90 10 00 00  */
    unsigned long  Timeout; /*  +0x0024  */
    unsigned char hca[32]; /*  +0x0028 ae 1a 00 00  */
    unsigned char SetupPacket[8]; /*  +0x0048 c6 11 00 00  */
};

struct _TXN_PARAMETER_BLOCK {
    unsigned short  Length; /*  +0x0000  */
    unsigned short  TxFsContext; /*  +0x0002  */
    void *TransactionObject; /*  +0x0004  */
};

struct _USB_HUB_STATUS_AND_CHANGE {
    unsigned long  AsUlong32; /*  +0x0000  */
    unsigned char HubStatus[2]; /*  +0x0000 77 1d 00 00  */
    unsigned char HubChange[2]; /*  +0x0002 78 1d 00 00  */
};

struct _ISM_STATE_TRANSITION {
    unsigned char Event[4]; /*  +0x0000 d3 1a 00 00  */
    unsigned char TargetState[4]; /*  +0x0004 65 1b 00 00  */
};

enum _WDF_WMI_PROVIDER_FLAGS {
    WdfWmiProviderEventOnly = 1,
    WdfWmiProviderExpensive = 2,
    WdfWmiProviderTracing = 4,
    WdfWmiProviderValidFlags = 7
};

struct _SCATTER_GATHER_ELEMENT {
    unsigned char Address[8]; /*  +0x0000 3a 10 00 00  */
    unsigned long  Length; /*  +0x0008  */
    unsigned long  Reserved; /*  +0x000c  */
};

struct _MS_EXT_CONFIG_DESC_HEADER {
    unsigned long  dwLength; /*  +0x0000  */
    unsigned short  bcdVersion; /*  +0x0004  */
    unsigned short  wIndex; /*  +0x0006  */
    unsigned char  bCount; /*  +0x0008  */
    unsigned char reserved[7]; /*  +0x0009 82 1d 00 00  */
};

struct _URB_CONTROL_FEATURE_REQUEST {
    unsigned char Hdr[16]; /*  +0x0000 79 18 00 00  */
    void *Reserved; /*  +0x0010  */
    unsigned long  Reserved2; /*  +0x0014  */
    unsigned long  Reserved3; /*  +0x0018  */
    void *Reserved4; /*  +0x001c  */
    unsigned char Reserved5[4]; /*  +0x0020 90 10 00 00  */
    unsigned char UrbLink[4]; /*  +0x0024 78 18 00 00  */
    unsigned char hca[32]; /*  +0x0028 ae 1a 00 00  */
    unsigned short  Reserved0; /*  +0x0048  */
    unsigned short  FeatureSelector; /*  +0x004a  */
    unsigned short  Index; /*  +0x004c  */
    unsigned short  Reserved1; /*  +0x004e  */
};

struct _MS_EXT_PROP_DESC_HEADER {
    unsigned long  dwLength; /*  +0x0000  */
    unsigned short  bcdVersion; /*  +0x0004  */
    unsigned short  wIndex; /*  +0x0006  */
    unsigned short  wCount; /*  +0x0008  */
};

struct _URB_PIPE_REQUEST {
    unsigned char Hdr[16]; /*  +0x0000 79 18 00 00  */
    void *PipeHandle; /*  +0x0010  */
    unsigned long  Reserved; /*  +0x0014  */
};

struct _MS_EXT_CONFIG_DESC_FUNCTION {
    unsigned char  bFirstInterfaceNumber; /*  +0x0000  */
    unsigned char  bInterfaceCount; /*  +0x0001  */
    unsigned char CompatibleID[8]; /*  +0x0002 c6 11 00 00  */
    unsigned char SubCompatibleID[8]; /*  +0x000a c6 11 00 00  */
    unsigned char reserved[6]; /*  +0x0012 57 1b 00 00  */
};

struct _FILE_NETWORK_OPEN_INFORMATION {
    unsigned char CreationTime[8]; /*  +0x0000 3a 10 00 00  */
    unsigned char LastAccessTime[8]; /*  +0x0008 3a 10 00 00  */
    unsigned char LastWriteTime[8]; /*  +0x0010 3a 10 00 00  */
    unsigned char ChangeTime[8]; /*  +0x0018 3a 10 00 00  */
    unsigned char AllocationSize[8]; /*  +0x0020 3a 10 00 00  */
    unsigned char EndOfFile[8]; /*  +0x0028 3a 10 00 00  */
    unsigned long  FileAttributes; /*  +0x0030  */
};

struct _ENDPOINT_FLAGS {
    unsigned char ZeroBandwidth[4]; /*  +0x0000 96 18 00 00  */
};

/* struct <unnamed-tag> {
    /* unsigned char InitialPrivilegeSet[0];  +0x0000 93 1d 00 00 
    unsigned char PrivilegeSet[44];  +0x0000 94 1d 00 00 
}; */

struct _ACCESS_STATE {
    unsigned char OperationID[8]; /*  +0x0000 98 11 00 00  */
    unsigned char  SecurityEvaluated; /*  +0x0008  */
    unsigned char  GenerateAudit; /*  +0x0009  */
    unsigned char  GenerateOnClose; /*  +0x000a  */
    unsigned char  PrivilegesAllocated; /*  +0x000b  */
    unsigned long  Flags; /*  +0x000c  */
    unsigned long  RemainingDesiredAccess; /*  +0x0010  */
    unsigned long  PreviouslyGrantedAccess; /*  +0x0014  */
    unsigned long  OriginalDesiredAccess; /*  +0x0018  */
    unsigned char SubjectSecurityContext[16]; /*  +0x001c 92 1d 00 00  */
    void *SecurityDescriptor; /*  +0x002c  */
    void *AuxData; /*  +0x0030  */
    unsigned char Privileges[44]; /*  +0x0034 96 1d 00 00  */
    unsigned char  AuditPrivileges; /*  +0x0060  */
    unsigned char ObjectName[8]; /*  +0x0064 2e 10 00 00  */
    unsigned char ObjectTypeName[8]; /*  +0x006c 2e 10 00 00  */
};

enum _REG_NOTIFY_CLASS {
    RegNtDeleteKey = 0,
    RegNtPreDeleteKey = 0,
    RegNtSetValueKey = 1,
    RegNtPreSetValueKey = 1,
    RegNtDeleteValueKey = 2,
    RegNtPreDeleteValueKey = 2,
    RegNtSetInformationKey = 3,
    RegNtPreSetInformationKey = 3,
    RegNtRenameKey = 4,
    RegNtPreRenameKey = 4,
    RegNtEnumerateKey = 5,
    RegNtPreEnumerateKey = 5,
    RegNtEnumerateValueKey = 6,
    RegNtPreEnumerateValueKey = 6,
    RegNtQueryKey = 7,
    RegNtPreQueryKey = 7,
    RegNtQueryValueKey = 8,
    RegNtPreQueryValueKey = 8,
    RegNtQueryMultipleValueKey = 9,
    RegNtPreQueryMultipleValueKey = 9,
    RegNtPreCreateKey = 10,
    RegNtPostCreateKey = 11,
    RegNtPreOpenKey = 12,
    RegNtPostOpenKey = 13,
    RegNtKeyHandleClose = 14,
    RegNtPreKeyHandleClose = 14,
    RegNtPostDeleteKey = 15,
    RegNtPostSetValueKey = 16,
    RegNtPostDeleteValueKey = 17,
    RegNtPostSetInformationKey = 18,
    RegNtPostRenameKey = 19,
    RegNtPostEnumerateKey = 20,
    RegNtPostEnumerateValueKey = 21,
    RegNtPostQueryKey = 22,
    RegNtPostQueryValueKey = 23,
    RegNtPostQueryMultipleValueKey = 24,
    RegNtPostKeyHandleClose = 25,
    RegNtPreCreateKeyEx = 26,
    RegNtPostCreateKeyEx = 27,
    RegNtPreOpenKeyEx = 28,
    RegNtPostOpenKeyEx = 29,
    RegNtPreFlushKey = 30,
    RegNtPostFlushKey = 31,
    RegNtPreLoadKey = 32,
    RegNtPostLoadKey = 33,
    RegNtPreUnLoadKey = 34,
    RegNtPostUnLoadKey = 35,
    RegNtPreQueryKeySecurity = 36,
    RegNtPostQueryKeySecurity = 37,
    RegNtPreSetKeySecurity = 38,
    RegNtPostSetKeySecurity = 39,
    RegNtCallbackObjectContextCleanup = 40,
    RegNtPreRestoreKey = 41,
    RegNtPostRestoreKey = 42,
    RegNtPreSaveKey = 43,
    RegNtPostSaveKey = 44,
    RegNtPreReplaceKey = 45,
    RegNtPostReplaceKey = 46,
    MaxRegNtNotifyClass = 47
};

struct _ROOTHUB_20PORT_INFO {
